[
  {
    "eng_name": "Abekobe Cream",
    "jp_name": "あべこべクリーム Abekobe Kurīmu",
    "description": "When applied to the skin, any hot or cold sensation the skin felt will be the opposite. For example, if a person applied the Abekobe Cream to their skin, and they went out to in the snow wearing only one layer of cloth, they will feel warm instead of cold. Another example is, if they get burned or scalded, they will be frozen instead.",
    "appears_in": [
      "Chapter 14:Hot Hot in the Snow",
      "Doraemon: Nobita's New Great Adventure into the Underworld – The Seven Magic Users",
      "The Snow's Hot, Hot, Hot!",
      "Move Fast, Doraemon! The Galactic Grandprix",
      "Kobe Abe (gadget)",
      "Abekonbe",
      "Nobi Nobita"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/b3/Abeko_Cream.png/revision/latest/scale-to-width-down/350?cb=20150824074408\u0026path-prefix=en"
  },
  {
    "eng_name": "Abekonbe",
    "jp_name": "アベコンベ",
    "description": "When the head of the Abekonbe hits an object, either the object's function, position or action will be reversed. For example, if the Abekonbe is used on a refrigerator, the refrigerator will be hot instead of cold. Another example is, if used on something light, it will become heavy instead.\nThe Abekonbe's effect is rather complicated, as multiple aspects of the object may be reversed.",
    "appears_in": [
      "Kobe Abe (gadget)",
      "Abekobe Cream"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/c9/Abekonbe.PNG/revision/latest/scale-to-width-down/350?cb=20150802122258\u0026path-prefix=en"
  },
  {
    "eng_name": "Action Interlocking Mat",
    "jp_name": "アクション連動マット \"Akushon rendō matto\"",
    "description": "To use this gadget. First, you must attach a green star chip to the desired object. The attached star chip will light up and connect to a VR (Virtual reality). Then you can move the object according to your body movements by standing on the dancing mattress such as doing a breakdance.",
    "appears_in": [
      "Stationery Breakdance"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/11/Action_Interlocking_Mat.png/revision/latest/scale-to-width-down/350?cb=20240930025434\u0026path-prefix=en"
  },
  {
    "eng_name": "Air Cannon",
    "jp_name": "空気砲 Kūki-hō",
    "description": "This looks like a miniature muzzle of a real cannon with a tiny iron sight.\nThe Air Cannon fires blasts of pressurized air at the target with an average velocity, requiring electrical energy to function. Impact of its munitions can have varying effects depending on the target.\nIn Doraemon: Nobita's Treasure Island, it is revealed that the cannon's air projectile can be blocked via slicing it as shown when Vivi easily stopped the attack with her blade.\nThe Air Cannon is one of Nobita's gadgets. It is his second gadget and is obtained when Doraemon and Nobita went into the first dungeon. The Air Cannon is a powerful weapon, but unlike the other guns-like gadget Nobita has in the game, he cannot fire it three times consecutively. He also cannot fire it while running, because of its high recoil and does not work in water sections. One hit from the Air Cannon can defeat a normal enemy with one hit, except for the Digging Hermitcrab, which needs to be shot 2 times.\nThe Air Cannon is listed under number 20 out of 61 gadgets in the game.\nThe Air Cannon is one of the first two gadgets obtained. It is charged by holding the action button and shoot by releasing it. You cannot move when attacking.\nAir Cannon is a gadget that we second obtained through the game. It shuffles things to your advantage.\nThe Air Cannon as Water elemental Melee weapons and also a good main hand choice. Obtained from Doramon collaboration event.",
    "appears_in": [
      "A Beautiful Girl that Nobita Loved",
      "The Great Pirate Decisive Battle ~Love Romance of the Southern Sea~",
      "Doraemon: New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Doraemon: Nobita's Treasure Island",
      "Doraemon: Nobita and the Winged Braves",
      "Doraemon: Nobita's Space Heroes",
      "Air Pistol (gadget)",
      "Nobita Nobi"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/f/f7/Cammo.jpg/revision/latest/scale-to-width-down/350?cb=20140430061655\u0026path-prefix=en"
  },
  {
    "eng_name": "Air Conditioning Photo",
    "jp_name": "エアコンフォト Eakonfoto",
    "description": "The Air Conditioning Photo has the same function as the Voodoo Camera, but in photo form.",
    "appears_in": [
      "The Snow is Hot! The Air Conditioning Photo"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/9d/Air_Conditioning_Photo.PNG/revision/latest/scale-to-width-down/350?cb=20160124052211\u0026path-prefix=en"
  },
  {
    "eng_name": "Air Crayon",
    "jp_name": "空気クレヨン Kūki Kureyon",
    "description": "This gadget appears to resemble a perfectly normal crayon, but is used to make drawings and other markings on areas of thin air.",
    "appears_in": [
      "Nobita and the Island of Miracles ~Animal Adventure~",
      "Doraemon: Nobita's Secret Gadget Museum",
      "The Air Crayon",
      "Run, Machine - Horse!",
      "Double Vision"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/13/Air_Crayon_2012_movie.PNG/revision/latest/scale-to-width-down/350?cb=20151021052109\u0026path-prefix=en"
  },
  {
    "eng_name": "Air Pistol (gadget)",
    "jp_name": "(空気ピストル) - (空気ピストルのくすり)",
    "description": "The Air Pistol is equipped on a person's finger. When they point out their finger towards an object or person, they can shoot by shouting \"Bang!\". The Air Pistol has lesser recoil, but also has shorter range and power when compared to the larger Air Cannon. The Air Pistol has a range of around 10 meters (about 35 feet).\nWhile the Medicine Air Pistol is rather similar to it, the Medicine Air Pistol looks like a big bullet. It stores a type of liquid that can be used as artillery when applied on one's finger. When a non-living thing is hit, they'll simply be pushed or blown away, but some objects may break, like a branch, leaf, or fruit. However, when living things like humans, animals and robots (that may sleep) are hit by the bullets, they fall asleep (anesthesia) or fall down. The Air Bullets function like paralysis darts.\nAir Pistol Medicine in DS game.The Air Pistol (Shaped like a bullet) is used in the Challenge game \"けんじゅうおう コンテスト\"(Kenju Contest). The player controls Nobita, and may have up to 10 bullets at a time. To shoot, a player must shout into the microphone (the game prompts a shout of \"Bang!\", but any word is fine). The bullets can be blocked if they hit each other. When a character of the player is hit, they'll fall asleep, unable to wake up until the next game. NPC characters have unlimited bullets.\nWhen replayed in the Main Menu, the Kenju Contest is only played versus other players in Wireless Communication.\nThe Air Pistol is listed under number 18 out of 61 gadgets in the game.",
    "appears_in": [
      "Doraemon",
      "Dorami",
      "Secret Gadget Air Pistol"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/99/Air_pistol.jpg/revision/latest?cb=20140527083316\u0026path-prefix=en"
  },
  {
    "eng_name": "Aladdin's Lamp",
    "jp_name": "アラビンのランプ Arabin'no Ranpu",
    "description": "The Aladdin's Lamp summons the smoke genie that will grant his master any wishes they want. Although they are incredibly obedient and \"resourceful\", the genie's method of granting his master's wishes are radical, and not magical at all. For example, when Nobita asked the genie to finish up his homework, the genie went to see Sensei, and forced him to do the homework, as the genie doesn't know how to. The genie will return to his lamp after one wish \"has been granted\".\nFor serious wishes such as finding one million yen, the genie will threaten everyone in order to grant the user's \"serious wishes\".",
    "appears_in": [
      "Chapter 15:A Ghost of the Lamp's Smoke",
      "Doraemon: Nobita's Secret Gadget Museum",
      "The Magic Lamp without a Genie"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/b9/Aladdin_Lamp.jpg/revision/latest/scale-to-width-down/350?cb=20190630142240\u0026path-prefix=en"
  },
  {
    "eng_name": "All Seasons Badge",
    "jp_name": "オールシーズンバッジ Ōru Shīzun Bajji",
    "description": "There is one dial and four different seasons. Those seasons are: Summer, Winter, Autumn and Spring.\nIt is used to change the season to another season of a specific place with the radius of 100 meters.\nJust spin the dial to whichever season you want to have and this gadget will activate that season in your environment.\nThis gadget is not meant to be played with since if we change the weather too much it can cause serious trouble. If more badges were set, it can cause serious weather troubles too.",
    "appears_in": [
      "Nobita's New Great Adventure into the Underworld – The Seven Magic Users"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/13/22.jpg/revision/latest?cb=20170514140538\u0026path-prefix=en"
  },
  {
    "eng_name": "Almighty Pass",
    "jp_name": "オールマイティーパス Ōrumaitīpasu",
    "description": "This gadget is used to make the user pass into any place.\nAlso, this gadget will expire on the expiry date.",
    "appears_in": [
      "The Almighty Pass",
      "I've Got a Spare Fourth Dimensional Pocket"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/6/6f/Almighty_Pass.PNG/revision/latest/scale-to-width-down/350?cb=20151018121759\u0026path-prefix=en"
  },
  {
    "eng_name": "Animal Light",
    "jp_name": "動物ライト Dōbutsu Raito",
    "description": "You just need to beam the person with the light, then the person will turn into an animal.",
    "appears_in": [
      "Chapter 17:Test Memorizing Toast",
      "Memorization Bread for Testing"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/8/8a/Fuction_of_Animal_Light.PNG/revision/latest/scale-to-width-down/350?cb=20200804084932\u0026path-prefix=en"
  },
  {
    "eng_name": "Animal Transformation Stick",
    "jp_name": "動物変身ステッキ Dōbutsu Henshin Sutekki",
    "description": "It is used to transform a person into an animal. The transformation into an animal depends on what animal the user thinks. The transformation can be reverted when Release Lip is used.",
    "appears_in": [
      "Halloween and Nobi the Frog",
      "Transformation Drink",
      "Animal Transformation Biscuits"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/c5/%E3%83%8F%E3%83%AD%E3%82%A6%E3%82%A3%E3%83%B3%E3%81%A8%E3%81%AE%E3%81%B3%E3%82%AC%E3%82%A8%E3%83%AB.jpg/revision/latest/scale-to-width-down/350?cb=20151114051255\u0026path-prefix=en"
  },
  {
    "eng_name": "Anticipating Promise Machine",
    "jp_name": "先取り約束機 Sakidori Yakusoku-ki",
    "description": "In case of an emergency, a user may need this. Simply ask something in the machine (like take a bath or become full from eating) and it will become true. However, you need to fulfill the promise to do it in reality within a span of time stated in the promise, else the action itself would be unraveled and treated as never happened e.g. you'll become more smelly/hungry than usual.",
    "appears_in": [
      "Nobita and the Haunts of Evil",
      "The New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Doraemon: New Nobita's Great Demon ~Peko and the Exploration Party of 5~"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/39/Promise_Machine.PNG/revision/latest/scale-to-width-down/350?cb=20151011102527\u0026path-prefix=en"
  },
  {
    "eng_name": "Anything is Violin",
    "jp_name": "なんでもバイオリン \"Nandemo Baiorin\"",
    "description": "Anything is Violin (なんでもバイオリン Nandemo Baiorin), is a one of gadget owned by Doraemon.\nShizuka accidently broke her violin while she was practicing. In order to make her happy, Nobita ask Doraemon to do something good for her, So Doraemon takes out a \"Anything is Violin\" to make Shizuka happy again. Any object rubbed by this tool Will turn into like a sound of original violin, such as a racket, ballon, cotton candy, and even Shizuka most favorite food is Called Roasted sweet potatos.",
    "appears_in": [
      "Shizuka's Roasted Sweet Potato Symphony"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/31/Anything_Is_Violin.jpeg/revision/latest/scale-to-width-down/350?cb=20240816035955\u0026path-prefix=en"
  },
  {
    "eng_name": "Anything Steering Wheel",
    "jp_name": "なんでもそうじゅう機 Nan demo sōjū-ki",
    "description": "It can make anything into a form of transport (including an ice cream cap).",
    "appears_in": [
      "3cm Nobita's Adventures"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/b9/Anything_Wheel.PNG/revision/latest/scale-to-width-down/350?cb=20160727130108\u0026path-prefix=en"
  },
  {
    "eng_name": "Anywhere Cannon",
    "jp_name": "どこでも大ほう, Doko Demo Taihō",
    "description": "Nobita NobiIt looks like a normal cannon. Only it's functions/features are different.\nA user can use this gadget to go wherever they want to go. To do that they have to get inside this cannon tube while another person helps to find the desired location. After they have found the location, they pull the rope and the user inside the canon will blast off to that location very speedily.",
    "appears_in": [
      "Chapter 97:Anywhere Cannon",
      "The Anywhere Cannon",
      "I've Got a Spare Fourth Dimensional Pocket/2005 Anime"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/45/Anywhere_Cannon.png/revision/latest/scale-to-width-down/350?cb=20200628042057\u0026path-prefix=en"
  },
  {
    "eng_name": "Anywhere Tap",
    "jp_name": "まほうのじゃぐち, Mahōno jaguchi",
    "description": "You can drink any liquid anywhere that has a wall.",
    "appears_in": [
      "The Good Ol' Days",
      "Doraemon Mini Theater: The Anywhere Tap",
      "Camp Riot"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/51/Anywheretap2005.png/revision/latest/scale-to-width-down/350?cb=20171007031557\u0026path-prefix=en"
  },
  {
    "eng_name": "Anywhere Ticket",
    "jp_name": "どこでもきっぷ, Doko demo kippu",
    "description": "You must write the name of a place in the ticket then color it in a door which will take you to that place.",
    "appears_in": [
      "Chapter 087:A Mysterious Swimming In The Sea"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/5f/AnywhereTicket.png/revision/latest/scale-to-width-down/350?cb=20170629045331\u0026path-prefix=en"
  },
  {
    "eng_name": "Arrangements Ant",
    "jp_name": "やりくりアリ Yarikuri ari",
    "description": "This gadget allows users to reorganize old things to new things. First, the user has to say out what the user wants to the microphone, then many ants will come out. Those ants are the future recycle robot, they will collect materials to make the user’s new thing, For example, making a toy will require metal and plastic. After collecting enough materials, those materials will be melted or crushed to make the new thing.",
    "appears_in": [
      "Recycling with Worker Ants"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/41/Worker_Ants.jpg/revision/latest/scale-to-width-down/350?cb=20200411044857\u0026path-prefix=en"
  }
]
