[
  {
    "eng_name": "Abekobe Cream",
    "jp_name": "あべこべクリーム Abekobe Kurīmu",
    "description": "When applied to the skin, any hot or cold sensation the skin felt will be the opposite. For example, if a person applied the Abekobe Cream to their skin, and they went out to in the snow wearing only one layer of cloth, they will feel warm instead of cold. Another example is, if they get burned or scalded, they will be frozen instead.",
    "appears_in": [
      "Chapter 14:Hot Hot in the Snow",
      "Doraemon: Nobita's New Great Adventure into the Underworld – The Seven Magic Users",
      "The Snow's Hot, Hot, Hot!",
      "Move Fast, Doraemon! The Galactic Grandprix",
      "Kobe Abe (gadget)",
      "Abekonbe",
      "Nobi Nobita"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/b3/Abeko_Cream.png/revision/latest/scale-to-width-down/350?cb=20150824074408\u0026path-prefix=en"
  },
  {
    "eng_name": "Abekonbe",
    "jp_name": "アベコンベ",
    "description": "When the head of the Abekonbe hits an object, either the object's function, position or action will be reversed. For example, if the Abekonbe is used on a refrigerator, the refrigerator will be hot instead of cold. Another example is, if used on something light, it will become heavy instead.\nThe Abekonbe's effect is rather complicated, as multiple aspects of the object may be reversed.",
    "appears_in": [
      "Kobe Abe (gadget)",
      "Abekobe Cream"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/c9/Abekonbe.PNG/revision/latest/scale-to-width-down/350?cb=20150802122258\u0026path-prefix=en"
  },
  {
    "eng_name": "Action Interlocking Mat",
    "jp_name": "アクション連動マット \"Akushon rendō matto\"",
    "description": "To use this gadget. First, you must attach a green star chip to the desired object. The attached star chip will light up and connect to a VR (Virtual reality). Then you can move the object according to your body movements by standing on the dancing mattress such as doing a breakdance.",
    "appears_in": [
      "Stationery Breakdance"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/11/Action_Interlocking_Mat.png/revision/latest/scale-to-width-down/350?cb=20240930025434\u0026path-prefix=en"
  },
  {
    "eng_name": "Air Cannon",
    "jp_name": "空気砲 Kūki-hō",
    "description": "This looks like a miniature muzzle of a real cannon with a tiny iron sight.\nThe Air Cannon fires blasts of pressurized air at the target with an average velocity, requiring electrical energy to function. Impact of its munitions can have varying effects depending on the target.\nIn Doraemon: Nobita's Treasure Island, it is revealed that the cannon's air projectile can be blocked via slicing it as shown when Vivi easily stopped the attack with her blade.\nThe Air Cannon is one of Nobita's gadgets. It is his second gadget and is obtained when Doraemon and Nobita went into the first dungeon. The Air Cannon is a powerful weapon, but unlike the other guns-like gadget Nobita has in the game, he cannot fire it three times consecutively. He also cannot fire it while running, because of its high recoil and does not work in water sections. One hit from the Air Cannon can defeat a normal enemy with one hit, except for the Digging Hermitcrab, which needs to be shot 2 times.\nThe Air Cannon is listed under number 20 out of 61 gadgets in the game.\nThe Air Cannon is one of the first two gadgets obtained. It is charged by holding the action button and shoot by releasing it. You cannot move when attacking.\nAir Cannon is a gadget that we second obtained through the game. It shuffles things to your advantage.\nThe Air Cannon as Water elemental Melee weapons and also a good main hand choice. Obtained from Doramon collaboration event.",
    "appears_in": [
      "A Beautiful Girl that Nobita Loved",
      "The Great Pirate Decisive Battle ~Love Romance of the Southern Sea~",
      "Doraemon: New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Doraemon: Nobita's Treasure Island",
      "Doraemon: Nobita and the Winged Braves",
      "Doraemon: Nobita's Space Heroes",
      "Air Pistol (gadget)",
      "Nobita Nobi"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/f/f7/Cammo.jpg/revision/latest/scale-to-width-down/350?cb=20140430061655\u0026path-prefix=en"
  },
  {
    "eng_name": "Air Conditioning Photo",
    "jp_name": "エアコンフォト Eakonfoto",
    "description": "The Air Conditioning Photo has the same function as the Voodoo Camera, but in photo form.",
    "appears_in": [
      "The Snow is Hot! The Air Conditioning Photo"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/9d/Air_Conditioning_Photo.PNG/revision/latest/scale-to-width-down/350?cb=20160124052211\u0026path-prefix=en"
  },
  {
    "eng_name": "Air Crayon",
    "jp_name": "空気クレヨン Kūki Kureyon",
    "description": "This gadget appears to resemble a perfectly normal crayon, but is used to make drawings and other markings on areas of thin air.",
    "appears_in": [
      "Nobita and the Island of Miracles ~Animal Adventure~",
      "Doraemon: Nobita's Secret Gadget Museum",
      "The Air Crayon",
      "Run, Machine - Horse!",
      "Double Vision"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/13/Air_Crayon_2012_movie.PNG/revision/latest/scale-to-width-down/350?cb=20151021052109\u0026path-prefix=en"
  },
  {
    "eng_name": "Air Pistol (gadget)",
    "jp_name": "(空気ピストル) - (空気ピストルのくすり)",
    "description": "The Air Pistol is equipped on a person's finger. When they point out their finger towards an object or person, they can shoot by shouting \"Bang!\". The Air Pistol has lesser recoil, but also has shorter range and power when compared to the larger Air Cannon. The Air Pistol has a range of around 10 meters (about 35 feet).\nWhile the Medicine Air Pistol is rather similar to it, the Medicine Air Pistol looks like a big bullet. It stores a type of liquid that can be used as artillery when applied on one's finger. When a non-living thing is hit, they'll simply be pushed or blown away, but some objects may break, like a branch, leaf, or fruit. However, when living things like humans, animals and robots (that may sleep) are hit by the bullets, they fall asleep (anesthesia) or fall down. The Air Bullets function like paralysis darts.\nAir Pistol Medicine in DS game.The Air Pistol (Shaped like a bullet) is used in the Challenge game \"けんじゅうおう コンテスト\"(Kenju Contest). The player controls Nobita, and may have up to 10 bullets at a time. To shoot, a player must shout into the microphone (the game prompts a shout of \"Bang!\", but any word is fine). The bullets can be blocked if they hit each other. When a character of the player is hit, they'll fall asleep, unable to wake up until the next game. NPC characters have unlimited bullets.\nWhen replayed in the Main Menu, the Kenju Contest is only played versus other players in Wireless Communication.\nThe Air Pistol is listed under number 18 out of 61 gadgets in the game.",
    "appears_in": [
      "Doraemon",
      "Dorami",
      "Secret Gadget Air Pistol"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/99/Air_pistol.jpg/revision/latest?cb=20140527083316\u0026path-prefix=en"
  },
  {
    "eng_name": "Aladdin's Lamp",
    "jp_name": "アラビンのランプ Arabin'no Ranpu",
    "description": "The Aladdin's Lamp summons the smoke genie that will grant his master any wishes they want. Although they are incredibly obedient and \"resourceful\", the genie's method of granting his master's wishes are radical, and not magical at all. For example, when Nobita asked the genie to finish up his homework, the genie went to see Sensei, and forced him to do the homework, as the genie doesn't know how to. The genie will return to his lamp after one wish \"has been granted\".\nFor serious wishes such as finding one million yen, the genie will threaten everyone in order to grant the user's \"serious wishes\".",
    "appears_in": [
      "Chapter 15:A Ghost of the Lamp's Smoke",
      "Doraemon: Nobita's Secret Gadget Museum",
      "The Magic Lamp without a Genie"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/b9/Aladdin_Lamp.jpg/revision/latest/scale-to-width-down/350?cb=20190630142240\u0026path-prefix=en"
  },
  {
    "eng_name": "All Seasons Badge",
    "jp_name": "オールシーズンバッジ Ōru Shīzun Bajji",
    "description": "There is one dial and four different seasons. Those seasons are: Summer, Winter, Autumn and Spring.\nIt is used to change the season to another season of a specific place with the radius of 100 meters.\nJust spin the dial to whichever season you want to have and this gadget will activate that season in your environment.\nThis gadget is not meant to be played with since if we change the weather too much it can cause serious trouble. If more badges were set, it can cause serious weather troubles too.",
    "appears_in": [
      "Nobita's New Great Adventure into the Underworld – The Seven Magic Users"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/13/22.jpg/revision/latest?cb=20170514140538\u0026path-prefix=en"
  },
  {
    "eng_name": "Almighty Pass",
    "jp_name": "オールマイティーパス Ōrumaitīpasu",
    "description": "This gadget is used to make the user pass into any place.\nAlso, this gadget will expire on the expiry date.",
    "appears_in": [
      "The Almighty Pass",
      "I've Got a Spare Fourth Dimensional Pocket"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/6/6f/Almighty_Pass.PNG/revision/latest/scale-to-width-down/350?cb=20151018121759\u0026path-prefix=en"
  },
  {
    "eng_name": "Animal Light",
    "jp_name": "動物ライト Dōbutsu Raito",
    "description": "You just need to beam the person with the light, then the person will turn into an animal.",
    "appears_in": [
      "Chapter 17:Test Memorizing Toast",
      "Memorization Bread for Testing"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/8/8a/Fuction_of_Animal_Light.PNG/revision/latest/scale-to-width-down/350?cb=20200804084932\u0026path-prefix=en"
  },
  {
    "eng_name": "Animal Transformation Stick",
    "jp_name": "動物変身ステッキ Dōbutsu Henshin Sutekki",
    "description": "It is used to transform a person into an animal. The transformation into an animal depends on what animal the user thinks. The transformation can be reverted when Release Lip is used.",
    "appears_in": [
      "Halloween and Nobi the Frog",
      "Transformation Drink",
      "Animal Transformation Biscuits"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/c5/%E3%83%8F%E3%83%AD%E3%82%A6%E3%82%A3%E3%83%B3%E3%81%A8%E3%81%AE%E3%81%B3%E3%82%AC%E3%82%A8%E3%83%AB.jpg/revision/latest/scale-to-width-down/350?cb=20151114051255\u0026path-prefix=en"
  },
  {
    "eng_name": "Anticipating Promise Machine",
    "jp_name": "先取り約束機 Sakidori Yakusoku-ki",
    "description": "In case of an emergency, a user may need this. Simply ask something in the machine (like take a bath or become full from eating) and it will become true. However, you need to fulfill the promise to do it in reality within a span of time stated in the promise, else the action itself would be unraveled and treated as never happened e.g. you'll become more smelly/hungry than usual.",
    "appears_in": [
      "Nobita and the Haunts of Evil",
      "The New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Doraemon: New Nobita's Great Demon ~Peko and the Exploration Party of 5~"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/39/Promise_Machine.PNG/revision/latest/scale-to-width-down/350?cb=20151011102527\u0026path-prefix=en"
  },
  {
    "eng_name": "Anything is Violin",
    "jp_name": "なんでもバイオリン \"Nandemo Baiorin\"",
    "description": "Anything is Violin (なんでもバイオリン Nandemo Baiorin), is a one of gadget owned by Doraemon.\nShizuka accidently broke her violin while she was practicing. In order to make her happy, Nobita ask Doraemon to do something good for her, So Doraemon takes out a \"Anything is Violin\" to make Shizuka happy again. Any object rubbed by this tool Will turn into like a sound of original violin, such as a racket, ballon, cotton candy, and even Shizuka most favorite food is Called Roasted sweet potatos.",
    "appears_in": [
      "Shizuka's Roasted Sweet Potato Symphony"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/31/Anything_Is_Violin.jpeg/revision/latest/scale-to-width-down/350?cb=20240816035955\u0026path-prefix=en"
  },
  {
    "eng_name": "Anything Steering Wheel",
    "jp_name": "なんでもそうじゅう機 Nan demo sōjū-ki",
    "description": "It can make anything into a form of transport (including an ice cream cap).",
    "appears_in": [
      "3cm Nobita's Adventures"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/b9/Anything_Wheel.PNG/revision/latest/scale-to-width-down/350?cb=20160727130108\u0026path-prefix=en"
  },
  {
    "eng_name": "Anywhere Cannon",
    "jp_name": "どこでも大ほう, Doko Demo Taihō",
    "description": "Nobita NobiIt looks like a normal cannon. Only it's functions/features are different.\nA user can use this gadget to go wherever they want to go. To do that they have to get inside this cannon tube while another person helps to find the desired location. After they have found the location, they pull the rope and the user inside the canon will blast off to that location very speedily.",
    "appears_in": [
      "Chapter 97:Anywhere Cannon",
      "The Anywhere Cannon",
      "I've Got a Spare Fourth Dimensional Pocket/2005 Anime"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/45/Anywhere_Cannon.png/revision/latest/scale-to-width-down/350?cb=20200628042057\u0026path-prefix=en"
  },
  {
    "eng_name": "Anywhere Tap",
    "jp_name": "まほうのじゃぐち, Mahōno jaguchi",
    "description": "You can drink any liquid anywhere that has a wall.",
    "appears_in": [
      "The Good Ol' Days",
      "Doraemon Mini Theater: The Anywhere Tap",
      "Camp Riot"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/51/Anywheretap2005.png/revision/latest/scale-to-width-down/350?cb=20171007031557\u0026path-prefix=en"
  },
  {
    "eng_name": "Anywhere Ticket",
    "jp_name": "どこでもきっぷ, Doko demo kippu",
    "description": "You must write the name of a place in the ticket then color it in a door which will take you to that place.",
    "appears_in": [
      "Chapter 087:A Mysterious Swimming In The Sea"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/5f/AnywhereTicket.png/revision/latest/scale-to-width-down/350?cb=20170629045331\u0026path-prefix=en"
  },
  {
    "eng_name": "Arrangements Ant",
    "jp_name": "やりくりアリ Yarikuri ari",
    "description": "This gadget allows users to reorganize old things to new things. First, the user has to say out what the user wants to the microphone, then many ants will come out. Those ants are the future recycle robot, they will collect materials to make the user’s new thing, For example, making a toy will require metal and plastic. After collecting enough materials, those materials will be melted or crushed to make the new thing.",
    "appears_in": [
      "Recycling with Worker Ants"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/41/Worker_Ants.jpg/revision/latest/scale-to-width-down/350?cb=20200411044857\u0026path-prefix=en"
  },
  {
    "eng_name": "Ballot Dog",
    "jp_name": "選挙(せんきょ)ケン Senkyo Ken",
    "description": "The Ballot Dog is one of Doraemon's gadgets.\nThe gadget allows users to hold a democratic election. Users will have to express their interest to the Ballot Dog to run in the election. Whenever a candidate breaks a rule (such as bribery or personal attack), he can emit a lightning bolt to stop the person.\nThe Ballot Dog not only serves as a ballot box where voters can feed their vote into its mouth, but also as a returning officer to announce the results.",
    "appears_in": [
      "Vote for the Boss of the Brats!"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/f/f3/Ballotdog.PNG/revision/latest/scale-to-width-down/350?cb=20191214135752\u0026path-prefix=en"
  },
  {
    "eng_name": "Bamboo Shoot-shaped Tent Set",
    "jp_name": "たけのこ型テントセット \"Take no ko-gata tento setto\"",
    "description": "To make this bamboo shoot tent. First, you must bury this bamboo shoot-shaped tent into the ground. Second, water this plant with lots of water. Then wait wait for an hour until grow a bamboo shoot tent it can be occupied. After camping, use the spray to restore it, and this bamboo shoot is edible.",
    "appears_in": [
      "Bamboo Shoot-shaped Tent Village"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/33/Bamboo_shoot_tent_set.jpeg/revision/latest/scale-to-width-down/350?cb=20240911121817\u0026path-prefix=en"
  },
  {
    "eng_name": "Banana Leaf Fan",
    "jp_name": "バショー扇Bashō Sen or Bashō Ōgi",
    "description": "Bashō Sen or Bashō ŌgiThe Basho Sen can create a strong wind depending on how the user swings it. If they swing it gently, they may create a pleasant yet fairly strong breeze. If they swing it violently, a strong gust of wind instead will be conjured. It is possible to create a whirlwind or small tornado, but this requires a precise and specific technique.\nThe Basho Sen is one of Doraemon's Action Gadget, and his fourth one. It is obtained when the party arrives at the Rire of Guidance(ミチビキのリーレ). Simply pressing Y once will make Doraemon swing it quickly, capable of blowing away normal enemies with ease. Pressing Y and charging it to the fullest allows Doraemon to swing and creates a strong gust that will blow away any enemies(except bosses) in the gust. Unlike in the series and movies, the Basho Sen in this game cannot create gusts that would reach the whole screen.\nThe Basho Sen is listed under number 42 out of 61 gadgets in the game.\nBasho-Sen, featured on the cover of volume-38 Doraemon manga.",
    "appears_in": [
      "Battle! Cat-Model Robots VS Dog-Model Robots",
      "Thank God for the Prison Break"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/37/Bananaleaffananime.jpg/revision/latest/scale-to-width-down/350?cb=20150218043647\u0026path-prefix=en"
  },
  {
    "eng_name": "Bartering Machine",
    "jp_name": "General InformationFunctionsDetails",
    "description": "Bartering Machine in its extended form.It is a pink drum-like gadget with two robotic gloved hands that help in the barter. It has a slit which acts as its mouth, and the only thing it can say is \"Give! Give!\" in a robotic voice. When it urges the one disagreeing, it has a flexible pipe fitted to its bottom that can extend out and physically approach both the sides.\nIt is used to convince two people to make a barter decision even if either or both of them are unwilling to. The person against is forced to hand their export to the robot, while the other barterer hands their, to the other hand of the gadget. The robot then exchanges its hand position to give both their desired items.\nIn the episode, it was used by Doraemon to force the witch to give Mermaid Princess the potion which would give her anthropomorphic legs, in exchange of a headwear-starfish worn by the princess, even though the witch demanded for her melodious voice.",
    "appears_in": [
      "Anything Reform Set",
      "Just-As-You-Said Pills"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/31/Bartering_Machine.png/revision/latest/scale-to-width-down/350?cb=20200927050223\u0026path-prefix=en"
  },
  {
    "eng_name": "Become a Police-Thief Set",
    "jp_name": "なりきりケイドロセット Narikiri Keidoro Setto",
    "description": "The set consists of various gadgets to play the 22nd century version of Tag.\nPolice (It)\nThief",
    "appears_in": [
      "Nobi the Thief is Somewhat Arrested!"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/e4/Become_a_Police_Thief_Set.PNG/revision/latest?cb=20151221054908\u0026path-prefix=en"
  },
  {
    "eng_name": "Big Light",
    "jp_name": "ビッグライト Bigguraito",
    "description": "When used, Big Light fires a laser which temporarily increases the mass and space occupied by the target to a certain extent for an unspecified amount of time. \nDoraemon uses the Magnify Ray in The Nobi Family's Giant Tunafish.",
    "appears_in": [
      "Chapter 403:Devil Card",
      "A Visitor from the Country of the Future/U.S. English dub",
      "Gian is a Genius",
      "Nobita and the Wind Wizard",
      "The Rumored Nobita",
      "The Nobi Family's Giant Tunafish",
      "Giant Suneo Appears!",
      "Shizuka-chan in My Pocket",
      "Exploring the Earth (Part 2)",
      "Super Exciting! Grand Racing on the Ever-Changing Track",
      "Nobita's Great Adventure into the Underworld",
      "Doraemon: Nobita's Treasure Island",
      "Devil Card"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/a6/Big_Light.PNG/revision/latest/scale-to-width-down/350?cb=20200118153350\u0026path-prefix=en"
  },
  {
    "eng_name": "Bird Caps",
    "jp_name": "鳩キャップ Hato kyappu鶏キャップ Niwatori kyappu雀キャップ Suzume kyappu白鳥キャップ Hakuchō kyappuみみずくキャップ Mimizuku kyappuウッドペッカーキャップ Uddopekkā kyappuキングフィッシュキャップ Kingufisshu kyappu鸚鵡キャップ Ōmu kyappu鷲キャップ Washi kyappu信天翁キャップ Ahōdori kyappu",
    "description": "Bird Caps (バードキャップ)  is a set of Doraemon's gadget.\n\nThe Pigeon Cap is the Pigeon-like cap. Used to fly like a pigeon.\n\nThe Chicken Cap is the Chicken-like cap. This cap can't be used for flying.\n\nThe Sparrow Cap is the Sparrow-like cap. Used to fly like a sparrow.\n\nThe Swan Cap is the Swan-like cap. Used to fly like a swan. Sometimes the user that uses this cap will migrate with other swans.\n\nThe Owl Cap is the Owl-like cap. Used to fly like an owl. Owls are nocturnal birds so they can only fly at night. Same with this cap that can only be used at night time.\n\nThe Woodpecker Cap is the Woodpecker-like cap. The user will always bang his head in the tree, like a woodpecker while pecking the tree.\n\nThe Kingfisher Cap is the Kingfisher-like cap. Used to fly like a Kingfisher. Sometimes when the user sees the river, he will immediately jump into the river.\n\nThe Parrot Cap is the Parrot-like cap. The user will mimic the spoken language.\n\nThe Eagle Cap is the Eagle-like cap. Used to fly like an eagle.\n\nThe Albatross Cap is the Albatross-like cap. Used to fly like an Albatross.",
    "appears_in": [
      "Nobita and the Winged Braves"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/58/Bird_Hat_Pigeon_Hat.PNG/revision/latest/scale-to-width-down/350?cb=20151003133634\u0026path-prefix=en"
  },
  {
    "eng_name": "Bird Whistle",
    "jp_name": "鳥よせ笛, Tori Yose Fue",
    "description": "By blowing into the Bird Whistle, one can attract birds.",
    "appears_in": [
      "The Great, Twinkling Christmas Plan"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/92/Bird_Whistle.png/revision/latest/scale-to-width-down/350?cb=20150813065847\u0026path-prefix=en"
  },
  {
    "eng_name": "Black Pepper",
    "jp_name": "黒コショウ Kuro Koshō",
    "description": "It works just like a normal black pepper.",
    "appears_in": [
      "Chapter 7:Peko Peko Grasshopper",
      "The Bow-Bow Grasshopper",
      "The Giant Dora-Raccoon at Midnight"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/2/22/Black_Pepper.png/revision/latest/scale-to-width-down/350?cb=20140524035857\u0026path-prefix=en"
  },
  {
    "eng_name": "Blind Spot Stars",
    "jp_name": "モーテン星 Mōten Hoshi",
    "description": "It appears to be a set of stickers that looks like orange stars with a white round with a particular green dot at the center.\nBy wearing this gadget, the user becomes 'invisible' through the physiological effect of other people's blind spot. Technically, the wearer enters the looker's blind spot thus becomes 'invisible in their line of sight. This gadget works by distorting the light that falls and reflected from the wearer to pass by the looker's focal points, making them virtually persists in the blind spot area. This gadget's effect will be expired after an hour. Despite the user not being visible others, it's possible to track down their location through other sense such as smell.",
    "appears_in": [
      "Blind Spot Star",
      "Nobita's New Great Adventure into the Underworld – The Seven Magic Users"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/eb/Blind_Spot_Star.PNG/revision/latest/scale-to-width-down/350?cb=20150830090856\u0026path-prefix=en"
  },
  {
    "eng_name": "Body Pump",
    "jp_name": "からだポソプ Karada ponpu",
    "description": "Any body parts that is pumped by the tool gets enlarged, but gets smaller once the pump is removed from the body part. The part enlarged however does not increase the person's strength or abilities in any form, merely increases the size.",
    "appears_in": [
      "A Large Man Went Out",
      "The Appearance of a Giant",
      "Nobita Eleven"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/5a/InflatablePump.png/revision/latest/scale-to-width-down/350?cb=20160727135053\u0026path-prefix=en"
  },
  {
    "eng_name": "Bomb of Mass Destruction",
    "jp_name": "地球はかいばくだん Chikyū Hakai Bakudan",
    "description": "As it was never used, next to nothing is known about this weapon.\nDoraemon has implied this as a weapon of mass destruction capable of devastating a large area with a powerful, gargantuan blast. It also has a contact fuse that activates upon physical damage.",
    "appears_in": [
      "Chapter 115:The Mouse And The Bomb",
      "The Mouse and The Bomb",
      "Nobita and the New Steel Troops ~Angel Wings~",
      "The Sonic Oscillation Terror Machine",
      "Only Four More Hours Until the Mice Are Driven Away",
      "Doraemon, In Love",
      "The Hamelin Pipe",
      "It's the Year of the Mouse! Doraemon",
      "wikipedia:Little Boy",
      "It's the Year of the Mouse! Doraemon"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/9f/Bomb_of_Mass_Destruction.PNG/revision/latest/scale-to-width-down/350?cb=20151025065215\u0026path-prefix=en"
  },
  {
    "eng_name": "Boygirl",
    "jp_name": "オトコンナ Otokon'na",
    "description": "Spreading it around, the gadget changes boys into sissies and girls into tomboys. The target's biological gender is unaffected.",
    "appears_in": [
      "Chapter 143:When Will You Take Boy Girl?",
      "When Will You Take Boygirl?",
      "The Day Dorami Was Born",
      "Nobita Nobi",
      "Nobisuke Nobi",
      "When Will You Take Boygirl?",
      "Takeshi Gouda",
      "Suneo Honekawa",
      "Shizuka Minamoto",
      "Nobisuke Nobi",
      "Tamako Nobi",
      "The Day Dorami Was Born",
      "Takeshi Gouda"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/6/6f/Boygirl2.PNG/revision/latest/scale-to-width-down/350?cb=20160229135235\u0026path-prefix=en"
  },
  {
    "eng_name": "Bug Hero Belt",
    "jp_name": "ムシムシヒーローベルト Mushimushi Hīrō Beruto",
    "description": "Whenever an insect goes nearer to the user, the user will have the abilities regarding to the insect.",
    "appears_in": [
      "A Buggy Hero Arrives!"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/8/88/Bugbelt.png/revision/latest/scale-to-width-down/350?cb=20201220051521\u0026path-prefix=en"
  },
  {
    "eng_name": "Bug Off",
    "jp_name": "虫スカン",
    "description": "Bug Off is a disgusting substance that spreads its intolerable scent everywhere via fumes and radiation, which is similar to tear gas, effectively forcing most others away.\nIn Stand by Me Doraemon, the potion seems to be capable of not only creating disgusting subtance but also creating winds that makes it more advanced than other adaptations.\nHowever, it is possible for the user to be poisoned if a significant quantity of it has been ingested or otherwise applied.",
    "appears_in": [
      "Goodbye, Shizuka",
      "Stand by Me Doraemon",
      "Goodbye, Shizuka"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/19/Gbs1.PNG/revision/latest/scale-to-width-down/350?cb=20150102112016\u0026path-prefix=en"
  },
  {
    "eng_name": "Bunny Ears",
    "jp_name": "?",
    "description": "Wearing it, the user's sense of hearing is heightened immensely, allowing them to hear sounds much easier.",
    "appears_in": [
      "Mini-Dora SOS!!"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/d/d7/Bunny_Ears.png/revision/latest/scale-to-width-down/350?cb=20140906080130\u0026path-prefix=en"
  },
  {
    "eng_name": "Cancellation Eraser",
    "jp_name": "?",
    "description": "The Cancellation Eraser is for revoking the effect of the gadget pen, Face-Doodling Pen.",
    "appears_in": [
      "Doodling on Doraemon"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/8/8c/Cancellation_Eraser.png/revision/latest/scale-to-width-down/350?cb=20140916101844\u0026path-prefix=en"
  },
  {
    "eng_name": "Caretaker Rope",
    "jp_name": "世話やきロープ \"Sewa yaki rōpu\"",
    "description": "Just like the name, tihis gadget will take care of you. It can be shaped into anything, and will accompany you anywhere, anywhe without worrying about it.",
    "appears_in": [
      "The Long, Slender Friend"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/bf/Caretaker_rope.jpeg/revision/latest/scale-to-width-down/350?cb=20240909111727\u0026path-prefix=en"
  },
  {
    "eng_name": "Catch Glove",
    "jp_name": "キャッチグローブ",
    "description": "The Catch Glove is a gadget that belongs to Doraemon.\nIt helps it's user to catch anything automatically, even if the user is not good in catching.",
    "appears_in": [
      "Stand by Me Doraemon"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/8/86/Catch_GloveStandbyme.png/revision/latest?cb=20140916152137\u0026path-prefix=en"
  },
  {
    "eng_name": "Cheerleader Gloves",
    "jp_name": "チアリーダー手袋 Chiarīdā Tebukuro",
    "description": "The gadget is actually a pair of mittens that expand into pom-poms when someone places them over (or toss them onto) their hands, and can be used by anyone. If the user cheers for another person, said person will somehow instantly win whatever competition they are currently in. They can't be removed unless the targeted person emerges victorious.\nThe Cheerleader Gloves is one of Shizuka's gadget as an Assist Character. When used, Shizuka appears alongside Nobita and Doraemon and cheers them along as she runs around cheering with them. While she is cheering, she gradually restores their health over time. She will follow Nobita and Doraemon around and jump across ledges with them. Note that she is vulnerable to attacks as well as falling into pits which will instantly dispatch her.",
    "appears_in": [
      "Doraemon: Nobita's Legend of the Sun King",
      "Nobita and the Island of Miracles ~Animal Adventure~",
      "Summoning in Victory with the Cheerleader Gloves"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/e1/Cheerleading_Gloves.png/revision/latest/scale-to-width-down/350?cb=20151022051326\u0026path-prefix=en"
  },
  {
    "eng_name": "Coagulation Light (gadget)",
    "jp_name": "カチンカチンライト Kachinkachin Raito",
    "description": "The Coagulation Light's energy solidifies the target for 5 minutes, preventing it from experiencing any state of change for the entire duration of the effect. Solidified items may exhibit properties absent from the original counterpart.",
    "appears_in": [
      "Shizuka",
      "Gian",
      "Suneo",
      "All the Way From the Country of the Future",
      "Aron",
      "Doraemon: Nobita Drifts in the Universe",
      "Moa",
      "All the Way From the Country of the Future",
      "Nobita's Space Heroes",
      "Doraemon: Nobita Drifts in the Universe",
      "The Doraemons"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/78/Doraemonfreezinglight.png/revision/latest/scale-to-width-down/350?cb=20140507173931\u0026path-prefix=en"
  },
  {
    "eng_name": "Coalescence Glue",
    "jp_name": "合体ノリ Gattainori",
    "description": "This gadget is used to make a fusion with something that touched after spreading the cream on hand.",
    "appears_in": [
      "Ultra Mixer"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/75/Gattai.PNG/revision/latest/scale-to-width-down/350?cb=20160212135538\u0026path-prefix=en"
  },
  {
    "eng_name": "Come Come Cat Food (gadget)",
    "jp_name": "General InformationFunctionsDetails",
    "description": "This gadget grants cats the ability to attract customers. After eating Come Come Cat Food, the cat can attract customers. The effect of the gadget however, is over after attracting three customers.",
    "appears_in": [
      "Chapter 705:Come Come Cat Food",
      "Come Come Cat Food/1979 Anime",
      "Would You Like To Adopt Doraemon?",
      "Doraemon",
      "Nobita Nobi",
      "Shizuka Minamoto",
      "Come Come Cat"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/76/Come_Come_Cat_Food.png/revision/latest/scale-to-width-down/350?cb=20140913081718\u0026path-prefix=en"
  },
  {
    "eng_name": "Come Come Mark",
    "jp_name": "こいこいマーク Koi Koi Māku",
    "description": "Same as the Come Come Cat, the gadget forcefully pulls a person depending on the direction.",
    "appears_in": [
      "Nobita and the Island of Miracles ~Animal Adventure~"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/9b/Come_Come_Mark.PNG/revision/latest/scale-to-width-down/350?cb=20151025081442\u0026path-prefix=en"
  },
  {
    "eng_name": "Come-Come Cat",
    "jp_name": "カムカムキャット Kamu Kamu Kyatto",
    "description": "This gadget makes the target come to a person's house. It can also be used to pull in people in the direction it is facing. The Come Come Cat is useful for attracting customers, in a rather 'forceful' way. Its function is the opposite of the Go Go Dog.",
    "appears_in": [
      "Doraemon and Dorami-chan",
      "Vote for the Boss of the Brats!",
      "Doraemon: Nobita and the Island of Miracles ~Animal Adventure~",
      "Doraemon: Nobita's Secret Gadget Museum",
      "Be Careful When Sneezing",
      "Call of the Come-Come Cat",
      "Mini-Doras"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/32/Comecomecat.PNG/revision/latest/scale-to-width-down/350?cb=20191210004829\u0026path-prefix=en"
  },
  {
    "eng_name": "Compaction Cloud Gas",
    "jp_name": "雲固めガス",
    "description": "In Movie:Doraemon: Nobita and the Kingdom of Clouds (1979 anime)Stand by Me Doraemon (2005 anime)In Anime:The Recital of Blue Moon NightWith this, a person can walk or jump on clouds with just a spray. However, too much of this will cause the cloud to be very bouncy.",
    "appears_in": [
      "Doraemon: Nobita and the Kingdom of Clouds",
      "Stand by Me Doraemon",
      "The Recital of Blue Moon Night"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/95/Card_g16_1.jpg/revision/latest/scale-to-width-down/350?cb=20150429093539\u0026path-prefix=en"
  },
  {
    "eng_name": "Conveyor Belt Sushi of People I Wanna See",
    "jp_name": "会(あ)いたいヒト回転(かいてん)寿司(すし) Aitai Hito Kaiten Sushi",
    "description": "Just say the name of a person or group of people that you want to see to the microphone. They will automatically be teleported and appear on the plates of the conveyor belt. Then you can see them for a limited time. A user can do it 10 times and after that, the gadget will be useless.\nWhen calling the person or group of people, the users have to be specific as possible to prevent a full list of people with the same name or from the same place from coming out. They will have to push the cancel button to end the list. When the person or group of people are called, their appearance the moment before they are called will be reflected on the conveyor belt (for example, Uncle Heisuke is in the middle of changing his clothes before he was called the first time). While users may deliver items to the person or group of people or receive items from them, they cannot pull them out from the conveyor belt.\nDoraemon bought the gadget during the promotional period, and hence there was an extra call making the maximum number of calls allowed to 11 (Normally during the promotional period, if you buy 10 bentos of sushi you get another one free).",
    "appears_in": [
      "Revolving Sushi of People I Wanna See"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/51/Rotationsushi.png/revision/latest/scale-to-width-down/350?cb=20150706075010\u0026path-prefix=en"
  },
  {
    "eng_name": "Copy Robot",
    "jp_name": "コピーロボット",
    "description": "The robot initially appears as a blank humanoid puppet with a red, nose-like button as its switch, used for startup and shutdown. \nIt can mimic multiple attributes of its target, from appearance and physiology to psychology and sentience. On top of the accuracy deficiencies, however, it is also vulnerable to mechanical defects (impacts, etc), both of which can greatly impede its performance.",
    "appears_in": [
      "I Don't Like Shizuka-chan Being Like This!",
      "The Nobeatles are Born!",
      "Doraemon: Nobita's Secret Gadget Museum",
      "Doraemon: Yume Dorobou to 7 Nin no Gozansu",
      "Nobita vs. Nobita",
      "wikipedia:Perman (manga)",
      "Copy Robot Shizuka"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/93/Copiroboto.png/revision/latest/scale-to-width-down/350?cb=20190811070904\u0026path-prefix=en"
  },
  {
    "eng_name": "Copying Toast",
    "jp_name": "暗記 パン, Anki Pan",
    "description": "To use the Copying Toast, one should press one side of the toast on a book with either text or pictures. The text or picture will then be 'printed' (in the bread's case, 'sticks onto it') on the toast. Eating the toast later will allow the eater to remember whatever content that has been printed on the toast.\nThe user will forget the content (if they never did memorize it normally) if the toasts are expelled out from their system. Like how Nobita had a stomach ache and had to 'expel' them into the toilet, he forgets everything printed on the toasts.",
    "appears_in": [
      "Chapter 17:Test Memorizing Toast",
      "Memorization Bread for Tests",
      "Stand by Me Doraemon",
      "Angry Popcorn",
      "Gian \u0026 Suneo, A Miraculous Duet!",
      "Doraemon Wii: Secret Tool King Tournament",
      "Doraemon in China"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/aa/Copying_Toast2005.png/revision/latest/scale-to-width-down/350?cb=20140916135317\u0026path-prefix=en"
  },
  {
    "eng_name": "Cotton Candy Cloud Maker",
    "jp_name": "わたがし雲メーカー Wataga shi kumo mēkā",
    "description": "To use this gadget, the user must put it into a cloud, then add their favorite flavors, foods and even the drinks. Finally, press the button on the gadget to create it and eat these clouds.\nThis cotton candy is almost absent when eating, because it is naturally cloudy so users can eat as much as they like.",
    "appears_in": [
      "The Cotton Candy Cloud Maker"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/9f/566a_5.jpg/revision/latest/scale-to-width-down/350?cb=20190720040726\u0026path-prefix=en"
  },
  {
    "eng_name": "Cross Switch (gadget)",
    "jp_name": "クロス・スイッチ",
    "description": "The user has to point the gadget at the other person and press the red button. This will make that person switch their role in life. To switch back, the user needs to press the red button again.\nHumorously enough, not all the roles and actions are switched by the gadget e.g. Shizuka will be the one to scream when Nobita bathes even though she is the one who walks in at that moment.",
    "appears_in": [
      "This Road, That Road, and The Easy Road/1979 Anime",
      "This Road, That Road, and The Easy Road/2005 Anime"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/a2/Cross_Switch.png/revision/latest/scale-to-width-down/350?cb=20140905174826\u0026path-prefix=en"
  },
  {
    "eng_name": "Danger Bomb",
    "jp_name": "危険爆弾  Kiken bakudan",
    "description": "The Danger Bomb detonates after a set fuse time when thrown or upon being remotely triggered. The explosion is capable of destroying entire celestial entities the size of Earth as well as smaller meteors. The bomb itself is small, as it can be held in human hands.",
    "appears_in": [
      "A Visitor from the Country of the Future"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/2/28/Danger_Bomb.png/revision/latest/scale-to-width-down/350?cb=20220709155849\u0026path-prefix=en"
  },
  {
    "eng_name": "Decoy Robot",
    "jp_name": "おとりロボット Otori Robotto",
    "description": "Simply place it in the ground and they will lure out the predator from its prey. They are capable of saying Wasshoi (ワッショイ！) while functioning, which the word is commonly shouted during festivals.\nIn the movie Nobita and the Island of Miracles ~Animal Adventure~, it introduces the more upgraded version, the Decoy Robot DX (おとりロボットＤＸ Otori Robotto Derakkusu) which the gadget has a set of three robots instead of just only one.",
    "appears_in": [
      "Nobita’s Birth of Japan",
      "Nobita and the Island of Miracles ~Animal Adventure~"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/52/Decoy_Robot_DX.PNG/revision/latest/scale-to-width-down/350?cb=20151024034918\u0026path-prefix=en"
  },
  {
    "eng_name": "Deformation Light",
    "jp_name": "変形(へんけい)ライト Henkei raito",
    "description": "The gadget has the ability to change the shape of an object to quadrilateral, in particular, squares and rectangles.\nDoraemon uses the flashlight to change the shape of Nobita and Tamako's glasses to square. But in the next scene where she prepares dinner, their glasses were reverted back to round.",
    "appears_in": [
      "Doraemon, Squared",
      "Square Potion"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/b1/Deformation_Light.PNG/revision/latest/scale-to-width-down/350?cb=20160329114405\u0026path-prefix=en"
  },
  {
    "eng_name": "Delay Camera",
    "jp_name": "おくれカメラ Okure Kamera",
    "description": "This camera takes pictures of things that have happened earlier.",
    "appears_in": [
      "Long Ago, Mom Was Just Like Nobita!?",
      "Time Camera"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/d/d5/Delay_Camera.PNG/revision/latest/scale-to-width-down/350?cb=20160212132026\u0026path-prefix=en"
  },
  {
    "eng_name": "Delivery Racket",
    "jp_name": "配達ラケット Haitatsu Raketto",
    "description": "Doraemon demonstrating the gadgetThe user must say first the destination of the specific object. Then he/she hits the object to its destination. The gadget can hit anything no matter of its size.",
    "appears_in": [
      "Gian Came Flying In"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/45/Raketang_pangdelivery.png/revision/latest/scale-to-width-down/350?cb=20150911094331\u0026path-prefix=en"
  },
  {
    "eng_name": "Delivery Telephone (gadget)",
    "jp_name": "出前 電話 \"Demae Denwa\"",
    "description": "Delivery Telephone is one of Doraemon gadget \nWith this phone we can ask to deliver anything. Just dial the telephone number, pick up the receiver and say what you want to deliver. then the goods will be delivered immediately according to our request. Apart from delivering goods, you can ask to deliver the person.",
    "appears_in": [
      "Delivery Telephone"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/9e/Delivery_phone.jpeg/revision/latest/scale-to-width-down/350?cb=20240923104301\u0026path-prefix=en"
  },
  {
    "eng_name": "Deluxe Light (gadget)",
    "jp_name": "デラックスライト/ゴージャスライト",
    "description": "In 1979 animeWhen the light is shined on a regular object, it becomes a \"deluxe\" object (an example is a regular desk chair turned into an executive chair), to make the object regular again, the user must have the light shined on it again.\nMrs.Goda's outfit transformed into royal gownIn the 1979 episode, the gadget is used to transform Gian's house into an elegant manor as Gian doesn't want Jaiko to embarrass her foreign friend. At the end of the episode, Nobita accidentally transforms Mrs. Goda's cloth into an elegant royal gown.\nIn the 2005 remake, the following become deluxified:",
    "appears_in": [
      "The Deluxe Light",
      "Gorgeous Light"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/ce/Deluxe_Light.jpg/revision/latest/scale-to-width-down/350?cb=20190729153320\u0026path-prefix=en"
  },
  {
    "eng_name": "Deluxe Train Set",
    "jp_name": "ＤＸ列車セット Derakkusu Ressha Setto",
    "description": "Deluxe Train Set  (ＤＸ列車セット) is a gadget that can make a house into a train.\nPut this gadget into the house. The house will be a train and can move anywhere by following the railroad.",
    "appears_in": [
      "Nobita Express and the Mystery of the Train Hunter",
      "Hitsuji"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/44/Deluxe_Train_Set.PNG/revision/latest/scale-to-width-down/350?cb=20150924063644\u0026path-prefix=en"
  },
  {
    "eng_name": "Devil Card",
    "jp_name": "デビルカード Debiru Kādo",
    "description": "By using this gadget one can gain money by signing a deal with the devil which lives in it. After the deal is done, when someone shakes the card, 300 yens fell from it every time. For every three hundred yens taken out from the card, the one who dealt will get shorter by one millimeter in height.\nIf too much money is taken out from the card, the dealer might turn shorter like an ant or possibly disappear at 12AM.\nChapter 403:Devil Card",
    "appears_in": [
      "Big Light"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/08/Devill_Card.png/revision/latest/scale-to-width-down/350?cb=20160522172225\u0026path-prefix=en"
  },
  {
    "eng_name": "Dictator Switch",
    "jp_name": "どくさいスイッチ",
    "description": "In the future lived a powerful dictator who ruled the whole world. The dictator's power was used to control the citizens by ordering them to follow the same ideology. Anyone who opposed or obstructed the dictator were erased off the face of the earth with the switch. In this way, the whole world would go according to the way that the dictator wants it to be. In the scene before the last scene of the episode \"The Dictator Switch\", Doraemon reveals that this gadget was not created for dictators, but was rather created to teach people a lesson that becoming a dictator is bad.\nThe switch is capable of removing whatever subjects from existence at the user's demand (including their traces of existence and relevant memories), and the effect can be undone by pressing it again.\nDoraemon cannot be despawned by the Dictator Switch and is immune to all of its effects.",
    "appears_in": [
      "The Dictator Switch",
      "Nobita is a Dictator?!",
      "Doraemon: Nobita's Secret Gadget Museum"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/90/Dictatorswitch.jpg/revision/latest/scale-to-width-down/350?cb=20140527084056\u0026path-prefix=en"
  },
  {
    "eng_name": "Doctor's Kit",
    "jp_name": "お医者さんカバン Oishasankaban",
    "description": "A bag with a sensor which attaches to a patient and can diagnose any illness they may have. It can also dispense the medicine needed to cure their illness.",
    "appears_in": [
      "The Giant Dora-Raccoon at Midnight",
      "Doraemon: Nobita and the New Steel Troops ~Winged Angels~",
      "Stand by Me Doraemon",
      "Nobita and the Kingdom of Clouds",
      "Nobita's Genesis Diary",
      "Doctor Bag",
      "Werewolf Cream/U.S. English dub"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/5f/Doctor_Bag.PNG/revision/latest/scale-to-width-down/350?cb=20151008134949\u0026path-prefix=en"
  },
  {
    "eng_name": "Donbura Powder",
    "jp_name": "ドンブラ粉 \"Donbura-ko\"",
    "description": "Donbura powder or Swimming powder has a multifunctional purpose, if you use this powder to your body, you can swim or dive in the ground, if you use this tool to a board or cardboard, it can floating on the ground like on top a water. This powder can also sink an object in the ground",
    "appears_in": [
      "Doraemon: Nobita and the Birth of Japan 2016",
      "Chapter 217:Donbura Powder",
      "Swimming Powder",
      "Sailing Adventure",
      "Doraemon: Nobita and the Birth of Japan 2016"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/3e/Donbura_powder.jpeg/revision/latest/scale-to-width-down/350?cb=20240919092502\u0026path-prefix=en"
  },
  {
    "eng_name": "Dracula Set",
    "jp_name": "ドラキュラセット Dorakyura Setto",
    "description": "To use it, the user must put on the fangs and cape, allow the user to transform into a small vampire bat. The user, in bat form, then bites the target neck and wipe the memory with only the chosen memory being wiped and the bite will leave no mark. Other functions of this gadget include flight and open the locked window.\nApparently, despite the appearance as a kid's toy set, this gadget may be used in spying and infiltration.",
    "appears_in": [
      "Transform with the Dracula Set!",
      "A Dracula Set",
      "Forgotten Stick"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/37/Dracula_Set.png/revision/latest/scale-to-width-down/350?cb=20140905074749\u0026path-prefix=en"
  },
  {
    "eng_name": "Dream Gun",
    "jp_name": "ツモリガン \"Tsumorigan\"",
    "description": "If you fire this gun at the target person. then the person will immediately fall asleep and have a sweet dream, as if he was doing what he wanted to do. The target will wake up if all the things in his dream have been done.",
    "appears_in": [
      "Entering Dream Gun",
      "Nobita and the Greek Cake Legend"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/f/f7/Tsumorigan.png/revision/latest/scale-to-width-down/350?cb=20240927101735\u0026path-prefix=en"
  },
  {
    "eng_name": "Dream Ladder",
    "jp_name": "夢はしご Yume hashigo",
    "description": "The user can use this gadget to go to anyone else's dream as they want.\nAs revealed in The Doraemons Special manga the user, after entering the dream world, can't escape back to the real world after The Nightmare Eater Baku appeared. The same user can't even go to another person's dream unless Baku escaped to the real world and was captured.",
    "appears_in": [
      "The Dream Ladder",
      "Gian \u0026 Suneo, A Miraculous Duet!"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/2/2a/Dream_ladder.png/revision/latest/scale-to-width-down/350?cb=20240821123708\u0026path-prefix=en"
  },
  {
    "eng_name": "Dream Stairs",
    "jp_name": "夢はしご Yume Hashigo",
    "description": "It's used for making the user move into someone's dream.",
    "appears_in": [
      "Chapter 48:A Dream of Mr.Mustache"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/bf/Yume_Stairs.PNG/revision/latest/scale-to-width-down/350?cb=20160528044409\u0026path-prefix=en"
  },
  {
    "eng_name": "Dream TV",
    "jp_name": "ユメテレビ",
    "description": "As a TV gadget, it shows other people's dreams. Changing the channel changes the direction and distance the TV scans for, allowing you to see anyone's dreams.\nIf the monitor of the gadget is destroyed, this will allow the enemy of anyone's dreams you watched to pop up to the real world and cause havoc. However, this has not happened.",
    "appears_in": [
      "The Dream Channel"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/c2/Dream_TV.jpg/revision/latest/scale-to-width-down/350?cb=20190701014316\u0026path-prefix=en"
  },
  {
    "eng_name": "Dream Wind Chime (Gadget)",
    "jp_name": "ゆめふうりん",
    "description": "The Dream Bell can only be used on sleeping people (to some extent, those who are unconscious or half-asleep or in a trance are excluded).\nThe user may call a person's name while ringing the Dream Bell. They will rise and sleepwalk (somnambulism) towards the Dream Bell's user. Although rather slow, they may perform various physical activities like playing soccer and jumping rope. Even though the person is practically still sleeping, their personality is still similar as they are awake. A person summoned by the Dream Bell doesn't seem to be able to speak properly, as sleep talking is always an unclear speech (often in a form of mumble).",
    "appears_in": [
      "Chapter 020:Dream Bell",
      "Dream Wind Chime",
      "Nobita and the Knights of Dinosaurs",
      "Gian Makes an Appearance on TV",
      "We're Gonna Go Flower Watching, No Matter What"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/ae/Dream_Bell2005.png/revision/latest/scale-to-width-down/350?cb=20140928152452\u0026path-prefix=en"
  },
  {
    "eng_name": "Dress-Up Camera (gadget)",
    "jp_name": "きせかえカメラ Kise kae kamera",
    "description": "Past models of this item can be seen in Doraemon: Nobita's Secret Gadget Museum, which resemble 19th century cameras.\nThe Dress Up Camera is able to override the person's attire with whatever image inserted inside it, seemingly destroying the ammunition in the process.\nThis item appears to be only usable on humanoid entities and not other types of machines \u0026 structures such as cars \u0026 houses, and spawned clothing may or may not match the size of eligible targets. It also cannot affect the casing of mechanical automatons but instead adds clothing to them (I.E. Doraemon). Additionally, it is able to affect multiple individuals at once, but may result in mismatches when mixed ammunition has been inserted. If fired while damaged or with blanks/no ammunition, the camera may also malfunction and remove all clothing on the target, effectively rendering them naked.\nNudity resulted from this item is never seen on-screen for rating reasons, but has been implied multiple times:\nIn several censored versions, due to rating regulations concerning nudity this item leaves the target with underwear on when fired with blanks, and automatically grants them some if they don't have any. There were also cases where the item is cut entirely.",
    "appears_in": [
      "Chapter 045:Dress-Up Camera",
      "Doraemon: Nobita's Dinosaur",
      "Dress Up Camera",
      "Doraemon: Nobita's Dinosaur 2006",
      "Giant Monster of the Uninhabited Island",
      "Magical Girl Shizu-chan",
      "The Mystery of Goodie Land",
      "Gian \u0026 Suneo, A Miraculous Duet!",
      "The Friends are Big Dolphins?",
      "Fourth Dimensional Dust Bin/2005 Anime",
      "The Mystery of the Pyramids!? The Great Egyptian Adventure",
      "Nobita vs Musashi",
      "Doraemon: Nobita's Secret Gadget Museum",
      "Stand by Me Doraemon",
      "Special Effects Ultra Dora-Man",
      "All-Out Assault! The Sneeze Busters",
      "Facing the Gians",
      "Nobita Comic Weekly",
      "Doraemon: New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Nobita and the Birth of Japan 2016",
      "Suneo Honekawa",
      "Dorami",
      "Doraemon Gadget Rush"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/e8/2005dressupcamver1.png/revision/latest/scale-to-width-down/350?cb=20140518135343\u0026path-prefix=en"
  },
  {
    "eng_name": "Dried Ghost",
    "jp_name": "ゆうれいの干物 Yūrei no himono",
    "description": "It is used to scare someone. This gadget can be used when exposed to water. Once you pour water on it, it will expand.",
    "appears_in": [
      "Shizuka-chan and the Grandfather Tree"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/d/d0/Dried_Ghost.PNG/revision/latest/scale-to-width-down/350?cb=20160225120818\u0026path-prefix=en"
  },
  {
    "eng_name": "Duplicate Mirror",
    "jp_name": "フエルミラー Fuerumira",
    "description": "Duplicate Mirror is one of a Doraemon gadgets.\nYou can duplicate whatever things you want it by showing it into the mirror, except for money. Because it is a mirror, the results will be reversed and it won't be able to be used. But be careful!, if you forget to turn off this gadget, something bad Will happen. Just like Nobita, he was forced into the world of a mirror by mirror Nobita himself.",
    "appears_in": [
      "Nobita in the Mirror",
      "Doraemon: Nobita's Secret Gadget Museum",
      "Kaitou DX"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/0d/Duplicate_Mirror.png/revision/latest/scale-to-width-down/350?cb=20240905085938\u0026path-prefix=en"
  },
  {
    "eng_name": "E.S.P Training Box",
    "jp_name": "E.S.P 訓練ボックス Esupa Kunren Bokkusu",
    "description": "This gadget is used for bringing 3 different psychic abilities out in the user, but it takes years to master them.",
    "appears_in": [
      "wikipedia:Telekinesis",
      "wikipedia:Clairvoyance",
      "wikipedia:Teleportation",
      "Nobita Nobi",
      "wikipedia:Esper (fiction)",
      "wikipedia:Extrasensory perception"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/1b/E.S.P._Training_Box.PNG/revision/latest/scale-to-width-down/350?cb=20160213115026\u0026path-prefix=en"
  },
  {
    "eng_name": "Earth Elevator (gadget)",
    "jp_name": "地球エレベーター",
    "description": "This gadget is used to move through the hole to the Earth.",
    "appears_in": [
      "Earth Elevator"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/2/27/Earth_Elevator_Gadget.jpg/revision/latest?cb=20170627001812\u0026path-prefix=en"
  },
  {
    "eng_name": "Echo Lacquer",
    "jp_name": "こだまラッカー Kodama rakkā",
    "description": "Just spray the gadget on and it will produce an echo; making it seem like someone's responding even if there is no one there.\nThis gadget can be removed using its remover.",
    "appears_in": [
      "Go Home, You Unwanted Guest!"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/92/Echo_Lacquer.PNG/revision/latest/scale-to-width-down/350?cb=20160225111454\u0026path-prefix=en"
  },
  {
    "eng_name": "Energy Valve",
    "jp_name": "エネルギーバルブ Enerugī Barubu",
    "description": "This gadget is used to increase the usual flow of energy.",
    "appears_in": [
      "How to Use Nobita's Energy"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/7b/Energy_Valve.PNG/revision/latest/scale-to-width-down/350?cb=20160430133217\u0026path-prefix=en"
  },
  {
    "eng_name": "Essence Parts",
    "jp_name": "General InformationFunctionsDetails",
    "description": "Essence Parts (Japanese: エキス・パーツ Ekisu pātsu) is one of Doraemon's gadgets that first appeared in the anime episode I Humbly Accept Your Good Points.\nThis gadget extracts the essence of someone's body and lets other people have it for a period of time.",
    "appears_in": [
      "I Humbly Accept Your Good Points"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/c3/Essense_of_Parts.PNG/revision/latest/scale-to-width-down/350?cb=20200426123251\u0026path-prefix=en"
  },
  {
    "eng_name": "Evolution-Degeneration Beam",
    "jp_name": "進化退化ビーム Shinka Taika Bīmu",
    "description": "This gadget is used to evolve or devolve/degenerate anything whether living or inanimate objects.",
    "appears_in": [
      "Nobisuke Nobi",
      "Phoenixia",
      "Ichi",
      "Chapter 139: Evolution - Devolution Radiation Source",
      "A Visitor from the Country of the Future/U.S. English dub",
      "Nobita and the Winged Braves",
      "Nobita's Wannyan Space-Time Odyssey"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/50/Evolution_Degeneration_Beam.jpg/revision/latest/scale-to-width-down/350?cb=20190701014317\u0026path-prefix=en"
  },
  {
    "eng_name": "Explosion Pepper",
    "jp_name": "ばくはつコショウ Baku hatsu koshō",
    "description": "When the user uses this pepper and sprinkles at other people's nose, then those people will sneeze (within powerful energy). That energy causes the user to fly but, remember, when people are preparing to sneeze the user must say out the place where the user wants to go, if not the user will fly in the sky non-stop. There is a problem with this gadget, if the people who had been sprinkled by the user covers his/her mouth when he/she sneezes, the power from his/her sneeze will be less and the user can only fly for a short distance.",
    "appears_in": [
      "The Explosion Pepper"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/cc/Explosion_Pepper.PNG/revision/latest/scale-to-width-down/350?cb=20160601005253\u0026path-prefix=en"
  },
  {
    "eng_name": "Face-Doodling Pen",
    "jp_name": "らくがおペン Rakugao pen",
    "description": "The user draws over one's face on a picture via Face-Doodling Pen, and so that person's face will look exactly like it does in the photo which is doodled over by the Face-Doodling Pen. It is impossible to make the user look back normally without the usage of the Cancellation Eraser.",
    "appears_in": [
      "Doodling on Doraemon"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/8/8a/Face-Doodling_Pen.png/revision/latest/scale-to-width-down/350?cb=20140916082948\u0026path-prefix=en"
  },
  {
    "eng_name": "Fashion Virus",
    "jp_name": "流行性ネコシャクシウイルス or 流行性ネコシャクシビールス",
    "description": "When a few drops of Fashion Virus is put into a petri dish, the 'experimenter' can say whatever things they want to add to the present fashion an alter it in a similar way of 'invocation'. The virus will then multiply and become abundant inside the petri dish. Afterwards, spreading the virus in the air will then make the virus spread and 'infects' any of the 'victims'. After the victim has been infested, they will immediately rush to change into the new \"infectious\" line of fashion.\nThe Fashion Virus is originally used for experimentation. Since fashion always changes from about the longest of between 10 years and the shortest of between 7 months, using it helps in research of trending and grossing ideas.",
    "appears_in": [
      "Chapter 90: The Fashion Virus"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/be/Fashion_Virus2005.png/revision/latest/scale-to-width-down/350?cb=20140929143323\u0026path-prefix=en"
  },
  {
    "eng_name": "Fishing Pond for Things You Dropped",
    "jp_name": "落とし物つりぼり Ōtoshimono tsuribori",
    "description": "The pond is used for looking for things that people have dropped i.e. lost. A fishing pole is dipped in the pond a description of the lost object is given. The user then has to specify the area of where to look, and the pole will most possibly drag out the object from the pond, or at least what it thinks is the object.",
    "appears_in": [
      "The Fishing Pond for Things You Dropped",
      "Nobita's Long Day"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/ce/Fishing_pond.jpg/revision/latest/scale-to-width-down/350?cb=20160202133359\u0026path-prefix=en"
  },
  {
    "eng_name": "Flashbang",
    "jp_name": "虫スカン",
    "description": "The Flashbang is one of Doraemon's gadgets.\nThe Flashbang causes a loud yet harmless explosion and a gust of smoke upon detonation.",
    "appears_in": [
      "Nobita and the Knights of Dinosaurs",
      "Nobita and the Wind Wizard"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/8/86/Flashbang.png/revision/latest/scale-to-width-down/350?cb=20140907085809\u0026path-prefix=en"
  },
  {
    "eng_name": "Flattening Iron (gadget)",
    "jp_name": "General InformationFunctionsDetailsGeneral InformationFunctionsDetails",
    "description": "A roller variant called the Flattening Roller is used in the 2005 anime which has the same properties as the Flattening Iron.\nUse this gadget against any object (also works on people) and it will turn the object into a paper-like thinness. Since it weighs just like paper, the user can easily carry it around. It will return to normal when sprayed with water.\nThis gadget is used by Doraemon and Nobita to effortlessly move the furniture in Gian's cousin's apartment.",
    "appears_in": [
      "Chapter 536:Flattening Iron",
      "Flattening Iron/1979 Anime",
      "Flattening Iron/2005 Anime"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/b4/Flattening_Roller.jpg/revision/latest/scale-to-width-down/350?cb=20200909080104\u0026path-prefix=en"
  },
  {
    "eng_name": "Flattering Lipstick (gadget)",
    "jp_name": "おせじ口べに",
    "description": "The Flattering Lipstick has two sides. One side is the Flattering Lipstick itself, while the other is the Insulting Lipstick. Applying them on one's lips will make all their words either 'flattering' or 'insulting', depending on what type of lipstick used. Simply wiping them off from the lips will remove its effect.",
    "appears_in": [
      "Chapter 10:Flattering Lipstick",
      "Flattering Lipstick"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/01/Flattering_Lipstick.png/revision/latest?cb=20140905080828\u0026path-prefix=en"
  },
  {
    "eng_name": "Flattery Jaws (gadget)",
    "jp_name": "おだてヅヨ一ズ",
    "description": "If someone wears the Flattery Jaws, they will be able to be very good at flattering someone.\n\u003ctabber\u003e\n|-|2005 anime=",
    "appears_in": [
      "Flattery Jaws"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/ef/Flattery_Jaws.png/revision/latest/scale-to-width-down/350?cb=20150819115255\u0026path-prefix=en"
  },
  {
    "eng_name": "Floating Scarf",
    "jp_name": "フワフワオビ",
    "description": "The Floating Scarf must be worn properly so that it may carry the wearer likewise. The typical method of wearing it by wrapping it around the shoulders and arm. The Floating Scarf will then make its wearer float, just like the goddess in the popular Noh play, Hagoromo. The Floating Scarf is incredibly light, so its flight pattern may be greatly affected by wind patterns. Unlike the Take-copter, the Floating Scarf doesn't consume battery.",
    "appears_in": [
      "Chapter 23:Robe of Feather",
      "Doraemon: Nobita's Secret Gadget Museum"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/40/Floating_Scarf2005.png/revision/latest/scale-to-width-down/350?cb=20140929135814\u0026path-prefix=en"
  },
  {
    "eng_name": "Flying Hoop",
    "jp_name": "飛ばし穴 Tobashi ana",
    "description": "It can skip the person or animal who set foot on it. In the manga, it became invisible when placed on the ground.",
    "appears_in": [
      "Chapter 205: Doraemon's Secret",
      "The Giant Dora-Raccoon at Midnight"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/91/Flying_Hoop.PNG/revision/latest/scale-to-width-down/350?cb=20160306091557\u0026path-prefix=en"
  },
  {
    "eng_name": "Forgotten Stick",
    "jp_name": "ワスレンボー Wasurenbō",
    "description": "When the gadget hits the head of a person that person's memories will be forgotten. When hit again, the memories will return but his/her memories before he/she was hit again will be removed.",
    "appears_in": [
      "But, I Saw A Ghost!",
      "Nobita and the Island of Miracles ~Animal Adventure~",
      "Stand by Me Doraemon 2"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/53/Forgotted_Stick.PNG/revision/latest/scale-to-width-down/350?cb=20151024121544\u0026path-prefix=en"
  },
  {
    "eng_name": "Four-Dimensional Building Extension Blocks (gadget)",
    "jp_name": "四次元たてましブロック",
    "description": "By inserting a \"room block\" between the first floor and the top floor, a new room will be created between the two floors. When looking from the outside the exterior of the house will be the same as the rooms are compressed in the 4th dimension.\nThe 2005 version of the anime also reveals that if the block is somehow removed while there is still a person inside the room, when exiting the room and attempting to go up or down the stairs, the person will be trapped on the same floor like Möbius strip.",
    "appears_in": [
      "Fourth Dimensional House Block"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/9b/Fourthdimensionalhouseblock.jpg/revision/latest?cb=20140626181602\u0026path-prefix=en"
  },
  {
    "eng_name": "Free-Size Toy Camera",
    "jp_name": "フリーサイズぬいぐるみカメラ Furī Saizu Nuigurumi Kamera",
    "description": "The item can accept when fed with an image of a specified target - usually a humanoid entity - as ammunition. Afterwards, it spews a spheric capsule that expands into a plush suit resembling the target.\nThe plush adapts to the user actively so they can be used by shorter or taller entities. It visually resembles the target in many ways, but cannot fully disguise the voice of the user as it is still somewhat different to the original counterpart.",
    "appears_in": [
      "Nobita and the Wind Wizard",
      "Nobita Becomes Shizuka-chan"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/e1/Freesizetoycamera.png/revision/latest/scale-to-width-down/350?cb=20150528042933\u0026path-prefix=en"
  },
  {
    "eng_name": "Friend Circle",
    "jp_name": "友だちの輪 Tomodachi no Wa",
    "description": "By standing inside the circle with a partner it can make them befriend each other.",
    "appears_in": [
      "The Friend Circle"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/2/24/Friend_Circle.PNG/revision/latest/scale-to-width-down/350?cb=20160328090849\u0026path-prefix=en"
  },
  {
    "eng_name": "Fur Coat Ring",
    "jp_name": "ケガワリング Kegawaringu",
    "description": "When the body passes through this hoop, it will be coated with fur. The effect of Fur Coat Ring does not wear off until three days. The fur can be shaved, but it grows back after some time.",
    "appears_in": [
      "The Fur Coat Ring"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/57/Fur_Coat_Ring.png/revision/latest/scale-to-width-down/350?cb=20150813033813\u0026path-prefix=en"
  },
  {
    "eng_name": "Genius Helmet",
    "jp_name": "天才ヘルメット Tensai Herumetto",
    "description": "When the user wears this gadget, the user can see the structure of a machine well by seeing through the cover. The gadget is used for repairing things and remodeling machines. But this gadget is no use at all if it is not paired up with Technology Gloves as only the gloves can remodel the things.\nIt looks like a welding helmet with a large dark window that shows the user the machines' structure. The rest is in yellow color.",
    "appears_in": [
      "Nobita's Little Star Wars"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/c1/GH.jpg/revision/latest/scale-to-width-down/350?cb=20150331022211\u0026path-prefix=en"
  },
  {
    "eng_name": "Girlfriend Catalog (Gadget)",
    "jp_name": "ガルフレンド カタログ",
    "description": "The Girlfriend Catalog is a gadget that has appeared in the manga and 1979 anime. Doraemon gave it to Nobita after becoming curious of how many girls he would date in his later life and if he would be married to Shizuka. \nThe Girlfriend Catalog spawns out multiple images of future girlfriends one may have in the future.",
    "appears_in": [
      "Shizuka Minamoto",
      "Girlfriend Catalog",
      "Gian is Married!?"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/94/Girlfriend_Catalog_Gadget_%281979_anime%29.JPG/revision/latest/scale-to-width-down/350?cb=20170812103036\u0026path-prefix=en"
  },
  {
    "eng_name": "Go Go Dog",
    "jp_name": "ゴーゴー ドッグ Gō Gō Doggu",
    "description": "This gadget prevents the target from going to a person's house. The Go Go Dog is useful to repel intruders and catrobbers. Its function is the opposite of the Come Come Cat.",
    "appears_in": [
      "Doraemon and Dorami-chan"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/78/Go_Go_Dog.png/revision/latest/scale-to-width-down/350?cb=20151028085134\u0026path-prefix=en"
  },
  {
    "eng_name": "Go-Home Music Box",
    "jp_name": "ゴーホーム.オルゴール Gōhōmuorugōru",
    "description": "Play the music and the one who listened to the music will be forced to go home.",
    "appears_in": [
      "Nobita's Great Battle of the Mermaid King",
      "Go Home, You Unwanted Guest!"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/9f/Go-Home_Music_Box.png/revision/latest/scale-to-width-down/350?cb=20140906130556\u0026path-prefix=en"
  },
  {
    "eng_name": "Gone-With-The-Wind Electric Fan",
    "jp_name": "ふきとばし・せん風機 Fukitobashi Sen-fū-ki",
    "description": "Only push the button, you can blow anything including heavy objects and even buildings.",
    "appears_in": [
      "Chapter 17:Test Memorizing Toast",
      "Memorization Bread for Tests"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/46/Electric_Fan.PNG/revision/latest/scale-to-width-down/350?cb=20200925034313\u0026path-prefix=en"
  },
  {
    "eng_name": "Good Mood Warmth Sticker",
    "jp_name": "ごきげんポカポカシール Goki Gen Pokapokashīru",
    "description": "Just put this sticker on the body. It'll be able to convert emotional energy into heat. If we become really cheerful, it'll raise our body temperature and make us feel warm and cozy. Otherwise, if our mood took a nose dive, the temperature dropped as well.",
    "appears_in": [
      "The Good Mood Warmth Sticker"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/c7/Good_Mood_Warmth_Sticker.PNG/revision/latest/scale-to-width-down/350?cb=20150924090517\u0026path-prefix=en"
  },
  {
    "eng_name": "Good Points Choice Board",
    "jp_name": "いいとこ選択しボード Ītoko Sentakushi Bōdo",
    "description": "It is white at the bottom and light purple at the top. It has a big yellow button at the bottom and the Power bar is red in color, the Looks bar is green and the IQ or Intelligence bar is blue. They also have pictorial representations of Power, Looks and Intelligence at the top (above the bars).\nThe user can increase or decrease his/her own looks (L), power (P) and intelligence (IQ) using this gadget by raising the bar of the specific quality. However, they cannot increase all three at the same time. If one goes up, the other two partially go down.\nThe Power button is also known as the Strength button.",
    "appears_in": [
      "Looks, Strength, or IQ?"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/1b/%E3%81%84%E3%81%84%E3%81%A8%E3%81%93%E9%81%B8%E6%8A%9E%E8%82%A2%E3%83%9C%E3%83%BC%E3%83%89.jpg/revision/latest?cb=20151015124322\u0026path-prefix=en"
  },
  {
    "eng_name": "Gourmet Table Cloth",
    "jp_name": "グルメテーブルかけ Gurumetēburu Kake",
    "description": "The Gourmet Table Cloth is a very complicated gadget that is able to 'manifest' real food as if it is conjured up from thin air. The user(s) may simply use the cloth by voice command. For example, if Gian says \"Katsudon!\" towards the cloth, then a katsudon will appear in smokes on the cloth. Throughout the series, it has been very convenient for the gang especially when they are having a picnic or camping out.\nKurt Hartman made his own version of the Gourmet Table Cloth, the \"B-Class Gourmet Table Cloth\". Its function is similar to the Gourmet Table Cloth, although due to his inventions mostly hardly considered 'fully effective' or 'decent', it did manifest a pineapple hamburger for Suneo, but it manifested living chickens, a cow as well as a tomato and onion.",
    "appears_in": [
      "Chapter 1: A Partial Gourmet Table",
      "The Gourmet Table Cloth",
      "Mushroom Picking with a Mini Garden",
      "I'm Mini Doraemon",
      "Nobita and the Birth of Japan 2016",
      "Nobita's Space Heroes",
      "Nobita's Dorabian Nights"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/13/Gourmet_Table_Cloth.PNG/revision/latest/scale-to-width-down/350?cb=20150831102237\u0026path-prefix=en"
  },
  {
    "eng_name": "Gravity Paint (gadget)",
    "jp_name": "重力ペンキ Jūryoku Penki",
    "description": "When painted on a material, particularly a wall, a person who steps or walks on the material will not fall because the portion painted portion is not affected by gravity. The paint takes roughly 2 minutes to dry completely on its own.\nApparently, the paint's gravitational effects only takes place when it has already dried when painted.",
    "appears_in": [
      "Chapter 072:Gravity Paint",
      "The Gravity Paint",
      "Nobita and the Haunts of Evil",
      "The New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Doraemon: New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Doraemon: Nobita's Treasure Island",
      "Stand by Me Doraemon 2"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/f/ff/Gravity_Paint.PNG/revision/latest/scale-to-width-down/350?cb=20200629093902\u0026path-prefix=en"
  },
  {
    "eng_name": "Guard Dog Bank",
    "jp_name": "番犬貯金箱 Banken Chokin-bako",
    "description": "The gadget looks like a small brown dog having a slot at the place of it's eyes. It wears blue belt around it's neck having yellow spikes on it. Four of it's teeth are visible even when it's mouth is closed.",
    "appears_in": [
      "The Human Piggy Bank",
      "Doraemon",
      "Nobita Nobi",
      "Puzzle Bank",
      "Hypnosis Bank"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/a8/Puppybank.png/revision/latest/scale-to-width-down/350?cb=20140318004945\u0026path-prefix=en"
  },
  {
    "eng_name": "Guard Robot",
    "jp_name": "ガードロボット Gādorobotto",
    "description": "It acts as a bodyguard shooting laser beams to those who come nearby other than the person targeted to protect. However, it is unable to protect the person from aliens as the aliens were getting closer to Shizuka and when it tried to scare them away, the aliens were able to fight back.",
    "appears_in": [
      "Shizuka's Open-Air Space Bath",
      "Nobita's Ebi Fry"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/54/Guard_Robot.PNG/revision/latest/scale-to-width-down/350?cb=20160224112137\u0026path-prefix=en"
  },
  {
    "eng_name": "Guardian Paper",
    "jp_name": "まもり紙 Mamorigami",
    "description": "You must attract the paper's attention by clapping your hands (like the Shinto people praying) three times. The paper will guard you.\nThe opposite gadget is Pestilence Paper.",
    "appears_in": [
      "wikipedia:Guardian angel"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/0f/Guardian_Paper.PNG/revision/latest/scale-to-width-down/350?cb=20160626145825\u0026path-prefix=en"
  },
  {
    "eng_name": "Guidance Angel",
    "jp_name": "ミチビキエンゼル",
    "description": "In the Japanese episodes, this gadget is voiced by Keiko Yokozawa and Mayumi Tanaka in the 1979 series and Yoshiko Kamei in the 2005 series. It was voiced by Wendee Lee in the English dub of the 2005 series.\nThe Guidance Angel offers guidance to their wearer. They always tell them the best thing to do, with the doll itself have the power to predict the future. Although its guidance always saves the wearer from danger or trouble, the doll can be a 'control freak'. For example, the good guidance it can give is when how to swing or to let the ball pass when Nobita is playing baseball. The other example is the bad guidance that tells Nobita to study instead of helping Doraemon find his lost screw.\nThe Guidance Angel is a good consultant, but it is a control freak. Because it can predict the future, it is often very snobbish about its knowledge. Its opinions are very selfish, only cares about the person's well being (in terms of success in life) instead of their morality.\nThe Guidance Angel is one of the \"Aids (たすける) Gadgets\" in the game. It cost only 1 Bell Point, the cheapest to use amongst the other. It shows the proper path for the player by pointing out the way. When an item is spotted, it will fly towards it, prompting the player to pick them up. If the player is ignoring it and/or going the other way around, the Guidance Angel will start hitting either Doraemon or Nobita angrily. Note that it does not deal damage to either Nobita or Doraemon.\nUnlike in the series, the Guidance Angel in this game flies around, and only actives for a while.\nThe Guidance Angel is listed under number 55 out of 61 gadgets in the game.",
    "appears_in": [
      "The Guidance Angel"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/2/2e/Guidance_Angel.png/revision/latest/scale-to-width-down/350?cb=20140905190744\u0026path-prefix=en"
  },
  {
    "eng_name": "Guiding Machine",
    "jp_name": "みちび機",
    "description": "When the button is pressed, a fortune comes out to tell one what they should do. By following the fortune precisely, the best outcome will come forth toward the user.",
    "appears_in": [
      "Something's Gonna Occur at 7 o'clock"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/0f/Guidingki.jpg/revision/latest/scale-to-width-down/350?cb=20150807090736\u0026path-prefix=en"
  },
  {
    "eng_name": "Gulliver Beam Light",
    "jp_name": "ガリバー光線電灯",
    "description": "The Gulliver Beam Light has the same functions as both the Big Light and Small Light. It has two buttons: one is red and the other is blue. By pressing the red button it can enlarge humans and/or objects and the blue does the opposite, it shrinks things.",
    "appears_in": [
      "Rats Are As Weak As Cats",
      "Rats Are As Weak As Cats"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/41/015_8.jpg/revision/latest?cb=20170130141004\u0026path-prefix=en"
  },
  {
    "eng_name": "Gulliver Tunnel",
    "jp_name": "ガリバートンネル",
    "description": "To become small, the user must go through the tunnel, they will remain small until they go through the tunnel again to become big. However, if the user is going through the big entrance of the tunnel, they will become smaller and possibly be blown by the wind, as Doraemon stated.",
    "appears_in": [
      "Dream Town, Nobita Land",
      "Stand by Me Doraemon",
      "Doraemon: Nobita's Secret Gadget Museum",
      "Nobita's Big Summer Festival Plan",
      "The Nobi Family's Giant Tunafish",
      "Fallen Leaves and Jaiko",
      "Small Light",
      "Kaitou DX"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/98/Gulliver_Tunnel.jpg/revision/latest/scale-to-width-down/350?cb=20190701014318\u0026path-prefix=en"
  },
  {
    "eng_name": "Handmade Cloud Set",
    "jp_name": "手作り雲セット Tedzukuri kumo setto",
    "description": "Handmade Cloud Set is one of gadget owned by Doraemon. This gadget package contain cloud seed, cloud maker machine, and cloud frame wire.\nFirst, you have to make any shape you want with a cloud frame wire. Then, fill the cloud machine with cloud seed. The clouds will come out from the machine. After that, stick to the cloud frames you have been made until the entire surface is covered by the clouds. Your handmade cloud is ready. have fun!",
    "appears_in": [
      "Handmade Clouds Have Fun"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/1a/Cloud_maker_set.png/revision/latest/scale-to-width-down/350?cb=20240903134310\u0026path-prefix=en"
  },
  {
    "eng_name": "Happiness Cards",
    "jp_name": "しあわせトランプ",
    "description": "It has 53 cards. Any wish of the user will come true while holding it. However, after using 52 cards leaving the joker everything will go wrong with the holder. In brief, the user will get several bad things instead. Giving it to someone can get rid of them, but if the user throws away it will come flying back to him/her.",
    "appears_in": [
      "The Happiness Cards",
      "The Fearsome Happiness Cards"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/a8/Happy_Cards.jpg/revision/latest?cb=20150823085205\u0026path-prefix=en"
  },
  {
    "eng_name": "Happy Promenade",
    "jp_name": "ハッピープロムナード Happī Puromunādo",
    "description": "Happy Promenade (ハッピープロムナード Happī Puromunādo) is a gadget owned by Doraemon.\nIt resembles a mat, and it has two pathes on it with some tree's decoration. If you walking from blue to yellow path, your feelings will be more happy and cheerful. But if you walking from opposite path (yellow to blue path), your feeling will more sad, despair and horrible.",
    "appears_in": [
      "Let's Walk Our Way to Happiness!"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/bb/Happy_Promenade.png/revision/latest/scale-to-width-down/350?cb=20240810033136\u0026path-prefix=en"
  },
  {
    "eng_name": "Head of the Gorgon (gadget)",
    "jp_name": "ゴルゴンの首 Gorugon no Kubi",
    "description": "When the box is opened, the user will slowly turn into stone. But if the user pulls the snake on top of the box, the user will turn back to normal. In truth, it is actually a stone-made head with a terrifying design that can emit a type of light from its eyes to turn their target to stone. Pulling the snake which is its hair returns the petrified to normal.\nIn the 2013 movie, it introduces the DX version of it which is very large in size and can levitate above the ground. Unlike the one introduced in the manga and anime, that version's resetting effect only seems to work if the user yanks one of the snakes while it is facing the petrified subject. The gang defeated it with Shizuka taking over and using a mirror to reflect its petrifying rays back to it. Apparently, the snakes are invulnerable from turning to stone by the rays.",
    "appears_in": [
      "Sensei",
      "Doraemon",
      "Suneo Honekawa",
      "Takeshi Gouda",
      "Shizuka Minamoto",
      "Nobita Nobi",
      "The Head of the Gorgon",
      "Doraemon (2005 anime)",
      "wikipedia:Yasuhiro Takato",
      "Doraemon in the United Kingdom"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/bf/Headofgogrono.png/revision/latest/scale-to-width-down/350?cb=20140316212613\u0026path-prefix=en"
  },
  {
    "eng_name": "Helping Hat",
    "jp_name": "タスケテ帽 Tasukete Bō",
    "description": "The Helping Hat has an antennae that detects the nearest person in trouble and guides its user to them. It seems to have a set range.\nThe Helping Hat is Shizuka's second gadget as an Assist Character. When used, Shizuka assumes her 'Magical Girl Shizuru' persona, flying around Doraemon and Nobita occasionally attacking enemies with her syringe that turns them instantaneously into either Hearts(for current health), or Dorayaki(extra life). If the current character(either Doraemon or Nobita) fell down into a pit, Shizuka will save them by bringing them up. The player may control Shizuka carrying the current character for a few seconds, that is, until she lets go and she returns to the Secret Base screen. When saving the current character, Nobita or Doraemon is completely invulnerable.\nWhen using this gadget, Shizuka cannot be dispatched via traps or pits because she is flying and virtually invulnerable. Practically, Shizuka used all three gadgets in the episode, the Inanimate Object Hypnotizing Megaphone, the Dress Up Camera and the Helping Hat itself.\nThe Helping Hat is listed under number 33 out of 61 gadgets in the game.",
    "appears_in": [
      "Magical Girl Shizu-chan",
      "Thank God for the Prison Break"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/44/Helping_Hat.jpg/revision/latest/scale-to-width-down/350?cb=20190630111454\u0026path-prefix=en"
  },
  {
    "eng_name": "Home-Ec Apron",
    "jp_name": "家庭科エプロソ",
    "description": "The gadget is nothing more than a normal apron in most physical properties, other than its titular enhancement - namely a significant boost to the user's household work proficiency. The item can also be disabled by mechanical faults and is prone to weathering.",
    "appears_in": [
      "Winning Back Shizuka-chan (Part 1)",
      "Winning Back Shizuka-chan (Part 2)",
      "The Fear of Jaiko's Curry"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/3b/Home-Ec_Apron.png/revision/latest/scale-to-width-down/350?cb=20140906114501\u0026path-prefix=en"
  },
  {
    "eng_name": "Horizon Tape",
    "jp_name": "地平線テープ Chiheisen Tēpu",
    "description": "It can be used to create an endless huge area that clearly shows the land meeting the sky i.e. the horizon. First, the user sticks one end of the tape to one side of the room and the other end to the other side. The stretched tape must now be facing a wall, and instead of the wall a large area of ground will appear where the horizon can be clearly seen. \nWarning. if you break this tape inside the horizon area. you will be trapped in the horizon area forever!.",
    "appears_in": [
      "The Horizon in Nobita's Room",
      "Doraemon: Nobita's Chronicle of the Moon Exploration"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/0c/Horizon_tape.jpg/revision/latest?cb=20150911095723\u0026path-prefix=en"
  },
  {
    "eng_name": "Horror Story Lamp",
    "jp_name": "怪談ランプ Kaidan Ranpu",
    "description": "Horror Story Lamp creates the surrounding scenery with various sound effects and even environmental changes like a shifting wind of sudden blow-out of the candle. For example, Nobita tells the story similar to Gian's (the Okiku's Plate,番町皿屋敷, lit. The Dish Mansion at Banchō), they heard a sound of a broken plate outside of the room. The cause of that sound was later revealed to be caused by a thief, whom was also counting the money he looted, similar to the scene when the ghost of Okiku was counting (plates).",
    "appears_in": [
      "The Ghost Story Lamp",
      "Chapter 19:Horror Story Lamp"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/a4/Horror_Story_Lamp2005.png/revision/latest/scale-to-width-down/350?cb=20140929154149\u0026path-prefix=en"
  },
  {
    "eng_name": "Human Manufacturing Machine",
    "jp_name": "人間製造機 Ningen seizō ki",
    "description": "Human Manufacturing Machine is a gadget owned by Doraemon. It is one of the banned gadgets.\nIt can create humans (manga \u0026 1979 anime) and other creatures (2005 anime). But the creatures made with it are mutants.",
    "appears_in": [
      "Chapter 131:Human Manufacturing Machine"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/48/Human_Manufacturing_Machine.PNG/revision/latest/scale-to-width-down/350?cb=20160330130553\u0026path-prefix=en"
  },
  {
    "eng_name": "Human Piggy Bank Maker",
    "jp_name": "人間貯金箱製造機 Ningen chokin-bako seizō ki",
    "description": "This gadget is used to make a piggy bank from a human. Just enter the code into the gadget and navigate it to the target.",
    "appears_in": [
      "The Human Piggy Bank",
      "Lawnmower Fish"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/8/87/Human_Piggy_Bank_Maker.PNG/revision/latest/scale-to-width-down/350?cb=20151013020423\u0026path-prefix=en"
  },
  {
    "eng_name": "Human Steam Engine Set",
    "jp_name": "人間機関草 Ningen Kikan-sō",
    "description": "The user places a smokestack on their head and uses coal-shaped candy after that drinking enough water to gain the speed and torque of a steam train.",
    "appears_in": [
      "Chapter 138:Human Engine",
      "Doraemon's 100 Year Time Capsule"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/49/Human_Steam_Engine_.PNG/revision/latest/scale-to-width-down/350?cb=20201024071758\u0026path-prefix=en"
  },
  {
    "eng_name": "Hypnosis Bank",
    "jp_name": "さいみん貯金箱 Saimin Chokin-bako",
    "description": "This gadget is like a piggy bank whose shape looks like a gas cylinder having a popped out flexible and stretchable hand at the top of it. The body of this gadget is metallic and is maroon in color. It consists of an eye having greenish pupil and a slot. The popped out hand has a glove on it.",
    "appears_in": [
      "The Human Piggy Bank",
      "Doraemon",
      "Nobita Nobi",
      "Puzzle Bank",
      "Guard Dog Bank"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/2/23/Hypnobank.png/revision/latest/scale-to-width-down/350?cb=20140318004916\u0026path-prefix=en"
  },
  {
    "eng_name": "Hypnosis Pendulum",
    "jp_name": "General InformationFunctionsDetails",
    "description": "With this tool, the user can put people (even robots) into hypnosis.",
    "appears_in": [
      "Doraemon's 100 Year Time Capsule",
      "Doraemon"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/90/Hypnosis_Pendulum.png/revision/latest/scale-to-width-down/350?cb=20201024055307\u0026path-prefix=en"
  },
  {
    "eng_name": "Illumination Crackers",
    "jp_name": "イルミネーション クラッカー Iruminēshon Kurakkā",
    "description": "If someone takes this cracker, the person will glow. And once the user starts glowing, they stay lit up for the entire day.",
    "appears_in": [
      "The Great, Twinkling Christmas Plan"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/8/89/Illumination_Crackers.png/revision/latest/scale-to-width-down/350?cb=20150813032608\u0026path-prefix=en"
  },
  {
    "eng_name": "Image Light Cap (gadget)",
    "jp_name": "イメージライトキャップ Imēji Raito Kyappu",
    "description": "If someone puts the cap on and points it at an incident that is happening at the moment, whatever is happening will change and instead turn into what the user thinks will happen, not what actually would have happened.",
    "appears_in": [
      "Image Light Cap",
      "Suneo is the Ideal Big Brother"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/4e/Imagelightcap2005.jpg/revision/latest?cb=20150621034608\u0026path-prefix=en"
  },
  {
    "eng_name": "Imitation Dummy",
    "jp_name": "人真似ロボット Hitomane Robotto",
    "description": "The Imitation Dummy may copy a person's appearance and other aspects on command. It may function as a substitute for that person. Its method of imitation is similar to mimicry, as they tend to be more exaggerated.",
    "appears_in": [
      "Chapter 12:Operation - Propose",
      "The Proposal 13 Years Ago",
      "There are 1000 Gians",
      "Copy Robot"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/78/Imitation_Robot.jpg/revision/latest/scale-to-width-down/350?cb=20190701014320\u0026path-prefix=en"
  },
  {
    "eng_name": "Infinity Lasso",
    "jp_name": "なげ投げ縄 Nage Nage Nawa",
    "description": "The Infinity Lasso is one of Doraemon's gadgets.\nThrow the lasso and it will catch whatever the user wants, the lasso can even make a turn if needed.",
    "appears_in": [
      "A Visitor from the Country of the Future/U.S. English dub",
      "Running Away to the Cretaceous Period",
      "Doraemon's 100 Year Time Capsule",
      "The Super Mobile Bathtub 1010/2005 Anime"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/d/d4/Infinitylasso.PNG/revision/latest/scale-to-width-down/350?cb=20191207065751\u0026path-prefix=en"
  },
  {
    "eng_name": "Insect Pills",
    "jp_name": "コンチュー丹 Konchū Tan",
    "description": "It gives the user the power to fly like a butterfly, the power to sting like bees, ants' strength, and a strong body, such as in a hard beetle. It also causes the user to have bug-like behaviors like eating leaves, being afraid of nets and fainting due to bug sprays.\nNobita",
    "appears_in": [
      "The Invincible! Insect Pills"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/c4/Insect_Pills.jpg/revision/latest/scale-to-width-down/350?cb=20190625140031\u0026path-prefix=en"
  },
  {
    "eng_name": "Instant Chocolate Maker",
    "jp_name": "インスタントチョコメーカー Insutanto Choko Mēkā",
    "description": "When an object is placed on the gadget, the gadget produces a chocolate with the shape of the certain object. The chocolate produced by the gadget is delicious.",
    "appears_in": [
      "Serve the Chocolate Nobita"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/36/%E3%82%A4%E3%83%B3%E3%82%B9%E3%82%BF%E3%83%B3%E3%83%88%E3%83%81%E3%83%A7%E3%82%B3%E3%83%A1%E3%83%BC%E3%82%AB%E3%83%BC.png/revision/latest/scale-to-width-down/350?cb=20151203040926\u0026path-prefix=en"
  },
  {
    "eng_name": "Instant Copy Machine",
    "jp_name": "インスタントコピー機 Insutantokopī-ki",
    "description": "The sole function of the Instant Copy Machine is to copy another person. Unlike the Copy Robot, it can make multiple copies of one person.",
    "appears_in": [
      "Instant Mom"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/32/Instant_Copy.PNG/revision/latest/scale-to-width-down/350?cb=20240909050236\u0026path-prefix=en"
  },
  {
    "eng_name": "Instant Miniature-Making Camera",
    "jp_name": "インスタントミニチュアサいぞうカメラInsutantominichuasa i zō kamera",
    "description": "Snap a picture with this camera, and it will instantly develop a miniature model that looks exactly like what you took a picture of. (Note: This gadget is also as seen in Doraemon \u0026 Tamagotchi!)",
    "appears_in": [
      "The City of Dreams, Nobita Land",
      "Special Effects Ultra Dora-Man",
      "Chapter 047:Dream Town, Nobita Land",
      "Doraemon: Nobita's New Dinosaur"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/2/24/Instant_Miniature-Making_Camera.jpg/revision/latest/scale-to-width-down/350?cb=20190701014321\u0026path-prefix=en"
  },
  {
    "eng_name": "Instant Object Mobile (gadget)",
    "jp_name": "物体瞬間移動機",
    "description": "The gadget is a machine that has a screen with a pointer, which serves to indicate what object or person the user wants to bring. It also has a platform where the determined object or person will appear when the user presses and \"O.K.\" button. In both of its appearances, it was used to bring back the toys and manga that Gian had confiscated.",
    "appears_in": [
      "Defeat the Bully",
      "Defeat the Bully",
      "Defeat the Bully"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/bc/Weapon_08_01.jpg/revision/latest?cb=20170201201907\u0026path-prefix=en"
  },
  {
    "eng_name": "Instant Pitfall",
    "jp_name": "即席落とし穴 Sokuseki Otoshiana",
    "description": "It is used to create a pitfall, which is basically something like a hole in the ground used for hiding. In the movie Nobita and the Steel Troops, it is used by Doraemon, Nobita, Gian and Suneo to protect themselves from the Steel Troops.",
    "appears_in": [
      "Nobita and the Steel Troops",
      "Nobita and the Island of Miracles ~Animal Adventure~"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/13/Instant_Pitfall.PNG/revision/latest/scale-to-width-down/350?cb=20151024082622\u0026path-prefix=en"
  },
  {
    "eng_name": "Instant Tree",
    "jp_name": "インスタントツリー, Insutanto Tsurī",
    "description": "The Instant Tree is used for Christmas and can replace a typical Christmas tree. In order to make it function, one must pour hot water on the soil, and it will then start to grow into a Christmas tree.\n\u003ctabber\u003e\n|-|2005 anime=",
    "appears_in": [
      "Chapter 72:Gravity Paint",
      "Gravity Paint"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/8/85/Instant_Tree_Title_Card_%28Gravity_Paint_2005_episode%29.png/revision/latest/scale-to-width-down/350?cb=20141125041719\u0026path-prefix=en"
  },
  {
    "eng_name": "Invisible Cape",
    "jp_name": "透明マント Tōmei Manto",
    "description": "Use the cape and cover something and the thing, along with the cape itself, will turn invisible.",
    "appears_in": [
      "Chapter 8:Chin Up to the Ancestors",
      "A Visitor from the Country of the Future",
      "Stand by Me Doraemon",
      "Nobita's Space Heroes",
      "Jaiko and Dorami Have Boyfriends!?",
      "Battle! Cat-Model Robots VS Dog-Model Robots",
      "Shoes to Dance According to the Type of Music",
      "Who is the Mask of Academic?",
      "Stand by Me Doraemon"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/6/6b/Invisible_Cape.png/revision/latest/scale-to-width-down/350?cb=20140905122821\u0026path-prefix=en"
  },
  {
    "eng_name": "Jack Bean",
    "jp_name": "ジャック豆 Jakkumame",
    "description": "It acts like the bean in the traditional fairytale Jack and the Beanstalk.",
    "appears_in": [
      "Nobita's Jack and the Beanstalk"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/b5/Jack_Bean.PNG/revision/latest/scale-to-width-down/350?cb=20160529062055\u0026path-prefix=en"
  },
  {
    "eng_name": "Jack-In-The-Box Stick",
    "jp_name": "びっくり箱ステッキ Bikkuribako Sutekki",
    "description": "Any type of boxes or containers touched by the Stick will become a Jack-in-the-Box containing scary monsters",
    "appears_in": [
      "Lucky Mambo",
      "The Jack in the Box Stick",
      "Chapter 293: Jack-In-The-Box Stick"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/2/2f/Jack-in-the-box_Stick.PNG/revision/latest/scale-to-width-down/350?cb=20150830033058\u0026path-prefix=en"
  },
  {
    "eng_name": "Jacuzzi Hot Spring",
    "jp_name": "温泉ジャグジー Onsen Jagujī",
    "description": "The gadget can be attached to a bath tub. It is normally used to create Jacuzzis, but with Nobita's experiment, it can also produce a \"food\" Jacuzzi.",
    "appears_in": [
      "Let's Take a Bath in a Delicious Hot Spring!",
      "Super Mobile Bath 1010"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/7e/%E6%B8%A9%E6%B3%89%E3%82%B8%E3%83%A3%E3%82%B0%E3%82%B8%E3%83%BC.png/revision/latest/scale-to-width-down/350?cb=20200927053233\u0026path-prefix=en"
  },
  {
    "eng_name": "Japan Standard Calendar",
    "jp_name": "日本標準カレンダー Nippon Hyōjun Karendā",
    "description": "One should use the red sticker and paste it on the day the user wants to have the holiday. Then, write down what the holiday is called and the entire Japanese calendar will be changed to match that of the gadget. The entirety of Japan will then follow the new national day(s) on their calendars. For example, Nobita wrote \"Nap Day\" and all the people in Japan took a nap. One can revert its effect by taking off the sticker.",
    "appears_in": [
      "The Lazy Day",
      "Takeshi's Bum-Ba-Dum Birthday!"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/5d/Japan_Standard_Calendar.png/revision/latest/scale-to-width-down/350?cb=20140914143853\u0026path-prefix=en"
  },
  {
    "eng_name": "Joining Incense",
    "jp_name": "なかまいりせんこう  naka mairi senkō",
    "description": "By pressing the button, a smoke will come out of the green tip. Walk around the target person/people with the smoke surrounding them at least once and you will be able to join their group.",
    "appears_in": [
      "The Joining Incense",
      "Sucking Mosquito"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/75/Joining_Incense.PNG/revision/latest/scale-to-width-down/350?cb=20160611082526\u0026path-prefix=en"
  },
  {
    "eng_name": "Kaito Set",
    "jp_name": "怪盗セット Kaitō Setto",
    "description": "The Kaito Set is technically multiple gadgets, each of which do a unique function.",
    "appears_in": [
      "Kaito Nobita Calling On!"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/8/87/Kaito_Set.png/revision/latest/scale-to-width-down/350?cb=20140914083249\u0026path-prefix=en"
  },
  {
    "eng_name": "Kaitou DX (gadget)",
    "jp_name": "怪盗デラックス",
    "description": "The Kaitou DX is a gadget that appears in Doraemon: Nobita's Secret Gadget Museum.\nA user who puts on the bow tie can have the abilities of a Phantom Thief, who were gentlemen/ladies who steals expensive things not for wealth but for adventure.",
    "appears_in": [
      "wikipedia:Gentleman thief",
      "wikipedia:"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/48/Bow.PNG/revision/latest/scale-to-width-down/350?cb=20200317195839\u0026path-prefix=en"
  },
  {
    "eng_name": "King's Throne",
    "jp_name": "王様の椅子 Ōsama no isu",
    "description": "This gadget is used to make everyone completely unable to ignore the commands of the person sitting in it until they are carried out.",
    "appears_in": [
      "King Nobita is Undefiable"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/48/King_Throne.PNG/revision/latest/scale-to-width-down/350?cb=20151003080253\u0026path-prefix=en"
  },
  {
    "eng_name": "Kurupa Rays Gun",
    "jp_name": "クルクルパー光線 Kurukurupā Kōsen",
    "description": "The Kurupa Rays Gun is a gun-shaped gadget that serves to hypnotise or weaken the human brain, and thus making the person act more dumb. The gadget launches radio waves. It was used by Doraemon, who made Nobita's classmates and teacher unintelligent and his parents more childish.",
    "appears_in": [
      "Doraemon Came Out!"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/a2/KuruKurupaKousen.jpg/revision/latest?cb=20170201014024\u0026path-prefix=en"
  },
  {
    "eng_name": "Later Candy",
    "jp_name": "おそだアメ Osoda Ame",
    "description": "When consumed, the user's voice will be delayed for a period of time, based on the amount of candy ate\nEach candy can delay the user's voice for 10 minutes.",
    "appears_in": [
      "The Later Candy",
      "There are 1000 Gians"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/cc/Later_Candy.PNG/revision/latest/scale-to-width-down/350?cb=20160318130315\u0026path-prefix=en"
  },
  {
    "eng_name": "Laughing Earbud",
    "jp_name": "ゲラゲライヤホン",
    "description": "If a person puts it in their ear, everything they hear turns into a joke that is very funny.",
    "appears_in": [
      "Chapter 133:Live with a Laugh",
      "Let's Live to Laugh"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/f/fd/Laughing_Earbud.png/revision/latest/scale-to-width-down/350?cb=20150811071759\u0026path-prefix=en"
  },
  {
    "eng_name": "Leopard Cat Glasses and Tail",
    "jp_name": "タヌ機, Tanuki",
    "description": "This gadget is used to control the mind like the mythological creatures of Japanese (Tanuki).",
    "appears_in": [
      "Chapter 122 : Leopard Cat Machine"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/1e/Tanuki.PNG/revision/latest/scale-to-width-down/350?cb=20150805140158\u0026path-prefix=en"
  },
  {
    "eng_name": "Lie 800",
    "jp_name": "ＬＩＥ　８００",
    "description": "When consumed, any events said by the user will forcibly occur in the other way around.\nIt is able to affect subjects any point in the timeline. For example, when Suneo insults Nobita who curses him with the potion's effects, a dog suddenly appears out of nowhere and viciously attacks Suneo, and when Nobita laments on Doraemon's premature departure, the latter suddenly pops out inside his room.",
    "appears_in": [
      "Chapter 107: Return of Doraemon",
      "Doraemon Comes Back",
      "Goodbye, Doraemon...",
      "Doraemon: Nobita's Secret Gadget Museum",
      "Stand by Me Doraemon",
      "Inspector Mustard",
      "Kaitou DX"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/7c/Mean_Drink.png/revision/latest/scale-to-width-down/350?cb=20140928060540\u0026path-prefix=en"
  },
  {
    "eng_name": "Lie Speaker",
    "jp_name": "アトカラホントスピーカー Atokarahonto supīkā",
    "description": "Hold this bullhorn up to your mouth and tell a lie, and that lie will then become truth.",
    "appears_in": [
      "The Lie Speaker"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/9b/Lie_Speaker.jpg/revision/latest/scale-to-width-down/350?cb=20190729133902\u0026path-prefix=en"
  },
  {
    "eng_name": "Lifeboat",
    "jp_name": "助け船 Tasukebune",
    "description": "It is used to detect and find people who need help.",
    "appears_in": [
      "The \"Help Me!\" Lifeboat"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/71/Tasuke_Bune.png/revision/latest/scale-to-width-down/350?cb=20151130023742\u0026path-prefix=en"
  },
  {
    "eng_name": "Light-or-Heavy Meter",
    "jp_name": "ふんわりズッシリメーター",
    "description": "This meter can be used to modify the weight of a person or object. Point the meter towards the thing you want to use it on, and press the one of the buttons on either side. If you want to make it heavier, push the + button, if you want to make it lighter, push the negative (-) button.",
    "appears_in": [
      "Nobita Nobi"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/0f/Lightorheavymeter.jpg/revision/latest/scale-to-width-down/350?cb=20200914064530\u0026path-prefix=en"
  },
  {
    "eng_name": "Lucky Gun (Gadget)",
    "jp_name": "幸運の銃 Kōun no jū",
    "description": "There are four bullets, three of them are red and one black. Get hit by the red bullet, and one will have a day of good luck. Get hit by the black bullet, and one will have a day of bad luck.",
    "appears_in": [
      "Chapter 69: Lucky Gun",
      "Lucky Gun"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/09/LuckyGun.png/revision/latest/scale-to-width-down/350?cb=20150718181734\u0026path-prefix=en"
  },
  {
    "eng_name": "Lying Beak",
    "jp_name": "ソノウソホント Sonousohonto",
    "description": "Wearing this on one's mouth and lying to someone makes them believe that the spoken lie is true, even though it is actually not. To stop the effect of the gadget, the wearer has to conclude that it is a lie.\n\n\u003c/gallery\u003e",
    "appears_in": [
      "Chapter 054:Lies Become Truths",
      "That Lie is True!",
      "The Competition Of Man's Power"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/6/63/Lyingduckbeak.png/revision/latest/scale-to-width-down/350?cb=20140409232914\u0026path-prefix=en"
  },
  {
    "eng_name": "Lying Machine (gadget)",
    "jp_name": "横たわる機械 Yokotawaru kikai",
    "description": "When the user tells a lie (or joke) to the person, that person will believe whatever that user has told him/her, regardless of how ridiculous or unbelievable it was.",
    "appears_in": [
      "Lying Beak",
      "Flag of Truth (gadget)"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/ed/LyingMachine1979.JPG/revision/latest/scale-to-width-down/350?cb=20201029184927\u0026path-prefix=en"
  },
  {
    "eng_name": "Magic Belly",
    "jp_name": "マジックおなか",
    "description": "Magic Belly is a gadget used in the episode, Cartoonist Jaiko.\nThis gadget can be used with two users. First, one of the users places the red \"belly button\" on another user. With a simple swipe of the console, he or she can make the other laugh uncontrollably. The harder the swipe and the more the swipe, the harder the laugh and the more the laugh.\nFor the 1979 anime entitled The Magic Belly, a cat used the console and made Suneo laugh, whereas Shizuka does so in the 2005 anime entitled Cartoonist Jaiko.",
    "appears_in": [
      "The Magic Belly",
      "Cartoonist Jaiko"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/d/dc/Magic_Belly.png/revision/latest/scale-to-width-down/350?cb=20140907155409\u0026path-prefix=en"
  },
  {
    "eng_name": "Magic Butt",
    "jp_name": "マジックお尻 Majikku o shiri",
    "description": "When a parent spanks this gadget, they can administer punishment, no matter where their child is. this is similar to voodoo doll\nIt is more commonly used by Nobita's father,  as a way to punish him and also take some satisfaction.\nThe gadget also helps in stopping hiccups, as seen in Doraemon Is An Exam Student Now!?",
    "appears_in": [
      "Doing Anything I Please with the Magic Hand",
      "Doraemon Is An Exam Student Now!?",
      "Doraemon in Indonesia"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/52/Magic_Butt.PNG/revision/latest/scale-to-width-down/350?cb=20160220145340\u0026path-prefix=en"
  },
  {
    "eng_name": "Magic Eyes",
    "jp_name": "百万ボルトひとみ Hyakuman boruto hitomi",
    "description": "Hyakuman boruto hitomiTo use the gadget, the user places the eyes on a gadget and wears it. The gadget then created an attraction electric wave that causes anyone who look at the user in the eyes to become attracted to them. As such, the effect doesn't manifest if other person doesn't look in the eyes, and the attraction will subside in a few seconds after the person stops looking/is separated from the user or the user takes the glasses off.\nBeware, if the user looks at themselve in the mirror, then the user will become attracted to their own reflection.",
    "appears_in": [
      "Your Eyes Have One million Volts"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/09/MagicEyes100Volts.png/revision/latest/scale-to-width-down/350?cb=20200817044921\u0026path-prefix=en"
  },
  {
    "eng_name": "Magic Hands",
    "jp_name": "マジックハンド Majikku Hando",
    "description": "Whenever the user wears the Magic Hands, they can gain slight telekinetic or mind control powers, acting on objects and other living beings without touching them.",
    "appears_in": [
      "Doing Anything I Please with the Magic Hands"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/50/Magic_Hands.PNG/revision/latest/scale-to-width-down/350?cb=20151017075443\u0026path-prefix=en"
  },
  {
    "eng_name": "Mario's Warp Pipe",
    "jp_name": "マリオの土管 Mario no Dokan",
    "description": "Japanese Prime Minister, Shinzō Abe, is not able to make it in time to the closing ceremony of the 2016 Summer Olympics in Rio. He transforms into Mario, a character from Super Mario Bros. and is seen running across Tokyo's Shibuya Crossing a moment later. Doraemon, a blue cat-shaped robot who appears in the titular anime and manga, happens to be in the vicinity and takes out the Warp Pipe, which allows Mario to be transported to Rio, which is halfway across the world.\nThe warp pipe drills a hole into the core of the Earth from the current area the user is in to the designated area.Its' use is to transport someone to a designated place or area anywhere through the earth. The pipe drills a hole to the core and then to the designated area the user wants to go to. Just like in the Mario series, pipes take a very short time to anywhere regardless of distance.",
    "appears_in": [
      "Copy Robot"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/90/Warp_Pipe.PNG/revision/latest/scale-to-width-down/350?cb=20160827130903\u0026path-prefix=en"
  },
  {
    "eng_name": "Mecha Maker",
    "jp_name": "メカ・メーカー",
    "description": "The Mecha Maker is a gadget from the 2005 anime.\nMecha Maker allows the user to create mechanical contraptions. A blueprint and materials must be inserted for it to work.\nThis was an episode from the Doraemon English Dub that premiered on Disney XD.",
    "appears_in": [
      "Mecha Manufacturer",
      "Chapter 396:The Mecha Maker"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/7d/Mecha_Maker.jpg/revision/latest/scale-to-width-down/350?cb=20200710014648\u0026path-prefix=en"
  },
  {
    "eng_name": "Memory Bank (gadget)",
    "jp_name": "メモリーローン Memorīrōn",
    "description": "This is a gadget that allow the user to exchange their memories for money, as well as for erasing any unwanted memories by paying money in exchange. The user first places the tube section on their forehead for the gadget to scan their memory. Afterwards, the machine displays all the memories/events the user experienced along with the exchange price, with exchange rate varying from person to person depending on what they believe to be good or bad memory. The user then selects which memory to exchange for money, with good memories resulting in payout, while bad memories has the user pay money instead.\nAfter the transaction, the memory is removed from the user's brain. The removed memory can be returned by repeating the process in opposite i.e. pay money to return good memories, receive money for returning bad memories.",
    "appears_in": [
      "Memory Bank"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/97/MC1CZaSd99-1.jpg/revision/latest/scale-to-width-down/350?cb=20200506081024\u0026path-prefix=en"
  },
  {
    "eng_name": "Mind Reading Helmet (gadget)",
    "jp_name": "さとりヘルメット",
    "description": "Doraemon brings out this gadget to help Nobita who was tricked by Gian.",
    "appears_in": [
      "Mind Reading Helmet"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/06/Mindreadinghelmetgadget.jpg/revision/latest/scale-to-width-down/350?cb=20141024150732\u0026path-prefix=en"
  },
  {
    "eng_name": "Mini Black Hole",
    "jp_name": "ミニブラックホール Miniburakkuhōru",
    "description": "This gadget is basically the miniature version of a big bad black hole which usually stay in space. Black holes are such things that even don't let light escape from itself so this gadget has to be handled very carefully! One mistake and slowly you, your house, your city, country, continent and then the entire planet gets sucked in! This gadget is just as scary as a real black hole...\nIf you drink a medicine that breaks the effects of this gadget, the sucked objects however will reappeared in the supposed place that your...",
    "appears_in": [
      "Nobita's Black Hole",
      "The Mystery of Goodie Land"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/57/Mini_Black_Hole.PNG/revision/latest/scale-to-width-down/350?cb=20151003084811\u0026path-prefix=en"
  },
  {
    "eng_name": "Mini Garden Series",
    "jp_name": "箱庭シリーズ・急流山 Hakoniwa Shirīzu: Kyūryūzan箱庭シリーズ・赤松山 Hakoniwa Shirīzu: Akamatsuyama箱庭シリーズ・岩山 Hakoniwa Shirīzu: Iwayama箱庭シリーズ・ゲレンデ山 Hakoniwa Shirīzu: Gerendeyama箱庭シリーズ・ハイキング山 Hakoniwa Shirīzu: Haikinguyama箱庭シリーズ・冒険山 Hakoniwa Shirīzu: Bōkenyama",
    "description": "Mini Garden Series (箱庭シリーズ Hakoniwa Shirīzu) is the series of Doraemon's gadget. These gadgets is useless if the user hasn't Small Light.\n\nMain article: White Water Mountain\nThe White Water Mountain is the suitable mountain for fishing.\n\nThe Japanese Red Pine Mountain is the suitable mountain for mushroom picking.\n\nMain article: Rocky Mountain\nThe Rocky Mountain is the suitable mountain for practicing rock climbing.\n\nMain article: Snowy Mountain\nThe Snowy Mountain is the suitable mountain for skiing.\n\nMain article: Hiking Mountain\nThe Hiking Mountain is the  mountain for kids. This mountain can use for hiking and picnic.\n\nMain article: Adventurous Mountain\nThe Adventurous Mountain is the  mountain for adventure.",
    "appears_in": [
      "Mushroom Picking with a Mini Garden"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/7e/Mini_Garden_Series_White_Water_Mountain.PNG/revision/latest/scale-to-width-down/350?cb=20150830130513\u0026path-prefix=en"
  },
  {
    "eng_name": "Mini-Doras",
    "jp_name": "ミニドラ MinidoraGeneral informationCasual informationRelationshipsOther DetailsGallery",
    "description": "Mini-Doras are one of Doraemon's gadgets. \nMini-Doras were robots created by the Matsushiba Robot Factory per Time Patrol's request to celebrate Doraemon's heroism in helping them to arrest two terrorists.\n\nBeing smaller clones of Doraemon with different paint jobs, they are sentiment automatons that act as tiny helpers, capable of performing wide variety of tasks while communicating with the \"Minidora\" language. They appear to be capable of understanding other types of human languages.\nThey also have the ability to use gadgets, albeit to a lesser extent due to their size. However, they are not as effective as Doraemon himself or other similar machines such as Dorami.\nLike Doraemon himself, they are agitated if referred to with the alias \"raccoon\".",
    "appears_in": [
      "Doraemon: Nobita's Treasure Island",
      "Doraemon in India",
      "Doraemon in Indonesia",
      "Mini-Dora SOS!!",
      "Doraemon: Nobita and the Green Giant Legend DS",
      "The Doraemons",
      "Dorarinyo",
      "4D Pocket"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/06/Minidoras.jpg/revision/latest?cb=20130914122556\u0026path-prefix=en"
  },
  {
    "eng_name": "Missing Person Stick",
    "jp_name": "たずね人(びと)ステッキ Tazunebitosutekki",
    "description": "It use indicate the the direction of a person you want to find. However, if the person you want to find is from another timeline, it will cause confusion.",
    "appears_in": [
      "45 Years Later... My Future Self Came to Visit/2005 Anime",
      "Running Away to the Cretaceous Period",
      "Nobita Meets the Masked Queen",
      "Nobita and the Birth of Japan 2016",
      "Stand by Me Doraemon 2"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/2/21/Missingpersonstick.PNG/revision/latest/scale-to-width-down/350?cb=20191209031812\u0026path-prefix=en"
  },
  {
    "eng_name": "Mole Gloves",
    "jp_name": "もぐら手袋 Mogura tebukuro",
    "description": "The gloves are mostly in color with the mix of green on the sharp parts. It looks very easy to wear and is large and can fit anyone's hands easily. \nThis gadget used to make hole in the ground or create underpass. This gadget can dig the deepest holes and cut through the ground like butter.",
    "appears_in": [
      "Nobita's Space Heroes",
      "Nobita's New Great Adventure into the Underworld – The Seven Magic Users"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/07/Mole_Gloves.PNG/revision/latest/scale-to-width-down/350?cb=20151011091637\u0026path-prefix=en"
  },
  {
    "eng_name": "Momotaro Jirushi's Millet Dumplings",
    "jp_name": "桃太郎印のきびだんごMomotarō Jirushi no Kibidango",
    "description": "It was used to tame a beast. Once it got rotten, it will lose its effect.",
    "appears_in": [
      "Nobita's Dinosaur",
      "Nobita and the Haunts of Evil",
      "Nobita's Dinosaur 2006",
      "The New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Nobita and the Island of Miracles ~Animal Adventure~",
      "The Time Machine Disappeared!!",
      "Nobita Meets the Masked Queen",
      "I'm Mini Doraemon",
      "Doraemon: New Nobita's Great Demon ~Peko and the Exploration Party of 5~"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/d/d4/Momotaro_Training_Dango_2005_anime.PNG/revision/latest/scale-to-width-down/350?cb=20151020053737\u0026path-prefix=en"
  },
  {
    "eng_name": "Moodmaker Orchestra",
    "jp_name": "ムードもりあげ楽団",
    "description": "By playing their instrument, they can change one's mood.",
    "appears_in": [
      "The Debut of the Mood-Changing Orchestra!",
      "Doraemon: Nobita in the Robot Kingdom",
      "Doraemon: Nobita's Secret Gadget Museum",
      "Nobita's Space Heroes"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/6/63/Moodmaker_Orchestra.png/revision/latest/scale-to-width-down/350?cb=20140905101628\u0026path-prefix=en"
  },
  {
    "eng_name": "Moses Stick",
    "jp_name": "モーゼステッキ Mōzesutekki",
    "description": "It looks like a stick of an old man and is brown in color. It has some buttons on it too. It is also a very long stick. \nIt can split the water into two even seas. If the gadget turned off or out of baterry, the water returns to the original.",
    "appears_in": [
      "Nobita and the Winged Braves",
      "The Moses Stick",
      "wikipedia:Moses",
      "wikipedia:Red Sea"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/d/d1/Moses_Stick.PNG/revision/latest/scale-to-width-down/350?cb=20160406033219\u0026path-prefix=en"
  },
  {
    "eng_name": "Mother Robot: The Substitute Mother Egg",
    "jp_name": "ハハオヤロボット:  オフクローのたまごHahaoyarobotto: Ofukurō no tama go",
    "description": "Hahaoyarobotto: Ofukurō no tama goSubstitute Mother Egg (オフクローのたまご) is a Doraemon's gadget.\nUpon activation, it shatters and generates a prosthetic, anthropomorphic mechanical female owl after several seconds. Once the owl hatches, she recognizes the first living thing as her target and become a caretaker for the subject. She functions for 8 hours, after which she returns to her dormant state in the shell",
    "appears_in": [
      "But Doraemon Wants a Mom"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/ad/Mother_Robot_The_Substitute_Mother_Egg.png/revision/latest/scale-to-width-down/350?cb=20150926031301\u0026path-prefix=en"
  },
  {
    "eng_name": "N-S Crest",
    "jp_name": "エヌ・エス ワッペン",
    "description": "The N (North) badge is red in color and the S (South) badge in blue in color, representing the two different colors of a magnet. \nWhen two persons wears the same Crest (either N or S), they will repel each other, just like how magnets works. While if one person wears the N Crest while the other wears the S Crest, they'll be attracted to each other. Simply put, the Crest itself cause the person to become a magnetic pole themselves (theoretically speaking).",
    "appears_in": [
      "Chapter 28:N-S Crest",
      "N-S Badges",
      "Shizuka's Present is Nobita",
      "Nobita and the New Steel Troops ~Angel Wings~"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/6/61/Huy_hi%E1%BB%87u_nam_ch%C3%A2m_N-S.jpg/revision/latest?cb=20150215102359\u0026path-prefix=en"
  },
  {
    "eng_name": "Nature Plastic Model Series (gadget)",
    "jp_name": "自然観察プラモシリーズナンバーワン \"Shizen kansatsu puramoshirīzu nanbā wan\"停止液",
    "description": "The Nature Plastic Model Series (Nature Observation Plastic Model Series) are a series of gadgets that are used for natural observations. Animals that can lay eggs, such as birds and fish, are the types of plastic models available. Four such plastic models are featured in the episode of the same name.\nEach plastic model comes with a pedestal and two halves of an egg shell. One has to set up the pedestal and place the egg shell on the pedestal for the growth process to occur. Once the plastic model reaches its end of the growth process, it disappears back to the two halves of the egg shell.\nAlternatively, the user can choose to let the plastic model remain at any stage of the growth process by using a Stop Spray on the plastic model. This way, the plastic model will not disappear into the half-eggs and remain at that stage.",
    "appears_in": [
      "Nature Plastic Model Series"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/f/fe/34.jpg/revision/latest?cb=20170514133556\u0026path-prefix=en"
  },
  {
    "eng_name": "Nekojararin",
    "jp_name": "ネコジャラ林 Nekojararin",
    "description": "By waving this bell you can attract all the cats around you.",
    "appears_in": [
      "Crazy Stomach Clock"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/02/Nekojararin.png/revision/latest/scale-to-width-down/350?cb=20170611212144\u0026path-prefix=en"
  },
  {
    "eng_name": "Nendoron",
    "jp_name": "ネンドロン, Nendoron",
    "description": "With this gadget you can deform anything.",
    "appears_in": [
      "Nendoron Riot",
      "Nendoron Riot",
      "Chapter 089:Nendoron",
      "Doraemon: Nobita Drifts in the Universe"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/d/df/Nendoronanime.png/revision/latest/scale-to-width-down/350?cb=20170610052208\u0026path-prefix=en"
  },
  {
    "eng_name": "Night Lamp",
    "jp_name": "夜ランプ Yoruranpu",
    "description": "The function is very simple, This night lamp can change a bright side into dark side by installing it. In the end of episode \"I Will sell the night\" Doraemon has a day lamp it can change a dark side into a bright side.",
    "appears_in": [
      "I Will Sell the Night"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/d/dc/Night_lamp.png/revision/latest/scale-to-width-down/350?cb=20240904103825\u0026path-prefix=en"
  },
  {
    "eng_name": "Nose Balloons (gadget)",
    "jp_name": "はなバルーン Hana barūn",
    "description": "Turn the dial to select the desired color, insert the tip into your nose and blow in, then breathe in your nose, and you will make a balloon of the selected color from your nostrils.",
    "appears_in": [
      "Nose Balloons/1979 Anime",
      "Nose Balloons/2005 Anime",
      "Shizuka"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/53/Nose_Balloons.PNG/revision/latest/scale-to-width-down/350?cb=20160309124923\u0026path-prefix=en"
  },
  {
    "eng_name": "Nurse-to-Death Stick",
    "jp_name": "General InformationFunctionsDetails",
    "description": "The gadget is shaped like a horsetail. There is a red button which when pressed, emits a light that makes anyone the user's servant.\nWhen the user presses the red button, the person(s) who is exposed to the light will want to serve the user no matter what.",
    "appears_in": [
      "I'll Use the Nurse-to-Death Stick on You",
      "Nobita Nobi",
      "Doraemon",
      "Takeshi Gouda",
      "Suneo Honekawa",
      "Shizuka Minamoto"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/9d/Nurse-to-Death_Stick.PNG/revision/latest/scale-to-width-down/350?cb=20200926030035\u0026path-prefix=en"
  },
  {
    "eng_name": "Obtaining Bag",
    "jp_name": "取り寄せバッグ (とりよせバッグ) Toriyose Baggu",
    "description": "Doraemon trying to get Shizuka from the bag.Think of a item and the user will be able to get it from the purse such as the Anywhere Door and food.\nThe items pulled out from it can 'distort' similar to how Doraemon pull out most large gadget from the 3D Pocket. Thus, it may be used to take a plethora of item with wide range of sizes.\nHowever, is something doesn't exist or not allowed to get, the gadget electrifies the user. In a episode, Doraemon tries to get Shizuka through the bag but fails because Shizuka is taking a bath at that time.",
    "appears_in": [
      "Doraemon: Nobita and the Castle of the Undersea Devil",
      "Nobita and the Fantastic Three Musketeers",
      "Nobita and the Wind Wizard",
      "Stand by Me Doraemon",
      "I've Got a Spare Fourth Dimensional Pocket",
      "The Suneo Kidnapping Case",
      "Nobita's Long Day",
      "Doraemon: Nobita's Great Adventure in the Antarctic Kachi Kochi",
      "Doraemon Is An Exam Student Now!?",
      "Stand by Me Doraemon",
      "Doraemon Gadget Rush"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/0b/Purse_Gadget.png/revision/latest/scale-to-width-down/350?cb=20150906063050\u0026path-prefix=en"
  },
  {
    "eng_name": "Odd Umbrellas",
    "jp_name": "人さがしかさ Hitosagashi Kasa祝傘 Iwai Kasa愛傘 Ai Kasaマラソン傘 Marason Kasaお化け傘 Obake Kasaコウモリ傘 Kōmori Kasa嵐傘 Arashi Kasaあいあいパラソル Aiai Parasoru",
    "description": "The Odd Umbrellas (おかしな傘 Okasina Kasa) is a set of gadget umbrellas belonging to Doraemon.\n\n\nNobisuke called to tell Tamako that Nobita is not at the train station, so she sends Doraemon to look for Nobita. He takes out the umbrella, which tells him where Nobita is by pointing to his direction. Nobita and Doraemon continue to use it during the rain.\n\n\nWhen opened, the umbrella acts as a party popper which fully covers the user in streamers.\n\n\nThe Rotation Umbrella is an umbrella used for babies.\nWhen opened, baby objects come out of the umbrella and rotates in a clockwise direction. Several commuters coming in and out of the train station can be seen to admire Nobisuke's umbrella when he uses it in the 2005 anime.\n\n\nThe Muscle Umbrella is an umbrella used to train the body to have strong muscles.\nDue to its heavy weight, Nobisuke struggles and ends up injured using it.\n\n\nThe Love Umbrella (愛傘 Ai Kasa) is an umbrella introduced in the 2005 anime used to create holograms of ideal girlfriends.\nFor a start, the umbrella creates a hologram when opened. The umbrella has a turning button that creates new holograms that surround him, so the user could have as many ideal girlfriends as he wish. Nobita creates six of them, and caused Shizuka, who is on her way to violin class, to have a mistaken impression.\n\n\nThe Marathon Umbrella (マラソン傘 Marason Kasa) is an umbrella used to run a marathon.\nIt is introduced only in the 2005 anime; when held, it sends the user running without stopping, and the user would not feel tired at all. Currently, it could only be stopped when the user lets it go.\n\n\nThe Ghost Umbrella (お化け傘 Obake Kasa) is an umbrella introduced in the 2005 anime used to summon ghost (monsters).\nGian demands Doraemon to take out a similar umbrella Nobisuke is using. He takes this out, and to Gian's horror, monsters appear when it is opened, sending him running away.\n\n\nThe Bat Umbrella (コウモリ傘 Kōmori Kasa) is an umbrella used to fly.\nThis umbrella takes the user to where he wishes to go. In the 1979 anime, Nobisuke used at the train station, whereas in the 2005 anime, he used it after he used the Marathon Umbrella. Sending him flying, he ends up on top of a tree and loses the umbrella.\n\n\nThe Parachute Umbrella is an umbrella that is similar to a parachute. It can land someone, who is trapped in the air, back to safety.\n\n\nThe Storm Umbrella (嵐傘 Arashi Kasa) is an umbrella used to create a thunderstorm. It has no protection against the rain, and leaves the user exposed to it.\nDue to its resemblance with Nobita's umbrella, Doraemon ends up lending Nobisuke the Storm Umbrella by accident. Annoyed, Nobisuke chases after Nobita and Doraemon.\n\nMain article: Emotional Umbrella\nThe Emotional Umbrella (あいあいパラソル Aiai Parasoru) is a umbrella used to make person in the right side of umbrella will fall in love on the person in the left side.",
    "appears_in": [
      "The Odd, Odd Umbrellas",
      "The Odd, Odd Umbrellas",
      "The Odd, Odd Umbrellas",
      "The Odd, Odd Umbrellas",
      "The Odd, Odd Umbrellas",
      "The Odd, Odd Umbrellas",
      "The Odd, Odd Umbrellas",
      "The Odd, Odd Umbrellas",
      "The Odd, Odd Umbrellas",
      "The Odd, Odd Umbrellas",
      "The Love-Love Parasol",
      "Doraemon (2005 anime)"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/c5/Payung_1.PNG/revision/latest/scale-to-width-down/350?cb=20151009035307\u0026path-prefix=en"
  },
  {
    "eng_name": "Out With The Demons Beans",
    "jp_name": "鬼は外ビーンス",
    "description": "The beans are used to transfer things and people (usually undesired) from one place to another. For example, if someone puts a rubber into a bottle, the user can’t the rubber out. An \"Out With The Demons\" bean, however, can be used to extract the rubber from the bottle. Simply saying \"Out with the Demons!\" whilst throwing the bean at the target will have the object or person moved to another location (in this case, the rubber would end up immediately outside the bottle).",
    "appears_in": [
      "The \"Out with the Demons\" Beans",
      "Doraemon: Nobita's Secret Gadget Museum",
      "Nobita's Great Adventure into the Underworld"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/34/Demon_Out.jpg/revision/latest/scale-to-width-down/350?cb=20151012112723\u0026path-prefix=en"
  },
  {
    "eng_name": "Overseas Ryococchi",
    "jp_name": "海外リョコッキ \"Kaigai Ryokokki\"",
    "description": "With this gadget, you can feel what it's like to go to that country in your area. Equipped with a expert world tour guide, it will ready to guide you to go to a country you choose it. If you want to raise the taste, people around you will start talking language according to the country you choose, and the area around you will turn into that country place. The effect canceled if you remove this gadget.",
    "appears_in": [
      "Travelling abroad to Paris!"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/16/Overseas_ryococchi.jpeg/revision/latest/scale-to-width-down/350?cb=20240910042913\u0026path-prefix=en"
  },
  {
    "eng_name": "Pass Loop",
    "jp_name": "通り抜けフープ Tōrinuke Fūpu",
    "description": "The Pass Loop can be placed on a wall and it will function akin to a miniature portal.\nPortable Holes",
    "appears_in": [
      "Gian Makes an Appearance on TV",
      "Kaito Nobita Calling On!",
      "Nobita and the Haunts of Evil",
      "The New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Stand by Me Doraemon",
      "Battle! Cat-Model Robots VS Dog-Model Robots",
      "Nobita and the Birth of Japan 2016",
      "The Nobi House Turns Into a Giant Maze!?",
      "Nobita Nobi",
      "Doraemon (character)",
      "Doraemon: New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Doraemon Wii: Secret Tool King Tournament",
      "Doraemon: Story of Seasons",
      "Dokodemo Door",
      "Magic Zip (gadget)",
      "Torinuke Fūpu (minigame)",
      "Torinuke Fūpu (minigame)"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/e2/Pass_Through_Loop.jpg/revision/latest/scale-to-width-down/350?cb=20190630142242\u0026path-prefix=en"
  },
  {
    "eng_name": "Path-Finding Stick",
    "jp_name": "ミチサキステッキ",
    "description": "When confused in the cross section, erect the stick and follow whichever side it falls on.\nThe Path-Finding Stick problem is that it can’t detect dangerous things like a bomb.",
    "appears_in": [
      "Move Fast, Doraemon! The Galactic Grandprix",
      "Nobita and the Birth of Japan",
      "Nobita and the Birth of Japan"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/a4/Path-Finding.jpg/revision/latest/scale-to-width-down/350?cb=20150310111426\u0026path-prefix=en"
  },
  {
    "eng_name": "Pearl Producing Oyster Case",
    "jp_name": "しんじゅ製造アコヤケース Shinju Seizō Akoya Kēsu",
    "description": "It used to produce pearl when placed in the water.\nShinju seizō akoyakēsu made up of word Shinju (Pearl), Seizō (Production), Akoya (meaning Akoya pearl oyster), and Kēsu (Case).",
    "appears_in": [
      "The Pearl Producing Oyster Case",
      "Shizuka's Necklace"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/6/62/Pearl_Oyster_Case.PNG/revision/latest/scale-to-width-down/350?cb=20160531052256\u0026path-prefix=en"
  },
  {
    "eng_name": "Pebble Hat",
    "jp_name": "石乙ろぼうし Ishikoro Boushi",
    "description": "The person who is wearing the hat will be treated like a pebble; unnoticed.",
    "appears_in": [
      "Chapter 68: Pebble Hat",
      "Battle! Cat-Model Robots VS Dog-Model Robots",
      "Doraemon: Nobita's Great Adventure into the Underworld",
      "Doraemon: Nobita's Little Star Wars 2021"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/8/81/Pebble_Hat3.PNG/revision/latest/scale-to-width-down/350?cb=20151016092622\u0026path-prefix=en"
  },
  {
    "eng_name": "Peko Peko Grasshopper",
    "jp_name": "ペコペコバッタ Peko Peko Batta",
    "description": "The Peko Peko Grasshopper will jump into a person's nose to the point of where the target will eventually cry and beg for forgiveness. It may also cause them to be extremely repentful, wishing to forget their past sins and wrongs.\nThe Peko Peko Grasshopper may be distracted out by forcing the host person sneeze it out (generally with Black Pepper).",
    "appears_in": [
      "Chapter 7:Peko Peko Grasshopper",
      "The Bow-Bow Grasshopper"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/6/61/Bowbowg.jpg/revision/latest?cb=20150512114131\u0026path-prefix=en"
  },
  {
    "eng_name": "Pet Cream (gadget)",
    "jp_name": "ペットクリーム",
    "description": "Apply it on a rock and then wipe it. After that, it will act like a dog and perform behaviors such as barking. Its diet is composed up of sand and water. The harder you wipe it onto a rock, the gentler the pet would be.",
    "appears_in": [
      "The Cute Rock Story"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/d/d9/Pet_Cream.png/revision/latest/scale-to-width-down/350?cb=20140906123648\u0026path-prefix=en"
  },
  {
    "eng_name": "Picture Book Entry Shoes",
    "jp_name": "絵本入りこみぐつ Ehon Hairikomi Gutsu",
    "description": "With the shoes, a person can enter the world inside a story book. But the user must not interfere with characters or objects inside the story or else the story will end up differently.",
    "appears_in": [
      "A Happy Mermaid Princess",
      "Barging Into Jaiko's Comic Books",
      "Nobita's Dorabian Nights"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/5e/Picture_Book_Entry_Shoes_2005_anime.PNG/revision/latest/scale-to-width-down/350?cb=20151019054408\u0026path-prefix=en"
  },
  {
    "eng_name": "Popcorn Hat",
    "jp_name": "ポップコーン ハット",
    "description": "This gadget turns people's anger into heat energy to cook popcorn. When someone is angry, the user can use this hat and put it on whoever is angry. The person's anger will transfer to heat and the hat will pop out popcorn, also causing the person to calm down. Different people's anger makes different flavored popcorn which depends on how often their anger is or based on their own cooking skills such as Gian. Nobita, Suneo's popcorn tastes normal, Nobita's mother's popcorn is pretty spicy, Gian's popcorn tastes like his own stew and other things he cooked, which taste awful, and Kaminari's popcorn is arguably the best popcorn tasted.\nBut if the wearer is angered to the limit, their anger would build up and end up producing a lot a popcorn. But unfortunately, every piece would be burnt to a crisp.\nInterestingly, a different flavor is made on every alternate use in the episode Anger Popcorn.\nShizuka is the only character whose flavour is unknown.",
    "appears_in": [
      "Anger Popcorn"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/15/Popcornhat.png/revision/latest/scale-to-width-down/350?cb=20150508054035\u0026path-prefix=en"
  },
  {
    "eng_name": "Pre-reply Post",
    "jp_name": "返事先取りポスト \"Henji sakidori posuto\"",
    "description": "Write a letter to the person you want to address. You can write any type of letter such as a love letter. After that, put the letter you have written into this post box, You will immediately receive a reply to the person you sent the letter without having to be accepted by that person. \nRemember!. You have to write the compleate address you want to go to, and it must be accompanied by stamp, so that the letter can be received and immediately get recive a reply. Whether a letter is answered or not depends on the person you are writing to.",
    "appears_in": [
      "How to Get a Reply to a Letter You Haven't Sent",
      "To Miss Yumeko Nijitani"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/e3/Pre_reply_post.jpeg/revision/latest/scale-to-width-down/350?cb=20240912135704\u0026path-prefix=en"
  },
  {
    "eng_name": "Pretty People Camera",
    "jp_name": "めんくいカメラMen kui kamera",
    "description": "The device is a camera decorated with roses and an eye. This camera likes beautiful, pretty and cute faces; but hates faces that are considered ugly or funny, which it removes from the developed photos.\nThis gadget also have a self-sense.",
    "appears_in": [
      "Chapter 141:Pretty People Camera",
      "Pretty People Camera/1979 Anime",
      "Pretty People Camera/2005 Anime"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/0d/20190928_081025.jpg/revision/latest/scale-to-width-down/350?cb=20190928071334\u0026path-prefix=en"
  },
  {
    "eng_name": "Puzzle Bank",
    "jp_name": "パズル貯金箱 Pazuru Chokin-bako",
    "description": "This gadget is like a piggy bank made up of labyrinthine building block puzzle pieces of various shapes and colors. It has a slot at the top of it's face.",
    "appears_in": [
      "The Human Piggy Bank",
      "Doraemon",
      "Hypnosis Bank",
      "Guard Dog Bank"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/44/Puzlebank.png/revision/latest/scale-to-width-down/350?cb=20140318004743\u0026path-prefix=en"
  },
  {
    "eng_name": "Questionputer",
    "jp_name": "アンケーター Ankētā",
    "description": "It is pink in color and has some buttons on it with a big blue screen at the top. \nThis gadget is used to give some questions to someone using his/her DNA.\nThis is the gadget that was used to know what Shizuka really wanted for her birthday as a gift. Doraemon and Nobita found out that she wanted Sweet Potatoes as a gift on her birthday with the help of this gadget. They plucked one of her hair strands to get her DNA so they could activate this gadget.",
    "appears_in": [
      "The Secret of Shizuka-chan's Heart",
      "Suneo's in Love",
      "Suneo's Luxuriously Poor Birthday!"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/f/f8/Questionputer.PNG/revision/latest/scale-to-width-down/350?cb=20160319061814\u0026path-prefix=en"
  },
  {
    "eng_name": "Rain Man Or Sunny Man Meter",
    "jp_name": "雨男晴れ男メーター \"Ameotoko hareotoko mētā\"",
    "description": "This meter allow you to check that person is a rain man (Ameotoko), or a sunny man (Hareotoko). Not only for a man, this gadget work to a woman like Shizuka-chan.",
    "appears_in": [
      "It's Tough To Be a Rain Man"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/cf/Rain_or_sunny_man_meter.jpeg/revision/latest/scale-to-width-down/350?cb=20240817093926\u0026path-prefix=en"
  },
  {
    "eng_name": "Real 3D Glasses",
    "jp_name": "ほんもの３Ｄメガネ",
    "description": "When wearing it while watching, all of the objects and people there will emerge out of the TV like a 3D dimensional image but if anyone touch the image the real vesion of it will go out of the TV and become real.",
    "appears_in": [
      "A Real 3D TV"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/b5/3dglasses.jpg/revision/latest?cb=20150824092830\u0026path-prefix=en"
  },
  {
    "eng_name": "Replicotco",
    "jp_name": "レプリコッコ Repurikokko",
    "description": "First you must scan any object you want it. then there will be eggs that come out from this gadget, after that break the egg with using a hamer and Ta-da. You got a replica or miniature of that object.",
    "appears_in": [
      "Replicotco Fireworks"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/77/Replicotco.png/revision/latest/scale-to-width-down/350?cb=20240827114223\u0026path-prefix=en"
  },
  {
    "eng_name": "Resignation Carrot",
    "jp_name": "辞ニンジン Jininjin",
    "description": "This gadget is used to make someone resign from his/her position.\nPeople who resign because eating this gadget :",
    "appears_in": [
      "Gian",
      "Tamako Nobi",
      "Doraemon",
      "Sensei",
      "Suneo",
      "Kaminari"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/15/Resignation_Carrot.PNG/revision/latest/scale-to-width-down/350?cb=20160319063342\u0026path-prefix=en"
  },
  {
    "eng_name": "Resolution Door",
    "jp_name": "エイコーノトビラ Eikōno Tobira",
    "description": "First a user must tell what problems he/she want to solve and then he/she will go inside the door. To solve his/her issue, an instructor who resides inside the door will give him/her difficult tasks to reach his/her goal. The time inside the door is slower than the real world. The user cannot go back to the real world unless he/she reaches his/her main goal. But there are a few exceptions though. If the instructor is unable to withstand whatever makes him feel weak or sick or something else, then the user will be kicked out instantly and not permitted to return.",
    "appears_in": [
      "The Resolution Door"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/40/Resolution_Door.PNG/revision/latest/scale-to-width-down/350?cb=20150926025326\u0026path-prefix=en"
  },
  {
    "eng_name": "Restoration Light",
    "jp_name": "もどりライト Modori Raito",
    "description": "Similar to a torch, when it is pointed to some object, the object that the user points to will be transformed back to its original materials or ingredients. For example, if pointed at a dorayaki, the light will make the dorayaki transform back to ingredients like flour,red bean paste and egg.",
    "appears_in": [
      "The Restoration Light"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/e4/RL.jpg/revision/latest/scale-to-width-down/350?cb=20150330101653\u0026path-prefix=en"
  },
  {
    "eng_name": "Restoring Beam",
    "jp_name": "復元光線 Fukugen Kōsen",
    "description": "This gadget can be used to repair the defective goods into reusable.\nThe gadget can restore or do an action as Doraemon demonstrated in Doraemon Came Out! when the gadget did Nobita's homework for him. In Weakness Grasping/(Secret) Spy Operation, it was used to restore Nobita's broken vase.",
    "appears_in": [
      "Chapter 4:Operation: Secret SPY",
      "Doraemon Came Out!",
      "Weakness Grasping",
      "(Secret) Spy Operation",
      "Nobita Express and the Mystery of the Train Hunter",
      "Doraemon Repair Shop"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/ce/Recovery_Light.PNG/revision/latest/scale-to-width-down/350?cb=20151013031740\u0026path-prefix=en"
  },
  {
    "eng_name": "Reverse Boat",
    "jp_name": "さかのぼりボート Sakanobori Bōto",
    "description": "The boat can move in the opposite direction of the flow of water.",
    "appears_in": [
      "Nobita and the Haunts of Evil",
      "The New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Doraemon: New Nobita's Great Demon ~Peko and the Exploration Party of 5~"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/8/8a/Reversing_Boat.PNG/revision/latest/scale-to-width-down/350?cb=20151018083500\u0026path-prefix=en"
  },
  {
    "eng_name": "Reverse Cloak",
    "jp_name": "ひらりマント Hirarimanto",
    "description": "It used to reverse an attack to backfire/bounce back to the attacker by waving it in front of things coming up.",
    "appears_in": [
      "Nobita's Dinosaur",
      "The Records of Nobita: Spaceblazer",
      "The New Record of Nobita: Spaceblazer",
      "Nobita and the Haunts of Evil",
      "Nobita's Monstrous Underwater Castle",
      "Nobita's Great Adventure into the Underworld",
      "Nobita's New Great Adventure into the Underworld – The Seven Magic Users",
      "Nobita and the Steel Troops",
      "Nobita and the New Steel Troops ~Angel Wings~",
      "Nobita and the Knights of Dinosaurs",
      "Nobita and the Birth of Japan",
      "Nobita's Adventure: Drifts in the Universe",
      "Nobita and the Winged Braves",
      "Nobita's Great Battle of the Mermaid King",
      "Nobita's Space Heroes",
      "Nobita and the Birth of Japan 2016"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/e2/%E3%81%B2%E3%82%89%E3%82%8A%E3%83%9E%E3%83%B3%E3%83%88.jpg/revision/latest/scale-to-width-down/350?cb=20160326002233\u0026path-prefix=en"
  },
  {
    "eng_name": "Rival-Making Steak",
    "jp_name": "しゅくテキ Shuku teki",
    "description": "If person ate it, he/she will be swelling up and overflowing with competitive spirit.",
    "appears_in": [
      "The Mom vs. Rich Mother Battle"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/a1/Rival-Making_Steak.PNG/revision/latest/scale-to-width-down/350?cb=20160316122541\u0026path-prefix=en"
  },
  {
    "eng_name": "Roboko",
    "jp_name": "ロボ子 Robokoユリ子 Yuriko (1973 anime)General informationCasual informationRelationshipsOther DetailsGallery",
    "description": "Roboko (ロボ子 Robo-ko) or Yuriko (ユリ子 Yuri-ko - 1973 only), also known as Robyn in the English Amazon Kindle translation, is a gadget and character brought by Doraemon from the 22nd century.\nYuriko is a robot girl with the appearance of a 10-12 years old girl. She has fair skin, blue eyes and red hair in a yellow bow. She wears a blue dress and boots.\nRoboko is a robot girl with the appearance of a 10-12 years old girl. She has fair skin, black eyes and black hair with short trims and bangs with a red ribbon. She wears a pink dress and white boots.\nRoboko is a robot girl with the appearance of a 10-12 years old girl. She has fair skin, black eyes and pink hair with short trims and bangs with a red ribbon. She wears a pink dress and white boots.\nRoboko is a robot girl with the appearance of a 10-12 years old girl. She has fair skin, brilliant grayish green eyes, green hair with short trims and bangs with a red ribbon. She wears a yellow dress with a pair of red boots.\nThe red ribbon is a switch that can activate/shut down the whole machine.\nAs specified by Doraemon, Roboko is supposed to be a friendly robot and also a bodyguard, while the target can be manually specified. However, she often becomes jealous when her target gets drawn away by anything else. She does not display aggression to other robots such as Doraemon.\nRoboko is one of the \"Secret Base Items\" in the game. It can be crafted by collecting からクリナッツ(Chestnut), ?がたコンピューター(? Computer) and ナゾの?かい (? or Mystery).",
    "appears_in": [
      "Chapter 018:I Love Roboko"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/09/Roboko_Opening.jpg/revision/latest/scale-to-width-down/350?cb=20140430125755\u0026path-prefix=en"
  },
  {
    "eng_name": "Robotter",
    "jp_name": "General InformationFunctions",
    "description": "(ロボター)The Robotter is one of Doraemon's gadgets that appears in Moai Statues of Easter Island and its manga counterpart.\nThis gadget is a yellow canister with a removable lid that houses multiple pink small spheres.\nThe function of this gadget is to give non-human creatures, human thoughts, feelings, actions, and sometimes even speaking.",
    "appears_in": [
      "Doraemon: Nobita's New Great Adventure into the Underworld ~The 7 Magic Users~",
      "Doraemon: Nobita's Little Star Wars 2021"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/32/Screenshot_2020-06-06_at_7.19.09_AM.png/revision/latest/scale-to-width-down/350?cb=20200606113151\u0026path-prefix=en"
  },
  {
    "eng_name": "Rocky Head",
    "jp_name": "石頭 Ishiatama",
    "description": "Rocky Head or Stone Head (石頭 Ishiatama) is one of Doraemon's body parts and sort of a gadget.\nDoraemon's head is so heavy that it can destroy everything hard. Despite its indestructibility, Doraemon is still able to feel the pain in his head.",
    "appears_in": [
      "Nobita and the Island of Miracles ~Animal Adventure~",
      "Nobita's Space Heroes",
      "Battle! Cat-Model Robots VS Dog-Model Robots",
      "Nobita's Treasure Island",
      "Dinosaur Hunting"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/96/Rocky_Head.PNG/revision/latest/scale-to-width-down/350?cb=20151011100540\u0026path-prefix=en"
  },
  {
    "eng_name": "Room Guard Set",
    "jp_name": "ルームガードセット Rūmugādosetto",
    "description": "The contents of a set are as follows:\nOnce used, the gadget will lock up the room, with the doorway set with \"Password Identification Lock\" being the only entrance following the password's declaration. Once in the room, the user can exit through the other entrance(s) such as windows, but can only re-enter through the doorway with \"Password Identification Lock\". Other gadgets such as \"Pass Loop\" cannot be used to enter the room, as the gadget nullifies their effect.\nIn addition, according to Doraemon in Nobita's Fried Shrimp, the gadget runs on batteries and thus will cease to function once the batteries have expired, allowing the person(s) that doesn't know the password to safely enter the room.",
    "appears_in": [
      "Chapter 21: Set The Room Guard",
      "Set The Room Guard",
      "Set The Room Guard/2005 Anime",
      "Nobita's Fried Shrimp"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/51/Room_Guard_Set.PNG/revision/latest/scale-to-width-down/350?cb=20160224110254\u0026path-prefix=en"
  },
  {
    "eng_name": "Rubber Hand",
    "jp_name": "ペタリハンド Petari hando",
    "description": "Rubber Hand or Suction Hand (ペタリハンド Petari hando) is one of Doraemon's body parts and sort of a gadget.\nIt can stick onto anything without fingers, allowing to pull things, climb up walls and ceilings.",
    "appears_in": [
      "Battle! Cat-Model Robots VS Dog-Model Robots"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/e2/Rubber_Hand.PNG/revision/latest/scale-to-width-down/350?cb=20160601011536\u0026path-prefix=en"
  },
  {
    "eng_name": "Sampling Spoon",
    "jp_name": "味見スプーン Ajimi Supūn",
    "description": "Using the gadget, the user can taste samples of several foods from the magazines, books or pictures. It is very convenient since the user does not have to go very far or spend money just to taste the food. However, the spoon can only be used one time per picture, so if the user wants to taste it again, he/she will need another spoon.",
    "appears_in": [
      "The Sampling Spoon"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/eb/Sampling_Spoon.jpg/revision/latest?cb=20151217063658\u0026path-prefix=en"
  },
  {
    "eng_name": "Scheduler Clock (gadget)",
    "jp_name": "General InformationFunctionsDetails",
    "description": "In the 1979 adaptation of the anime, the Scheduler Clock has an orange exterior with black spade-like hands used to prick the user if not abiding to the schedule set.\nIn the 2006 adaptation, the clock has a red exterior with a yellow slot and blue hands.\nThe Scheduler Clock is used to plan events of any kind. Once a schedule paper/timetable is inserted in the gadget, it keeps the time that the user does a particular event. However, it is hasty; it forces the user to do the event it planned with the gadget even in bad weather (e.g. in the rain), unsuitable conditions, or even if the task itself is already done. Moreover, the gadget treats the person who inserts the schedule paper/timetable in as the user, so the non-user has to be careful to not putting in the paper under any circumstance.\nThe following is Doraemon's schedule that was intended for Nobita:",
    "appears_in": [
      "Chapter 39:Scheduler Clock",
      "The Schedule Clock",
      "Doraemon (2005 anime)"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/6/68/Scheduler_Clock.png/revision/latest?cb=20140505091114\u0026path-prefix=en"
  },
  {
    "eng_name": "Scoop As You Seen",
    "jp_name": "見たままスコープ \"Mitama masukōpu\"",
    "description": "This gadget can help you remember events or footsteps you took by attaching this object to your head. All the scene you saw with your eyes are dug up from the depths of your brain's memories and will be projected on a screen. Then set the time for the event and you will see again what events you have done that day projected on the screen.",
    "appears_in": [
      "Special Vision Report"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/a2/The_scoop_as_you_seen.png/revision/latest/scale-to-width-down/350?cb=20241002081901\u0026path-prefix=en"
  },
  {
    "eng_name": "Shadow-Cutting Scissors",
    "jp_name": "かげきりばさみ",
    "description": "The Shadow Cutting Scissors can cut a shadow of a person if the shadow's figure is completely visible. Thus, the person whom shadow is about to be cut should stand on a place with good lighting. After the shadow is detached from the person, it will become somewhat 3-dimensional, and animated. The person's shadow is unable to speak, yet docile and obedient in the first 30 minutes. But if the shadow is still around exceeds 30 minutes, it will become smarter, and its blackness will start transforming it into its person. The person is instead, starts to become darker, and more 'shadow-like'. Despite it starting to become more like their person, they are still light-weight, have malleable bodies and incredible naughtiness. The person and the shadow will be switched each other in two hours. The shadow should be immediately bind to the person back using the Shadow Binding Glue. Because a shadow is virtually not physical, one should catch them with the Shadow Capturing Mochi\". A person's shadow cut by the Shadow Cutting Scissors has similar personalities with their person. For example, Shadow Nobita is scared of Tamako Nobi's shadow.\nAnime\nManga",
    "appears_in": [
      "Borrowing in the Shade",
      "Doraemon vs. Doraemon",
      "Chapter 9:Hunting Shades",
      "Nobita Nobi",
      "Tamako Nobi",
      "Doraemon"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/55/Shadow_Cutting_Scissors2.png/revision/latest/scale-to-width-down/350?cb=20140905154026\u0026path-prefix=en"
  },
  {
    "eng_name": "Shock Gun",
    "jp_name": "ショックガン Shokku Gan",
    "description": "It is the initial starting weapon in Doraemon for the Famicom.\nIt only stuns an opponent, not killing them.",
    "appears_in": [
      "Nobita and the Haunts of Evil",
      "Nobita and the Steel Troops",
      "Nobita and the Animal Planet",
      "Nobita and the New Steel Troops ~Angel Wings~",
      "The New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Doraemon: New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Suneo Honekawa",
      "Stun Gun Showdown",
      "Nobita Nobi"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/e8/Shock_Gun.JPG/revision/latest?cb=20151006110320\u0026path-prefix=en"
  },
  {
    "eng_name": "Six-sided Camera",
    "jp_name": "六面カメラ Rokumen Kamera",
    "description": "Have a copy of a picture with an object and then picture it with the gadget. After that you can have a 3D view of the object; on back, front, left, right or on top.",
    "appears_in": [
      "Chapter 451:Six-sided Camera",
      "Nobita and the Haunts of Evil",
      "The New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Doraemon: New Nobita's Great Demon ~Peko and the Exploration Party of 5~"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/6/63/Six-sided_Camera.JPG/revision/latest/scale-to-width-down/350?cb=20151013090153\u0026path-prefix=en"
  },
  {
    "eng_name": "Sleep Absorbing Gun",
    "jp_name": "ネムケスイトール \"Nemukesuitōru\"",
    "description": "This pistol can relieve your sleepiness by pumping the body of the gun. Just aim at the person you are aiming at, then a sleep bubble will come out of your nose and be absorbed by this weapon, so you will feel less sleepy.\nThe drowsiness absorbed earlier can be shot at other people. Just fire at the intended target and they will immediately fall asleep for a few moments.",
    "appears_in": [
      "Let the Troublemaker Fall Asleep",
      "Doraemon: Nobita's Earth Symphony"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/f/f9/Sleep_Absorbing_Gun.png/revision/latest/scale-to-width-down/350?cb=20240919120725\u0026path-prefix=en"
  },
  {
    "eng_name": "Slip 'n Slide Gas",
    "jp_name": "スぺルガス",
    "description": "Spray it on someone and the one sprayed on will be able to slide on anything.",
    "appears_in": [
      "Getting Fired Up! Dorami's Crash Course in Figure Skating"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/a1/Silp_%27n_Slide_Gas.png/revision/latest/scale-to-width-down/350?cb=20140905172613\u0026path-prefix=en"
  },
  {
    "eng_name": "Small Light",
    "jp_name": "スモールライト Sumōru Raito",
    "description": "The Small Light shines a light beam that can reduce the size and mass of anything or anybody it touches. \nIt is a green flashlight with a yellow-orange bottom. It has a blue top with four spheres on it, and a glass hemisphere that emits the light beam. It also has two buttons, the red one shrinks the target, while the yellow one serves a reverse setting as it enlarges the target back to normal size.",
    "appears_in": [
      "A Visitor from the Country of the Future/U.S. English dub",
      "Exploring the Earth (Part 2)",
      "Even Though It's Inside the Stomach Acid",
      "Giant Suneo Appears!",
      "Nobita's Small, Small Great Adventure",
      "The Parachute Race",
      "Doraemon: New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Doraemon: Nobita and the New Steel Troops ~Winged Angels~",
      "Doraemon: Nobita's Little Star Wars",
      "Doraemon: Nobita's Dinosaur 2006",
      "Stand by Me Doraemon 2",
      "Doraemon: Nobita's Little Star Wars 2021",
      "Shizuka Minamoto",
      "Dorami",
      "Doraemon in North America",
      "Doraemon (2005 anime)",
      "Doraemon in Turkey",
      "Shrink Ray Skirmish"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/e5/Small_Light.jpg/revision/latest/scale-to-width-down/350?cb=20190630111918\u0026path-prefix=en"
  },
  {
    "eng_name": "Soft Cat Hands (gadget)",
    "jp_name": "ふにゃふニャー \"Fu nya fu nyā\"",
    "description": "Any object touched by this cat's hands will become very soft, squishy, and tender, even as hard as iron and stone can be changed by this gadget, it's very nice if you touch it and be on top of it. If you want to return back to normal, just touch it again with this cat's hand.",
    "appears_in": [
      "Soft Cat Hands"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/49/Soft_cat_hands.jpeg/revision/latest/scale-to-width-down/350?cb=20240917041208\u0026path-prefix=en"
  },
  {
    "eng_name": "Space Glue",
    "jp_name": "空間接着剤 Kūkan Setchaku-zai",
    "description": "The gadget can glue any object or living thing in air or space.",
    "appears_in": [
      "Twinkle, Twinkle Little Comet",
      "Nobita and the Island of Miracles ~Animal Adventure~"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/70/Air_Adhesive_Glue.PNG/revision/latest/scale-to-width-down/350?cb=20151026064617\u0026path-prefix=en"
  },
  {
    "eng_name": "Space-Bending Tape",
    "jp_name": "空間ひんまげテープ Kūkan Hinmage Tēpu",
    "description": "The tape is used to bend the reality of dimension and space. Doraemon used on Nobisuke Nobi's employer to keep him out and agitate him to make him leave. The tape is used onto the front door's knob by sticking it into a loop which has be turned once. The tape causes the door to become a warping space that infinite cause the person who went through from the outside to came out outside again.\nSimply put, it is used to create an entry that becomes an 'exit' and vice versa.",
    "appears_in": [
      "Shizuka-chan and the Grandfather Tree",
      "Nobita's Big River Otter Adventure",
      "Go Home, You Unwanted Guest!"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/2/20/Space-Bending_Tape.PNG/revision/latest/scale-to-width-down/350?cb=20151003094632\u0026path-prefix=en"
  },
  {
    "eng_name": "Specter Cream Set",
    "jp_name": "妖怪クリームセット Yōkai Kurīmu Settoおおかみ男クリーム  Ōkami Otoko Kurīmuドラキュラクリーム Dorakyura Kurīmu雪女クリーム Yuki-onna Kurīmuもどしクリーム Modoshi Kurīmu",
    "description": "This set of gadgets consists of Werewolf Cream, Dracula Cream, Snow Woman Cream, and the Restoring Cream.\n\n\nMain article: Werewolf Cream\nThe Werewolf Cream is cream that can make a person become a werewolf.\n\n\nMain article: Dracula Cream\nThe Dracula Cream is cream can make a person become Dracula.\n\n\nMain article: Snow Woman Cream\nThe Snow Woman Cream is cream can make a person become a snow woman ghost(Yuki-onna).\n\n\nMain article: Restoring Cream\nThe Back-to-Normal Cream or Restoring Cream is cream used to return to normal.",
    "appears_in": [
      "The Werewolf Cream"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/5d/Specter_Cream_Set.PNG/revision/latest/scale-to-width-down/350?cb=20150902134932\u0026path-prefix=en"
  },
  {
    "eng_name": "Spy Set",
    "jp_name": "スパイセット",
    "description": "The whole Spy Set looks like a head of a robot with one eye and a left ear. The 'head' has an antenna, which receives transmissions from the eye and ear. Both eye and ear are detachable, and can levitate around. They are small enough to slip into a person's house. The 'mouth of the head' can be opened and functions as the monitor.",
    "appears_in": [
      "Chapter 4:Operation: Secret SPY",
      "(Secret) Spy Operation"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/e4/Spy_Set.png/revision/latest/scale-to-width-down/350?cb=20140907162739\u0026path-prefix=en"
  },
  {
    "eng_name": "Storybook Shoes",
    "jp_name": "General InformationFunctionsDetails",
    "description": "In the movie, it appears with a regular brown color around and a dark-brown toe cap on it. In the 2005 anime episode, it has a lighter complexion with orange all around, and a light yellow at the toe cap. The anime version also has small tags at the back of each shoe.\nThe size of the shoe in the anime was huge, most likely to fit into Doraemon's feet, as he was the only user of this gadget in it.\nThe wearer of this shoe can jump into any story book and experience its incidents in a realistic manner. The wearer is immune to the elements of the story book, i.e., they cannot drown in water or burn in fire. If taken a look at the pages from outside, the wearer can be seen in the illustrations of the book. This property helped Nobita and Doraemon in the movie, to find out which book Shizuka got stuck in.",
    "appears_in": [
      "Take-copter",
      "Bartering Machine"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/6/65/Storybook_Shoes_%28Movie%29.png/revision/latest/scale-to-width-down/350?cb=20200927053909\u0026path-prefix=en"
  },
  {
    "eng_name": "Straight Hole",
    "jp_name": "ストレートホール Sutorēto Hōru",
    "description": "The gadget's shape is like the Pass Loop but the function is the same as the Anywhere Door.",
    "appears_in": [
      "Shizuka-chan, in an Egg",
      "Stand by Me Doraemon"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/1a/Straight_Hole_Shizuka_2005_anime.png/revision/latest/scale-to-width-down/350?cb=20151222013332\u0026path-prefix=en"
  },
  {
    "eng_name": "String Phone without a String",
    "jp_name": "糸なし糸電話 Ito Nashi Ito Denwa",
    "description": "It can be used to communicate with or hear another person, no matter how far he/she is.",
    "appears_in": [
      "Nobita and the Steel Troops",
      "Nobita and the New Steel Troops ~Angel Wings~",
      "The String Phone Without a String",
      "The Debut of a New Song! Gian's The Greatest!",
      "Pizza Dumplings Shining in the Night Sky"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/b5/String_Phone_without_a_String.PNG/revision/latest/scale-to-width-down/350?cb=20151108051131\u0026path-prefix=en"
  },
  {
    "eng_name": "Substitution Rope",
    "jp_name": "入れかえロープ",
    "description": "if there are two people holds one of the ends of this rope at the same time, their spirits will stay the same, only the bodies will be swapped. However in Stand by Me 2, this gadget has a fatal design flaw, which is that if a person does not return to their original body within 1 hour their memories will be wiped out, along with them passing out. The Substitution Rope was many times used by Doraemon, Nobita and other Tama Friends:",
    "appears_in": [
      "The Substitution Rope Story",
      "Doraemon's Long Day",
      "45 Years Later...",
      "I'm Mari-chan",
      "Stand by Me Doraemon 2",
      "Shinichi Hatori",
      "I'm Mari-chan",
      "Stand by Me Doraemon 2"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/09/Substitution_Rope.PNG/revision/latest/scale-to-width-down/350?cb=20201025184746\u0026path-prefix=en"
  },
  {
    "eng_name": "Substitution Sticker (Gadget)",
    "jp_name": "代用シール Daiyō Shīru",
    "description": "The stickers allow their user to substitute an item for another by writing that object's name on the sticker, and applying the sticker to an item that they want to \"substitute\". The item's use is not limited to just objects, and can also be used on buildings, or even people. If the sticker falls off the effect will end.",
    "appears_in": [
      "Chapter 4: Substitute Stickers"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/49/Substitution_Sticker.jpg/revision/latest/scale-to-width-down/350?cb=20190701020247\u0026path-prefix=en"
  },
  {
    "eng_name": "Super Gloves",
    "jp_name": "スーパー手袋",
    "description": "Super Gloves allow the user to perform various physical activities with increased strength, similar to Superman. The strength is described \"as strong as Hercules\".\nThere is a 1-versus-rivals minigame that hosts this gadget. This mini-game is quite unusual since the soloist has to flee as his opponents hurl rocks at him with the gloves. If a rock touches his body as it falls, the soloist is defeated and the team players win. However, if he manages to escape, the soloist wins.",
    "appears_in": [
      "Chapter 8:Chin Up to the Ancestors",
      "Chapter 50: The Girl from Memory!",
      "A Girl Like White Lily/2005 Anime",
      "The Wishing Star/2005 Anime/Original",
      "Doraemon: Nobita and the Haunts of Evil",
      "Doraemon: Nobita and the New Steel Troops ~Winged Angels~",
      "Doraemon: New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Doraemon: Nobita's Treasure Island"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/f/fe/Super_Gloves.jpg/revision/latest/scale-to-width-down/350?cb=20190701020248\u0026path-prefix=en"
  },
  {
    "eng_name": "Super Gourmet Spice",
    "jp_name": "スーパーグルメスパイス",
    "description": "When this item is applied to a target, it becomes irresistibly delicious to everyone else, prompting their desire to consume it.",
    "appears_in": [
      "Gian, in Love (Part 2)",
      "Gian Stew",
      "Chapter 231:Gian Stew",
      "Doraemon (2005 anime)"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/97/Super_Gourmet_Spice.jpg/revision/latest/scale-to-width-down/350?cb=20190630142248\u0026path-prefix=en"
  },
  {
    "eng_name": "Super Mobile Bath 1010",
    "jp_name": "スーパー移(い)動(どう)風(ぶ)呂(ろ)1010 Sūpā idō furo sentō",
    "description": "Despite its name, the Super Mobile Bath 1010 doesn't offer anything on its own, and must be attached to a bathtub for warp. By pressing the red button, it will display the world map so that the user can choose a country that leads to a place with a beautiful scenery. By pressing the blue button, it returns the user into his/her original place. By pressing the yellow button, it will select a random place and scenery that cannot be stopped unless the user presses the yellow button and the blue button at the same time.",
    "appears_in": [
      "The Super Mobile Bathtub 1010",
      "Jacuzzi Hot Spring"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/9b/Super_Mobile_Bathtub_1010.png/revision/latest/scale-to-width-down/350?cb=20151228042221\u0026path-prefix=en"
  },
  {
    "eng_name": "Take-copter",
    "jp_name": "タケコプター  Take Koputā",
    "description": "The Take-copter is a small yellow colored gadget consisting of horizontally spinning rooters guided by a thin shaft which connects to a wide base. It can easily fit into a normal pocket present in pants or trousers. Sometimes, it consists of a button at the back or on top.\nIn 1973 anime, the Take-copter had a wider and conical base and the middle part seemed like an antennae.\nIn 1979 anime and 2005 anime, it had a semi spherical base and was smaller than the 1973 one.\nIn Stand by Me Doraemon, it had a brown colored suction cap at the base.\nDorami's Take-copter is generally pink colored.\nMini-Doras' Take-copters look exactly same as Doraemon's but they are very small on the basis of size.\n\n\n\n\nThe Take-copter is one of the action gadgets of Doraemon. It allows him to fly around. It uses battery, which recharges when not being used. When it's battery runs out, Doraemon descends slowly yet rather uncontrollably. A player may spam the Y button so that Doraemon may get flight and descends further forward. Unlike in the TV shows, Doraemon cannot use other gadgets whilst flying using the Take-copter and neither he can transform into Nobita, but the player can still summon assist other characters.\nIt is listed under number 32 out of 61 gadgets in the game.\nThe Take-copter is a gadget which changes all of the dice's surfaces to 6 dots.\nThe Take-copter also appears in this game.\nThe Take-copter also appears in this game.\nThe name \"Take-copter\" combines the words take tombo (bamboo dragonfly, the Japanese name for bamboo-copter), and herikoputa, meaning helicopter. It was also used to be called \"heri-tombo\".\nIts Japanese name \"Take-copter\" (タケコプター) is a portmanteau of タケ' [Translation - \"Take\"] (Bamboo) and コプター [Translation - \"Herikoputaa\"] (Helicopter).\nIts English name \"Hopter\" is a portmanteau of Hop and Copter.",
    "appears_in": [
      "Doraemon Came Out!",
      "Doraemon: Nobita's Secret Gadget Museum",
      "Chapter 8: A Grateful Ring",
      "Chapter 9: A Concentration Soap Helmet",
      "Chapter 12: A Complete Restoration Liquid",
      "Chapter 19: Pinch Runner",
      "Chapter 21: Set The Room Guard",
      "Chapter 21: Time Pistol to Eliminate Obstacle",
      "Chapter 8: A Part Time Job For a Yeti",
      "Doraemon Came Out!/1973 Anime",
      "Doraemon's Great Prediction/1979 Anime",
      "Swapping Moms/1979 Anime/Original",
      "The Time Cloth/1979 Anime",
      "Memories of Grandma/1979 Anime: Part 2",
      "The Voice Thickener/1979 Anime",
      "Taking an Arrow to School/1979 Anime",
      "The Dictator Switch/1979 Anime",
      "When Will You Take Boygirl?/Original",
      "The Schedule Clock/1979 Anime",
      "The Odd, Odd Umbrellas/1979 Anime",
      "The Sonic Oscillation Terror Machine/1979 Anime",
      "Doraemon's Surprised All Encyclopedia",
      "The Elephant and the Uncle/1979 Anime",
      "Doraemon's Bell Disappeared",
      "I'm Mari-chan/1979 Anime: Part 2",
      "Creating the Earth/1979 Anime/Original",
      "Esper Suneo/1979 Anime",
      "Doraemon Comes Back",
      "Somersault Food/1979 Anime",
      "Nobita's Underground Country/1979 Anime: Part 2",
      "Let's Make Badges/1979 Anime",
      "The Time Machine Disappeared!!/1979 Anime",
      "The Magic Belly",
      "Let's Assemble a Handmade Robot (Part 1)",
      "Let's Assemble a Handmade Robot (Part 2)",
      "Doraemon vs. Doraemon",
      "Gian's Feeling Down/1979 Anime",
      "I Hate Doraemon!?",
      "Nobita Runs Away From Home for a Lo~ng Time/1979 Anime",
      "Nobita's the Night Before a Wedding/1979 Anime",
      "Magical Girl Shizu-chan/1979 Anime/Original",
      "Chukenper (Episode)/1979 Anime",
      "The Swallow Nobita/1979 Anime",
      "Escape with the Substitution Stickers!/1979 Anime",
      "Reunion! Nobita from 5 Years Ago/1979 Anime",
      "Doraemon, In Love/1979 Anime",
      "The Rabbit Monster in the Mountain",
      "Three Wheeled Airplane",
      "Freeze-Framing Him/1979 Anime",
      "Flying Through the Sky on the Letter \"ワ\"/1979 Anime",
      "Big Trouble! Suneo's Test Result/1979 Anime",
      "The Troublesome Gulliver/1979 Anime",
      "The Jaws of the Open Lot",
      "Set The Room Guard/1979 Anime",
      "Nobita's Son Ran Away From Home/1979 Anime",
      "The Watercycline/1979 Anime",
      "I've Got a Spare Fourth Dimensional Pocket/1979 Anime",
      "Who is the Mask of Academic?/1979 Anime",
      "Nobita's Candid Camera/1979 Anime",
      "The Friend Circle/1979 Anime",
      "Strong Stone/1979 Anime",
      "The Coagulation Light/1979 Anime",
      "Invincible Fort",
      "Suneo's Incredible Fort/1979 Anime",
      "Mind Reading Helmet/1979 Anime",
      "Fourth Dimensional Dust Bin/1979 Anime",
      "Creating the Earth/1979 Anime/Remade",
      "Switching Gun (Episode)/1979 Anime",
      "Soap Helmet/1979 Anime",
      "The Audio Speaker Phone",
      "Dream-scape Chip",
      "Transformation Robot",
      "Pocket Traffic Light",
      "Image Beret",
      "Helping Dumpling",
      "Early English with Doraemon",
      "The Invisible Hand",
      "Free Size Doll Camera/1979 Anime",
      "The Helping Hand Spray/1979 Anime",
      "Don't Cry, Jaiko/1979 Anime",
      "Home-Eco Apron",
      "Country Maker",
      "The Wish Realizing Machine Has Gone Too Far!/1979 Anime",
      "The Head of the Gorgon/1979 Anime/Remade",
      "Multi-Purpose Cleaner/1979 Anime",
      "Escape From The High-Rise Apartment",
      "Diving in the Town",
      "Special Effects Ultra Dora-Man/1979 Anime",
      "Jack, Betty, and Jenny/1979 Anime",
      "Mole-type Speaker",
      "Nature Plastic Model Series/1979 Anime",
      "Look for the Tsuchinoko",
      "The Hamelin Pipe/1979 Anime",
      "Parallel Planet/1979 Anime",
      "Voice Candy (Episode)",
      "When Will You Take Boygirl?/Remade",
      "Gratitude Halo/1979 Anime",
      "Elevator Plate",
      "2112: The Birth of Doraemon",
      "Nobita is a Dictator?!",
      "The Flying Time Cloth",
      "The Seeking Hand",
      "Teleportation Word Game",
      "A Rumor Without Root",
      "I Have a Rival!",
      "Deciding Skill Suit",
      "Full of Nobita",
      "Absorption Paper",
      "Random Disk",
      "Mini-Dora and the Hot Spring Eggs",
      "Slapstick Tooth Decay Fugitive Symbol",
      "Magical Girl Shizu-chan/1979 Anime/Remade",
      "Doraemon Takes a Day Off!!/1979 Anime/Remade",
      "The Dictator Switch/2005 Anime/Original",
      "The Sonic Oscillation Terror Machine/2005 Anime",
      "The Time Cloth/2005 Anime/Original",
      "Top Secret Spy Strategy/2005 Anime",
      "Nobita's Underground Country/2005 Anime",
      "The Odd, Odd Umbrellas/2005 Anime",
      "Cartoonist Jaiko",
      "Doraemon's Great Prediction/2005 Anime",
      "Nobita's Ancestors/2005 Anime",
      "The Head of the Gorgon/2005 Anime/Original",
      "The Voice Thickener/2005 Anime",
      "Creating the Earth/2005 Anime/Original",
      "Nature Plastic Model Series/2005 Anime",
      "All the Way From the Country of the Future/2005 Anime",
      "Esper Suneo/2005 Anime/Original",
      "Gian's Feeling Down/2005 Anime",
      "Nobita Will Disappear?/2005 Anime",
      "Don't Cry, Jaiko/2005 Anime",
      "The Schedule Clock/2005 Anime/Original",
      "Goodbye, Nobita! Doraemon, Goes Back To The Future",
      "Fourth Dimensional House Block/2005 Anime",
      "The Urashima Candy/2005 Anime/Original",
      "Winning Back Shizuka-chan (Part 1)",
      "Big Trouble! Suneo's Test Result/2005 Anime/Original",
      "Exploring the Earth (Part 2)",
      "A World Without Mirrors/Original",
      "Gratitude Halo/2005 Anime/Original",
      "Magical Girl Shizu-chan/2005 Anime/Original",
      "A Cat Made a Company/2005 Anime",
      "The Great Pirate Decisive Battle ~Love Romance of the Southern Sea~",
      "Doraemon is Really Sick?!/2005 Anime",
      "The Day Doraemon is Reborn",
      "Don't Take My Jack",
      "Jack, Betty, and Jenny/2005 Anime/Original",
      "The Snowman's Part-time Job",
      "Strong Stone/2005 Anime/Original",
      "Strong Stone/2005 Anime/Original",
      "Suneo Goes to the Beauty Salon",
      "Special Effects Ultra Dora-Man/2005 Anime",
      "Doraemon VS Dracula: Part 1",
      "Doraemon VS Dracula: Part 2",
      "Doraemon Takes a Day Off!!/2005 Anime",
      "Doraemon's Blue Tears",
      "Suneo's Incredible Fort/2005 Anime",
      "The Best Melon Bread in the World",
      "Half, and Half, and Half Again",
      "Shizuka-chan Disappeared!?",
      "A Beautiful Girl that Nobita Loved",
      "Parallel Planet/2005 Anime/Original",
      "The Suneo Kidnapping Case",
      "Doraemon's Long Day",
      "The Long, Long, New Years/2005 Anime",
      "The Wish Realizing Machine Has Gone Too Far!/2005 Anime/Original",
      "Nobita's Mermaid Legend",
      "There are 1000 Gians",
      "Jaiko and Dorami Have Boyfriends!?",
      "Swapping Bodies with Everyone/2005 Anime",
      "Flying Through the Sky on the Letter \"ワ\"/2005 Anime",
      "On That Day, Everything Turned Into Mice!",
      "The Mystery of Goodie Land",
      "Running Away to the Cretaceous Period",
      "Doraemon, Squared/2005 Anime",
      "The Rumored Nobita",
      "The Troublesome Gulliver/2005 Anime/Original",
      "The Tanabata Sky Came Falling Down",
      "I've Got a Spare Fourth Dimensional Pocket/2005 Anime",
      "The Debut of a New Song! Gian's The Greatest!",
      "Somersault Food/2005 Anime",
      "The Super Mobile Bathtub 1010/2005 Anime",
      "I'm Nobiko",
      "The Lying Mirror/2005 Anime/Original",
      "Giant Suneo Appears!/2005 Anime",
      "Freeze-Framing Him/2005 Anime",
      "The Making of a Television Channel/Original",
      "Nobita's Son Ran Away From Home/2005 Anime",
      "Let's Live to Laugh/2005 Anime",
      "Thank God for the Prison Break",
      "The Hamelin Pipe/2005 Anime",
      "I Found a Tsuchinoko!/2005 Anime/Original",
      "Mind Reading Helmet/2005 Anime",
      "The Dictator Switch/2005 Anime/Remade",
      "We're Gonna Go Flower Watching, No Matter What",
      "Instant Mom",
      "House 'Copter",
      "Set The Room Guard/2005 Anime",
      "The Coagulation Light/2005 Anime",
      "The Giant Dora-Raccoon at Midnight",
      "A Visitor from the Country of the Future/U.S. English dub",
      "Nobita's 100 Point Test - A Major Incident After 25 Years",
      "Takeshi's Bum-Ba-Dum Birthday!",
      "Doraemon is Really Sick?!/U.S. English dub",
      "Doraemon, Squared/U.S. English dub",
      "Free Size Doll Camera/2005 Anime",
      "The Day Dorami Was Born",
      "Shiritori Nessie",
      "The Story of the Old Persimmons",
      "Reunion! Nobita from 5 Years Ago/2005 Anime",
      "Big Collection of Look-alike Pet",
      "I'm Mari-chan/2005 Anime",
      "The Any Substance Conversion Machine",
      "The Fantasy Animal Safari Park and the Promised Flute",
      "The Genius Nobita's Airship Amusement Park",
      "Shizuka-chan Became the Elephant's Nose/2005 Anime",
      "Do your Best, Sengoku Rider Nobibe",
      "Earth Elevator",
      "To Miss Yumeko Nijitani",
      "Fourth Dimensional Dust Bin/2005 Anime",
      "Who is the Mask of Academic?/2005 Anime",
      "I'm Mini Doraemon",
      "The Mystery of the Pyramids!? The Great Egyptian Adventure",
      "Aren't You Nobita, the Cat?/Remade",
      "The Schedule Clock/2005 Anime/Remade",
      "Magical Girl Shizu-chan/2005 Anime/Remade",
      "Feudal Lord of the 21st Century/2005 Anime/Remade",
      "A World Without Mirrors/Remade",
      "The Wish Realizing Machine Has Gone Too Far!/2005 Anime/Remade",
      "Christmas in the House of Candies",
      "Jack, Betty, and Jenny/2005 Anime/Remade",
      "Big Trouble! Suneo's Test Result/2005 Anime/Remade",
      "Nobita Runs Away From Home for a Lo~ng Time/2005 Anime",
      "The Lying Mirror/2005 Anime/Remade",
      "The Troublesome Gulliver/2005 Anime/Remade",
      "The Rewarding Headband",
      "A Whale and Mystery of Pipe Island",
      "Nobita's Shooting Stars",
      "The Helping Hand Spray/2005 Anime",
      "The Urashima Candy/2005 Anime/Remade",
      "Kukku, the Kamaitachi",
      "The Smoke Ghost of the Lamp/Remade",
      "Look at Doraemon! His Secret/2005 Anime",
      "Gian is a Big Star!?",
      "The Cotton Candy Cloud Maker",
      "The Watercycline/2005 Anime/Remade",
      "The Maze of Future Sweets Castle",
      "Strong Stone/2005 Anime/Remade",
      "Full of Doraemon",
      "The Swallow Nobita/2005 Anime",
      "Transformation Reprinter",
      "Go Ahead to the Picnic",
      "Gratitude Halo/2005 Anime/Remade",
      "Esper Suneo/2005 Anime/Remade",
      "Creating the Earth/2005 Anime/Remade",
      "Memory Bank",
      "Making Character Products",
      "Taking an Arrow to School/2005 Anime",
      "Doraemon: Nobita's Dinosaur",
      "Doraemon: Nobita and the Haunts of Evil",
      "Doraemon: Nobita and the Castle of the Undersea Devil",
      "Doraemon: Nobita's Great Adventure into the Underworld",
      "Doraemon: Nobita and the Animal Planet",
      "Doraemon: Nobita and the Galaxy Super-express",
      "Doraemon: Nobita Drifts in the Universe",
      "Doraemon: Nobita's Legend of the Sun King",
      "Doraemon: Nobita and the Winged Braves",
      "Doraemon: Nobita in the Robot Kingdom",
      "Doraemon: Nobita and the Windmasters",
      "Doraemon: Nobita in the Wan-Nyan Spacetime Odyssey",
      "Doraemon: Nobita's Dinosaur 2006",
      "Doraemon: Nobita's New Great Adventure into the Underworld ~The 7 Magic Users~",
      "Doraemon: Nobita and the Green Giant Legend",
      "Doraemon: The New Record of Nobita's Spaceblazer",
      "Doraemon: Nobita's Great Battle of the Mermaid King",
      "Doraemon: Nobita and the New Steel Troops ~Winged Angels~",
      "Doraemon: Nobita and the Island of Miracles ~Animal Adventure~",
      "Doraemon: Nobita's Secret Gadget Museum",
      "Doraemon: New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Stand by Me Doraemon",
      "Doraemon: Nobita's Space Heroes",
      "Doraemon: Nobita and the Birth of Japan 2016",
      "Doraemon: Nobita's Great Adventure in the Antarctic Kachi Kochi",
      "Doraemon: Nobita's Treasure Island",
      "Doraemon: Nobita's Chronicle of the Moon Exploration",
      "Doraemon: Nobita's New Dinosaur",
      "Stand by Me Doraemon 2",
      "Doraemon: Nobita's Little Star Wars 2021",
      "Doraemon no Uta",
      "Doraemon Asian English dubs",
      "Doraemon (1973 anime)",
      "Nobita",
      "Bambooshoot-copter",
      "Parallel Planet (location)"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/e8/Bambo.jpeg/revision/latest?cb=20130708031038\u0026path-prefix=en"
  },
  {
    "eng_name": "Tanabata Rocket",
    "jp_name": "ねがい七夕ロケット Ragaitetaroketto",
    "description": "To use the Tanabata Rocket, the user must use the tags to write the wish that they want, then attach it to the rocket and launch it to the space.\nThe comparison of the original (left) and the reverse one (right).",
    "appears_in": [
      "Wish Tanabata Rocket"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/af/Tanabata_Rocket.png/revision/latest/scale-to-width-down/350?cb=20190710110349\u0026path-prefix=en"
  },
  {
    "eng_name": "Technology Gloves",
    "jp_name": "技術手袋 Gijutsu Tebukuro",
    "description": "The fingertips of the gloves are capable of turning into a variety of tools, allowing the wearer to modify, reprogram, and upgrade any type of machinery.  \nThe gloves are red with metallic fingers. The gloves have a grey band around the hand. \nIn “Nobita’s Little Space Wars 2021”.",
    "appears_in": [
      "Nobita's Little Star Wars",
      "Doraemon: Nobita's Little Star Wars 2021"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/c1/GH.jpg/revision/latest/scale-to-width-down/350?cb=20150331022211\u0026path-prefix=en"
  },
  {
    "eng_name": "Teru Teru Bozu",
    "jp_name": "てるてる坊主",
    "description": "When the user raises the rod, the rain will stop.",
    "appears_in": [
      "Teru Teru Costume"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/d/dd/Teruteru.png/revision/latest/scale-to-width-down/350?cb=20150224135751\u0026path-prefix=en"
  },
  {
    "eng_name": "Teru Teru Costume",
    "jp_name": "テルテルコート Teruterukōto",
    "description": "Teru Teru Costume or Teru Teru Coat is a useless gadget that Nobita snatched when Doraemon is about to throw it away.\nOne wears the costume when it rains, it looks like that the gadget stopped the rain, but it actually sucks all the rain into the costume.",
    "appears_in": [
      "Teru Teru Bozu"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/d/dd/Teru_teru_bozu.jpg/revision/latest?cb=20160307111235\u0026path-prefix=en"
  },
  {
    "eng_name": "The Life Do-Over Machine",
    "jp_name": "人生やりなおし機 Do-Over Machine",
    "description": "The Do-Over Machine can let the user to do-over machine in \"that\" age that user wants. However, the machine also keep the user's strengh and IQ.",
    "appears_in": [
      "The Life Do-Over Machine (episode)",
      "Redo Life Machine"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/2/2b/Do-Over_Machine_.png/revision/latest?cb=20171126144055\u0026path-prefix=en"
  },
  {
    "eng_name": "The Soul Machine",
    "jp_name": "General InformationFunctionsDetails",
    "description": "Stand by Me Doraemon 2The Soul Machine is a gadget used in both Doraemon 2005 anime and Stand by Me Doraemon 2.\nThe gadget has a suction rope that takes your soul into a machine and travels back to the past inside of your mind.",
    "appears_in": [
      "Stand by Me Doraemon 2"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/8/8f/SoulMachine2005%28G%29.png/revision/latest/scale-to-width-down/350?cb=20201026195633\u0026path-prefix=en"
  },
  {
    "eng_name": "Time Belt",
    "jp_name": "タイムベルト Taimu Beruto",
    "description": "It is yellow in color and it looks flexible and has some buttons on it.\nIts function is the same as the Time Machine except that it can't change the user's location.",
    "appears_in": [
      "The Time Machine is lost!!",
      "The Around the World Quiz",
      "Exploring the Earth (Part 1)",
      "Exploring the Earth (Part 2)",
      "Doraemon's Long Day",
      "Nobita Meets the Masked Queen",
      "Doraemon: Nobita's Great Adventure in the Antarctic Kachi Kochi",
      "Time Machine"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/40/Time_Belt.jpg/revision/latest/scale-to-width-down/350?cb=20190630142248\u0026path-prefix=en"
  },
  {
    "eng_name": "Time Boat",
    "jp_name": "タイムボート",
    "description": "Time Boat (タイムボート Taimu Bōto) is a specialized time travelling vehicle used by the Time Patrol agents in the Time Patrol Bon franchise.\nIn the 1989 anime, only type 2 appeared.",
    "appears_in": [
      "Bon Namihira",
      "Ream Stream",
      "Yumiko Yasukawa",
      "Gayler",
      "Will",
      "Louis Stream",
      "Future Time Patroller",
      "Time Machine",
      "Buyoyon",
      "Ambrose Bierce"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/45/Time_Boat_2024.png/revision/latest/scale-to-width-down/350?cb=20240704024356\u0026path-prefix=en"
  },
  {
    "eng_name": "Time Camera (gadget)",
    "jp_name": "時間カメラ Taimu Kamera",
    "description": "It can be used to take pictures of things in the past. You must specify how long ago you want the picture to be from, and then click a photo. The camera will show what the object or area was like in the past",
    "appears_in": [
      "Time Camera",
      "What Am I for Momotaro"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/5c/Time_Camera.PNG/revision/latest/scale-to-width-down/350?cb=20160417111735\u0026path-prefix=en"
  },
  {
    "eng_name": "Time Cloth",
    "jp_name": "タイムふろしき, Taimu Furoshiki",
    "description": "The Time Cloth is capable of manipulating time on whatever it covers in a backward or forward direction.\nThe item does not need to be fully enclosed over its target to function and doesn't necessarily affect its attachments or certain other attributes. In one episode where Doraemon had hung the item over the drying rack, a stray breeze detaches it and the item ends up blinding Nobi Tamako. who tries to navigate around the house with her sight obstructed. Before Doraemon can notice, Tamako was reverted to her younger self (somewhat resembling Shizuka Minamoto), much to her surprise. Notably, even though her body has regressed, her other items did not, and she still retains her memories, resulting in her walking awkwardly in her oversized clothing.\nTime Cloth in Anime",
    "appears_in": [
      "Chapter 25:Time Cloth",
      "The Time Cloth",
      "The Girl With the Red Shoes",
      "Romance in the Snowy Mountain",
      "Goodbye, Doraemon...",
      "Magical Girl Shizu-chan",
      "God Robot Extends His Hand of Love!",
      "Nobita's Dinosaur",
      "Nobita's Dinosaur 2006",
      "Nobita and the Winged Braves",
      "Doraemon: Nobita's Great Adventure into the Underworld",
      "Stand by Me Doraemon",
      "Stand by Me Doraemon 2",
      "Doraemon: Nobita's New Dinosaur"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/12/Time_Cloth.jpg/revision/latest/scale-to-width-down/350?cb=20190630110321\u0026path-prefix=en"
  },
  {
    "eng_name": "Time Machine",
    "jp_name": "タイムマシン",
    "description": "Time Machine is a gadget of 22nd Century which is used to do time travel.\nThe Time Machine consists of a computer operator and a panel consisting of few handles and switches. It has minimum one seat for the driver to sit. It also consists of an antennae like projection(s) which collects signals.\nDoraemon's Time Machine is the most commonly seen and used time machine in the franchise. It consists of a nearly-square-shaped chassis, with various appliances mounting on it, such as controls, antennae, etc. The machine is magnetically powered. It originally has the capacity to hold up to three people at maximum. But since it had broken down once, Doraemon upgraded the gadget, and it is now able to transport up to five people. It is placed in the upper drawer of Nobita's desk in Nobita's room in Nobi's Residence. In the 1973 anime, Doraemon's Time Machine had two seats like a car's interior and two levers. It was fully purple coloured. The antennae didn't exist.\nPawaemon's Time Machine can be seen in Battle! Cat-Model Robots vs. Dog-Model Robots. The overall appearance of his Time Machine remains the same as Doraemon's except it has different colors.\nDorami's Time Machine is more advanced as compared to Doraemon's. It is more spacious and comfortable from inside. It is an orange (sometimes red) tulip-shaped machine with its leaf-like base. Furthermore, it has three antennae like projections at the top which seems to appear like the pistil of a flower. Dorami's time machine is placed in the mirror of her room.\nThe thief's Time Machine which appeared as A Visitor from the Country of the Future was black coloured, having a pair of yellow and red lights front and back.\nTime Patrol's Time Machines resembles like a police car having black and white colour with a small red tail like bulb which glows at the top. They are shaped like a computer mouse. The word \"Police\" is written on it's on both sides.\nIn Doraemon: Nobita's Dinosaur, Black Mask's Time Machine was flat and had his face on it. It had an antenna and a chair. His time hole was rectangular shaped. In Doraemon: Nobita's Dinosaur 2006, his Time Machine was highly advanced and was more comfortable with fewer controls. It was big and wide and was designed like a king's seat. His time hope was hexagonal.",
    "appears_in": [
      "Doraemon Came Out!",
      "Sewashi Nobi",
      "Feudal Lord of the 21st Century",
      "Doraemon",
      "Dorami",
      "Pawaemon",
      "Time Patrol",
      "Black Mask",
      "Doraemon",
      "Nobita Nobi",
      "Dorami",
      "Pawaemon",
      "Sewashi Nobi",
      "Nobisuke Nobi (Nobita's son)",
      "Black Mask",
      "Shizuka Minamoto",
      "Doraemon: Nobita and the Steel Troops",
      "Time Patrol",
      "Doraemon Jumps Out of the Desk",
      "My Beloved Wife Jaiko!?",
      "Goodbye, Doraemon.../Manga",
      "Doraemon Appears!",
      "Chapter 860: The Man Who Comes From Planet Galapa",
      "Chapter 2: Who’s The Real Thief",
      "Chapter 3: For Me To Stop Nobita",
      "Chapter 16: A Future Nobita",
      "Chapter 17: A Salary Riot",
      "Chapter 102:The Time Machine",
      "Nobita's Ancestors/1973 Anime",
      "Proposal Strategy/1973 Anime",
      "Lottery Jackpot Strategy/1973 Anime",
      "Memories of Grandma/1973 Anime",
      "Goodbye, Doraemon.../1973 Anime",
      "Time Machine (episode)",
      "Nobita's Bride/1979 Anime",
      "Dinosaur Hunting/1979 Anime",
      "Ally Self mask of Justice",
      "A Girl Like White Lily/1979 Anime",
      "The Girl With the Red Shoes/1979 Anime/Original",
      "Memories of Grandma/1979 Anime: Part 1",
      "Memories of Grandma/1979 Anime: Part 2",
      "I'll Be My Own Teacher",
      "We're Gonna Steal Mom's Diamond/1979 Anime",
      "I Found a Tsuchinoko!/1979 Anime",
      "Space Tarzan/1979 Anime",
      "Shopping Across the Ages/1979 Anime",
      "Ayaushi! Lion Mask/1979 Anime",
      "The Castaway Story from Long Ago/1979 Anime",
      "Nobita's Nobita/Original",
      "Lottery Jackpot Strategy/1979 Anime",
      "Making a Little Brother/1979 Anime",
      "Doraemon's Surprised All Encyclopedia",
      "The Elephant and the Uncle/1979 Anime",
      "Romance in the Snowy Mountain/1979 Anime/Original",
      "Going for a Vacuum Cleaner Drive/1979 Anime",
      "Surprised All Encyclopedia: Doraemon and Dorami-chan",
      "Doraemon's Bell Disappeared",
      "The Time Machine Disappeared!!/1979 Anime",
      "I Hate Doraemon!?",
      "Nobita's the Night Before a Wedding/1979 Anime",
      "The Good Ol' Days/1979 Anime",
      "Trouble With Dad's Salary/1979 Anime",
      "The Winning Postcard/1979 Anime",
      "It's Solved! The Dekisugi Case/1979 Anime",
      "Nobita's Son Ran Away From Home/1979 Anime",
      "Nobita's 0-Point Escape Plan/1979 Anime",
      "Memories of Grandma/1979 Anime/Remade",
      "Dad's a Mama's Boy, Too",
      "Feudal Lord of the 21st Century/1979 Anime/Remade",
      "The Girl With the Red Shoes/1979 Anime/Remake",
      "Mini-Dora SOS!!",
      "Romance in the Snowy Mountain/1979 Anime/Remade",
      "The Wish Realizing Machine Has Gone Too Far!/1979 Anime",
      "Doraemon's Everywhere/1979 Anime",
      "Helpman Appears",
      "All Alone in the City of the Future/1979 Anime",
      "2112: The Birth of Doraemon",
      "Nobita's Nobita/Remade",
      "Sewashi-kun's Runaway",
      "The Nobita That Stopped Me/1979 Anime",
      "Nobita's Ancestors/1979 Anime/Remade",
      "The Day When I Was Born/Short Film",
      "Dorami's Sibling's Pack",
      "Proposal Strategy/1979 Anime/Remade",
      "Doraemon Takes a Day Off!!/1979 Anime/Remade",
      "Nobita's Bride/2005 Anime/Original",
      "The Time Machine Disappeared!!/2005 Anime/Original",
      "Remember! The Excitement of That Day/2005 Anime/Original",
      "Doraemon's Everywhere/2005 Anime/Original",
      "A Girl Like White Lily/2005 Anime",
      "Nobita's Ancestors/2005 Anime",
      "Ayaushi! Lion Mask/2005 Anime",
      "The Castaway Story from Long Ago/2005 Anime/Original",
      "Space Tarzan/2005 Anime",
      "All the Way From the Country of the Future/2005 Anime",
      "I'm Gonna Become a Fine Dad!",
      "Nobita Will Disappear?/2005 Anime",
      "All Alone in the City of the Future/2005 Anime",
      "Memories of Grandma/2005 Anime/Original",
      "Goodbye, Nobita! Doraemon, Goes Back To The Future",
      "The Girl With the Red Shoes/2005 Anime/Original",
      "The Elephant and the Uncle/2005 Anime/Original",
      "We're Gonna Steal Mom's Diamond/2005 Anime",
      "Feudal Lord of the 21st Century/2005 Anime/Original",
      "The Day When I Was Born/2005 Anime",
      "Doraemon VS Dracula: Part 1",
      "Shizuka-chan's Present is Nobita",
      "Doraemon Takes a Day Off!!/2005 Anime",
      "Doraemon's Blue Tears",
      "Dorami's Worst Day Ever",
      "Nobita's 0-Point Escape Plan/2005 Anime",
      "Proposal Strategy/2005 Anime/Original",
      "Trouble With Dad's Salary/2005 Anime",
      "A Beautiful Girl that Nobita Loved",
      "The Suneo Kidnapping Case",
      "Doraemon's Long Day",
      "Santa Mail/2005 Anime",
      "Chase the Dorayaki Legend!",
      "The Wish Realizing Machine Has Gone Too Far!/2005 Anime/Original",
      "Nobita's Mermaid Legend",
      "Long Ago, Mom Was Just Like Nobita!?",
      "The Mystery of Goodie Land",
      "Doraemon's Everywhere/2005 Anime/Remade",
      "Nobita's Confusing School Entrance Ceremony",
      "Nobita's Big River Otter Adventure",
      "The Nobita That Stopped Me/2005 Anime",
      "Memories of Grandma/2005 Anime/Remade",
      "It's Solved! The Dekisugi Case/2005 Anime",
      "Nobita's Son Ran Away From Home/2005 Anime",
      "Doraemon's 100 Year Time Capsule/2005 Anime",
      "Thank God for the Prison Break",
      "Lottery Jackpot Strategy/2005 Anime",
      "I Found a Tsuchinoko!/2005 Anime/Original",
      "Shopping Across the Ages/2005 Anime",
      "Nobita vs. Musashi: The Battle Shortly Before Ganryujima",
      "The Time Machine Disappeared!!/2005 Anime/Remade",
      "Romance in the Snowy Mountain/2005 Anime/Remade",
      "All the Way From the Country of the Future/U.S. English dub",
      "The Nobita That Stopped Me/U.S. English dub",
      "Doraemon's 100 Year Time Capsule/U.S. English dub",
      "Nobita's 0-Point Escape Plan/U.S. English dub",
      "Nobita's Bride/2005 Anime/Remade",
      "The Day Dorami Was Born",
      "Dinosaur Hunting/2005 Anime",
      "The Dora Dora Genpei Battle ~Save Yourself Shizuka-chan!~",
      "Do your Best, Sengoku Rider Nobibe",
      "The Elephant and the Uncle/2005 Anime/Remade",
      "The Girl With the Red Shoes/2005 Anime/Remade",
      "Proposal Strategy/2005 Anime/Remade",
      "Feudal Lord of the 21st Century/2005 Anime/Remade",
      "The Wish Realizing Machine Has Gone Too Far!/2005 Anime/Remade",
      "Gian and Nobita's Promise",
      "I Found a Tsuchinoko!/2005 Anime/Remade",
      "Growing Persimmons In One Night",
      "Doraemon's Song (episode)/Remade",
      "Save the Neanderthals",
      "Summer Vacation In The 22nd Century",
      "The Castaway Story from Long Ago/2005 Anime/Remade",
      "Doraemon Is An Exam Student Now!?",
      "Nobita's Dinosaur",
      "Doraemon: Nobita's Great Adventure into the Underworld",
      "Doraemon: The Record of Nobita's Parallel Visit to the West",
      "Doraemon: Nobita and the Birth of Japan",
      "Doraemon: Nobita's Dorabian Nights",
      "Doraemon: Nobita in the Robot Kingdom",
      "Doraemon: Nobita in the Wan-Nyan Spacetime Odyssey",
      "Nobita's Dinosaur 2006",
      "Doraemon: Nobita's Great Battle of the Mermaid King",
      "Doraemon: Nobita and the New Steel Troops ~Winged Angels~",
      "Stand by Me Doraemon",
      "Nobita and the Birth of Japan 2016",
      "Doraemon: Nobita's New Dinosaur",
      "Stand by Me Doraemon 2"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/f/fe/Images.jpeg/revision/latest?cb=20130708030507\u0026path-prefix=en"
  },
  {
    "eng_name": "Time Room",
    "jp_name": "タイム・ルーム Taimu Rūmu",
    "description": "With the use of this gadget, a room will act as a time machine and the surroundings will change.",
    "appears_in": [
      "The Story of the Old Persimmons"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/0f/Time.Room.PNG/revision/latest/scale-to-width-down/350?cb=20160710051334\u0026path-prefix=en"
  },
  {
    "eng_name": "Timed Stupidity Bomb",
    "jp_name": "時限バカ弾 Jigen Baka Dan",
    "description": "The bomb has a timer that must be activated before it can detonate. If anything was caught in its area of effect, the bomb stupefies its targets, causing them to hallucinate and behave erratically.It affects both humans and machines, while the effect lasts for up to 5 minutes.",
    "appears_in": [
      "Suneo's in Love",
      "The Stupidity Time Bombs",
      "Doraemon's Blue Tears",
      "Summer Vacation In The 22nd Century",
      "Doraemon: Nobita's Treasure Island",
      "Jigen Baka Dan (minigame)"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/f/fd/TimednStupidity_Bomb.jpg/revision/latest/scale-to-width-down/350?cb=20190701020249\u0026path-prefix=en"
  },
  {
    "eng_name": "Toilet Paper (Gadget)",
    "jp_name": "トビレットペパー \"Tobirettopēpā\"",
    "description": "If you want to go picnic with carrying lot of stuff inside your backpack. This gadget will help you feel more lighter. Just put this thing inside your backpack and you wont get tired, even your going to hiking on the highest mountain. This gadget also allows users to fly by wrapping it around your shoulders and arm,",
    "appears_in": [
      "Flying Paper",
      "Floating Scarf"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/ce/Toilet_paper.png/revision/latest/scale-to-width-down/350?cb=20240821132859\u0026path-prefix=en"
  },
  {
    "eng_name": "Tourism Vision",
    "jp_name": "観光ビジョン \"\"Kankō bijon\"\"",
    "description": "Tourism Vision or Sightseeing Vision, Is a one of Doraemon gadgets. \nIn order to help Nobita to finish his homework because the weather is hot outside. Doraemon take out the Toursim Vision from his pocket. This gadget allows you to change the background or scenery from your room, just select the place you want by adjusting the button and rotate the wheel. Only the scenery changed, but the wide of the room is still same as usual.",
    "appears_in": [
      "I Can't Study in the Sahara Desert"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/15/Toursim_Vision.png/revision/latest/scale-to-width-down/350?cb=20240831102545\u0026path-prefix=en"
  },
  {
    "eng_name": "Train Monopoly Set",
    "jp_name": "列車用すごろくセット Ressha-yō sugoroku setto",
    "description": "First the four players must be on the train. The gameplay is the same as Sugoroku except that there are some changes. When a player draws a card, the player must wear the costume stated in the card. To remove the costumes, the train station must be the same as the Japanese character given. For example, Doraemon's card stated that \"Go to station O to ponpokorin\", if the train passes to the station Okanoue station, Doraemon's costume will be removed.",
    "appears_in": [
      "Nobita Express and the Mystery of the Train Hunter"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/ea/Train_Monopoly_Setto.png/revision/latest/scale-to-width-down/350?cb=20151018132614\u0026path-prefix=en"
  },
  {
    "eng_name": "Tranquillizer Stick",
    "jp_name": "まあまあ 棒 Ma Ma Bō",
    "description": "User attaches the stick to the target's mouth and says \"まあ まあ! (Calm Down! Calm Down!)\" and then target calms down. This gadget hides the target's anger inside of his/her body. The target's anger gets stuck inside his/her body and it grows little by little, then it explodes like a volcanic eruption if the user used the gadget too many times on a person.",
    "appears_in": [
      "Now-Now Stick",
      "Strong Stone",
      "Save the Antarctic Penguin!",
      "Megumi Ōhara",
      "Ma Ma Bou (minigame)",
      "Sensei"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/93/Ma_Ma_Boo.PNG/revision/latest/scale-to-width-down/350?cb=20150809122850\u0026path-prefix=en"
  },
  {
    "eng_name": "Transformation Drink",
    "jp_name": "変身ドリンク Henshin Dorinku",
    "description": "The user must drink the Transformation drink and think of an animal or object he/she wants to transform. If the user has lack of focus, the transformation will consume negative effects. Effect ends after 6 hours.\nIn an episode called Shizuka Disappeared?!, it introduces the more upgraded version, the Transformation Drink EX (変身ドリンク・ＥＸ Henshin Dorinku Īekkusu) which is can transform a user into he/she desires instantly. After 6 hours, the transformation will be permanent, unlike the original one.",
    "appears_in": [
      "Nobita's Dorabian Nights",
      "Makeover, Makeover, Also Makeover",
      "Shizuka-chan Disappeared!?",
      "The New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Doraemon: New Nobita's Great Demon ~Peko and the Exploration Party of 5~"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/33/Transformade.PNG/revision/latest/scale-to-width-down/350?cb=20151014114713\u0026path-prefix=en"
  },
  {
    "eng_name": "Transformation Headband",
    "jp_name": "変身カチューシャ Henshin Kachūsha",
    "description": "The gadget gives the wearer girly hairstyle, skirt, pink-cheek, lipstick and long eyelashes. If the wearer tells their fake name while wearing it, the other people know the user with that name. It also hypnotizes people around them into believing the wearer is a girl.",
    "appears_in": [
      "I am Nobiko-chan"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/40/Transformation_Headband_1.png/revision/latest/scale-to-width-down/350?cb=20140814044348\u0026path-prefix=en"
  },
  {
    "eng_name": "Translation Tool",
    "jp_name": "ほんやくコンニャク Hon'yaku kon'nyaku",
    "description": "If one eats it, the user will be able to speak and understand other languages, has the external effect of the user sounding fluent in the other languages. This edible gadget can also be used to communicate with animals as well.",
    "appears_in": [
      "Nobita Meets the Masked Queen",
      "Running Across Time! The Time Borrowing Race",
      "Nobita’s Birth of Japan",
      "Nobita's South Sea Adventure",
      "Doraemon: Nobita's Legend of the Sun King",
      "Nobita and the Wind Wizard",
      "Doraemon: Nobita's Dorabian Nights",
      "Nobita's New Great Adventure into the Underworld – The Seven Magic Users",
      "Doraemon: Nobita's Great Battle of the Mermaid King",
      "Doraemon: Nobita and the Island of Miracles ~Animal Adventure~",
      "The New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Nobita and the Birth of Japan 2016",
      "Doraemon: Nobita's Great Adventure in the Antarctic Kachi Kochi",
      "Moving to a Haunted Castle",
      "Doraemon: Nobita's Earth Symphony"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/7e/Konyaku.jpg/revision/latest/scale-to-width-down/350?cb=20190625234011\u0026path-prefix=en"
  },
  {
    "eng_name": "Truth Doll",
    "jp_name": "正直太郎 Shōjikitarō",
    "description": "The Truth Doll truthfully tells the thing a person is thinking in mind to others.",
    "appears_in": [
      "Chapter 22:Truth Doll",
      "Proposal Strategy",
      "Honest Tāro"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/b4/Truthful_Doll.PNG/revision/latest/scale-to-width-down/350?cb=20151017073623\u0026path-prefix=en"
  },
  {
    "eng_name": "Truth Transmitter",
    "jp_name": "正直電波",
    "description": "The Truth Transmitter (正直電波 Shoki denpa) is the gadget used and owned by Doraemon.\nIt uses to force a person to tell the truth with its soundwave.",
    "appears_in": [
      "Nobita's the Night Before a Wedding",
      "Stand by Me Doraemon",
      "Doraemon: Nobita's Secret Gadget Museum"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/ab/Truth_trans.jpg/revision/latest/scale-to-width-down/350?cb=20150428031542\u0026path-prefix=en"
  },
  {
    "eng_name": "TV Birdlime",
    "jp_name": "テレビとリもち Terebi torimochi",
    "description": "This gadget is used to get things from the television. If a person wants something from the television, he or she can get it with the use of the birdlime. You can put the birdlime inside the television, so it comes out of the television with what you want.",
    "appears_in": [
      "The Giant Dora-Raccoon at Midnight",
      "Calling for Anything in TV Adhesive"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/78/TV_Birdlime.png/revision/latest/scale-to-width-down/350?cb=20140524033311\u0026path-prefix=en"
  },
  {
    "eng_name": "Ultra Mixer",
    "jp_name": "ウルトラミキサー",
    "description": "Stick the two ends at two things. Then turn on the switch and the two things will become one. It also works for something that is alive. For example, Doraemon and Nobita fused to make Nobi-emon. Although it was never shown how it is done, but the effect can be reverted.",
    "appears_in": [
      "Chapter 119:The Fusion Machine",
      "Ultra Mixer/1973 Anime"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/31/Ultra_Mixer2005_001.png/revision/latest/scale-to-width-down/350?cb=20140929115419\u0026path-prefix=en"
  },
  {
    "eng_name": "Ultra Special Mighty Strong Super Armor",
    "jp_name": "ウルトラ・スペシャルマイティ・ストロングスーパーよろい Urutora supesharumaiti sutorongusūpā yoroi",
    "description": "It is said to be an invisible gadget which only wise people can see, and wearing this armor can make the user invincible. Only thing is, this gadget doesn't exist, but Nobita and Gian believe otherwise and think they have became invincible with the gadget.",
    "appears_in": [
      "The Invincible, Ultra-Special-Mighty-Strong-Super Armor",
      "The Emperor's New Clothes!? Super Armor"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/d/da/Ultra_Special_Mighty_Strong_Super_Armor.jpg/revision/latest/scale-to-width-down/350?cb=20190630115538\u0026path-prefix=en"
  },
  {
    "eng_name": "Umatake",
    "jp_name": "ウマタケ",
    "description": "To ride an Uma-Take, one should probably tame it first. The Uma-Take is a hasty, impatient and aggressive one, so taming it with carrots is a must. Simply put one foot on the 'step', then the Uma-Take itself will jump around and move quickly like a horse. The sound it made are like normal horse footsteps.\nThe Uma-Take is Nobita's first gadget in the game. It allows his to move very fast but in a jumping motion. When using it to jump, pressing the Y button(get off the Uma-Take) will make Nobita jumps, enabling him to reach higher places.\nThe Uma-Take can be used to crush enemies like the Stone Lion and Robo-Mouse by jumping on them. Some enemies cannot be damaged by the Uma-Take, causing Nobita to receive damage instead. The Uma-Take cannot be used underwater.\nThe Uma-Take is listed under number 4 out of 61 gadgets in the game.",
    "appears_in": [
      "Chapter 16:Run Run Bamboo Horse",
      "Run, Machine - Horse!",
      "Find the Concentration Machine",
      "The Dora Dora Genpei Battle ~Save Yourself Shizuka-chan!~",
      "Doraemon (2005 anime)"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/4e/Uma-Take.png/revision/latest/scale-to-width-down/350?cb=20140905093012\u0026path-prefix=en"
  },
  {
    "eng_name": "Underground Exploration Vehicle",
    "jp_name": "General InformationFunctionsDetails",
    "description": "With this gadget, users will be able to explore the underground. The vehicles can accommodate up to five or six people.",
    "appears_in": [
      "Chapter 079:The Underground Adventure",
      "Exploring the Earth (Part 1)",
      "Exploring the Earth (Part 2)",
      "Doraemon: Nobita's Great Adventure in the Antarctic Kachi Kochi",
      "Doraemon",
      "Dorami",
      "Nobita Nobi",
      "Shizuka Minamoto",
      "Takeshi Gouda",
      "Suneo Honekawa"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/2/20/VideoCapture_20181219-224944.jpg/revision/latest/scale-to-width-down/350?cb=20201027040519\u0026path-prefix=en"
  },
  {
    "eng_name": "Underwater Buggy",
    "jp_name": "水中バギー Suichū BagīGeneral informationCasual informationRelationshipsOther Details",
    "description": "Underwater Buggy (水中バギー Suichū Bagī) or simply Buggy (バギー Bagī) is a character as well as a gadget of Doraemon. He appears in the movie Nobita's Monstrous Underwater Castle and in the video game Doraemon: Giga Zombie no Gyakushū.\nBuggy appears as a small red 2-seater vehicle.\nHe is friendly and is kind-hearted.\nAmong the characters, Shizuka is the one who gives the most attention to Buggy's friendliness.\nHe is rather angry Doraemon and always refuses his advice.",
    "appears_in": [
      "Fuuko",
      "Sonya"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/48/Buggy.png/revision/latest/scale-to-width-down/350?cb=20151006103326\u0026path-prefix=en"
  },
  {
    "eng_name": "Upgrade Light",
    "jp_name": "グレードアップライト Gurēdoappu Raito",
    "description": "This gadget used to make things become real. For example, if the gadget beam a superhero costume, the costume will turn into a real superhero costume and have a certain ability.\nThe costume that have been beamed:",
    "appears_in": [
      "Shizuka",
      "Gian",
      "Suneo",
      "Doraemon",
      "Rocky Head",
      "Nobita",
      "Nobita's Space Heroes"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/2/25/Upgrade_Light.PNG/revision/latest/scale-to-width-down/350?cb=20150913093219\u0026path-prefix=en"
  },
  {
    "eng_name": "Urashima Candy",
    "jp_name": "ウラシマキャンディー Urashima Kyandī",
    "description": "When eaten, all acts of kindness by the user will be rewarded.",
    "appears_in": [
      "The Urashima Candy"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/74/Urashima_Candy.jpg/revision/latest/scale-to-width-down/350?cb=20190701020250\u0026path-prefix=en"
  },
  {
    "eng_name": "Vending Time Machine",
    "jp_name": "自動販売タイムマシン Jidōhanbai taimu mashin",
    "description": "This gadget can sell anything through the time.",
    "appears_in": [
      "Chapter 202:Vending Time Machine"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/13/Vending_Time_Machine.PNG/revision/latest/scale-to-width-down/350?cb=20160307121153\u0026path-prefix=en"
  },
  {
    "eng_name": "Voice Candy",
    "jp_name": "声のキャンディー Koe no kyandī",
    "description": "First say anything to the mike, this will record one's voice. Then the gadget will turn it into a candy. Get another person to eat the candy and he/she will have the speaker's voice. The effect will wear off after half an hour. He/She can also change into another voice.",
    "appears_in": [
      "I'll Become a Singer By Eating Candy",
      "Takeshi Gouda",
      "Nobita Nobi"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/ea/Voice_Candy.png/revision/latest/scale-to-width-down/350?cb=20140906105152\u0026path-prefix=en"
  },
  {
    "eng_name": "Voice Thickener",
    "jp_name": "コエカタマリン, Koekatamarin",
    "description": "When a person drinks the medicine, it solidifies their speech by firing a physical manifestation of the content. For say, if the person shouted 'Ya!', a corresponding Katakana letter 'Ya' (ヤ) will come out. Meanwhile, İf user shouts 'Ro' it will became an object shaped like \"ロ\". The letter's velocity is slightly slower than sound, and it does bounce off or be absorbed into hard surfaces and soft surfaces respectively (because their properties is rather similar to sound). The letters can maintain their velocity and momentum for a surprising amount of time and so may serve as transportation on their own.",
    "appears_in": [
      "Chapter 223:Voice Thickener",
      "The Voice Thickener/1979 Anime",
      "The Voice Thickener/2005 Anime",
      "Flying Through the Sky on the Letter \"ワ\"",
      "Move Fast, Doraemon! The Galactic Grandprix",
      "Be Careful When Sneezing",
      "Doraemon: Nobita and the Island of Miracles ~Animal Adventure~",
      "Doraemon: Nobita's Great Adventure in the Antarctic Kachi Kochi",
      "Doraemon: Nobita's Earth Symphony",
      "Doraemon",
      "Doraemon (1979 anime)",
      "Doraemon (2005 anime)"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/78/Voice_thickener.jpg/revision/latest/scale-to-width-down/350?cb=20140505170207\u0026path-prefix=en"
  },
  {
    "eng_name": "Voodoo Camera",
    "jp_name": "のろいのカメラ Noroi no Kamera",
    "description": "When used, Voodoo Camera is able to spawn voodoo dolls relevant to the targeted person.\nThe spawned voodoo dolls are able to transmit any form of damage inflicted on it to the relevant target. \nIt will lead to fatal if used improperly or if in the hands of wrong person.",
    "appears_in": [
      "Cursing Camera",
      "Chapter 53:Cursed Camera",
      "Doraemon in Malaysia",
      "Doraemon in India",
      "List of Doraemon manga chapters"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/ba/Curse_camera.PNG/revision/latest/scale-to-width-down/350?cb=20150728023405\u0026path-prefix=en"
  },
  {
    "eng_name": "Watermelon Pen",
    "jp_name": "スイカぺン Suika pen",
    "description": "Watermelon Pen is Doraemon's gadget.\nBlindfolded Shizuka is splitting watermelons.it used to make anything turn into watermelon.",
    "appears_in": [
      "A Watermelon Pen",
      "Doraemon Is An Exam Student Now!?"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/ab/Watermelon_Pen.PNG/revision/latest/scale-to-width-down/350?cb=20160605020923\u0026path-prefix=en"
  },
  {
    "eng_name": "Weather Exchange Map",
    "jp_name": "お天気コーカン地図 Otenki Kōkan Chizu",
    "description": "The gadget can change the weather for a specific place. You need to circle the place (whose weather you want to change) in order to do so.",
    "appears_in": [
      "The Weather Exchange Map"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/40/Weather_Exchange_Map.PNG/revision/latest/scale-to-width-down/350?cb=20151018072125\u0026path-prefix=en"
  },
  {
    "eng_name": "Werewolf Cream (gadget)",
    "jp_name": "おおかみ男クリーム Ōkami Otoko Kurīmu",
    "description": "If the user applies this cream on their face, then they will turn into a werewolf whenever they see a round object (like the moon). To remove the effect, simply wipe the cream off the user's face.",
    "appears_in": [
      "The Werewolf Cream",
      "Mama is a Werewolf!?",
      "Let's Turn Into the Snow Woman on Cold Days!!"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/f/f2/Werewolf_Cream.jpg/revision/latest/scale-to-width-down/350?cb=20190701021905\u0026path-prefix=en"
  },
  {
    "eng_name": "What-If Phone Booth",
    "jp_name": "もしもボックス What-if Box",
    "description": "The user must enter the booth, take the phone off, then say \"What if ____?\" , then set the phone down. Once this is done, it technically warps the user to an alternate dimension of their current world, while original world and its timeline continue on as usual[1]. Traveling future after using the gadget will result in the user arriving at the same parallel world and not the original world[2], but traveling back to the past will result in the user arriving at the original world prior to the usage of the gadget[3]. \nIt is also possible to revert the machine's effects manually by using it with specific commands.",
    "appears_in": [
      "Chapter 187:The \"What if\" Phone Booth",
      "The What-If Phone Box",
      "Nobita's Great Adventure into the Underworld",
      "Doraemon: Nobita's New Great Adventure into the Underworld – The Seven Magic Users",
      "I'll Be the King of String Finger World",
      "A World Without Mirrors",
      "Farewell Nobita",
      "I am Nobiko (1979 Episode)",
      "Suneo's Luxuriously Poor Birthday!",
      "Thank God for the Prison Break",
      "What If We Turn Day Into Night!?",
      "w:c:tamagotchi:Doraemontchi"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/06/What-If_Phone_Booth.jpg/revision/latest/scale-to-width-down/350?cb=20190701021906\u0026path-prefix=en"
  },
  {
    "eng_name": "Wishing Star",
    "jp_name": "ねがい星 Negai Hoshi",
    "description": "The Wishing Star flies to the person calling it and can grant his wishes. However, it is a subject of misunderstandings. For example, if you wish for a baked sea bream (鯛焼き Taiyaki), the gadget gives you a tire (タイヤ Taiya) and a tree (木 Ki).\nHowever, the Wishing Star was useful on one occasion; Nobita uses it to escape Gian and Suneo and it hides him inside a trash bin.",
    "appears_in": [
      "Chapter 183:Wishing Star",
      "The Wishing Star",
      "Wishing Star, Shooting Star"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/e/eb/Wishing_Star_2005_anime.PNG/revision/latest/scale-to-width-down/350?cb=20151205061416\u0026path-prefix=en"
  },
  {
    "eng_name": "Woodcutter's Spring (gadget)",
    "jp_name": "きこりの泉 Kikori no Izumi",
    "description": "Similar to its mythical namesake counterparts, the Woodcutter's Spring will offer a superior counterpart of an inserted item. It then asks the user which item they dropped, and will either return the updated one to them or withdraw the offer depending if they are honest. Regardless, items within its realm can't be retrieved, and each can only be used for up to 5 times.",
    "appears_in": [
      "The Woodcutter's Spring",
      "Doraemon: Nobita's Secret Gadget Museum",
      "Doraemon: Nobita's Secret Gadget Museum",
      "wikipedia:Maria Kawamura",
      "The Woodcutter's Spring",
      "Hidetoshi Dekisugi"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/7b/Woodcutter%27s_Spring.PNG/revision/latest/scale-to-width-down/350?cb=20150919133054\u0026path-prefix=en"
  },
  {
    "eng_name": "Wrestling Killer (Gadget)",
    "jp_name": "ころばし屋 Korobashiya",
    "description": "It appears to be a mini gadget version of a normal hit man. It has some large sunglasses, a large dark green hat and a white suit and a tie underneath his green coat. His hands and legs are very small. His hands are similar to Doraemon's. \nThe user pays 10 Yen(10 cents in US), declare a name of his/her target. This gadget will then knock that target up for 3 times using it Mini Air Cannon. Once the order has been declared, the Gadget will continuously chase it target until the target has been knock up 3 times. However, the order can be cancelled by paying 100 Yen(1 dollar in US).  \nYou can input the coins through it's back.",
    "appears_in": [
      "Wrestling Killer",
      "Wrestling Killer Z (gadget)",
      "Doraemon: Nobita's Secret Gadget Museum",
      "Nobita and the Robot Kingdom",
      "Nobita Express and the Mystery of the Train Hunter",
      "Wrestling Killer Z (gadget)",
      "Chukenper",
      "The Genius Nobita's Airship Amusement Park",
      "Doraemon in North America",
      "Doraemon in the United Kingdom"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/b1/Wrestling_Killer.jpg/revision/latest/scale-to-width-down/350?cb=20150312054900\u0026path-prefix=en"
  },
  {
    "eng_name": "Wrestling Killer Z (gadget)",
    "jp_name": "ころばし屋Z Korobashiya Zetto",
    "description": "The overal appearance of Wrestling Killer Z remains almost the same as Wrestling Killer, with little noticeable changes to its clothing. It has purple sunglasses, hot pink hat, purple coat and Z letter on its white suit.",
    "appears_in": [
      "Air Cannon"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/f/f6/Wrestling_Killer_Z.jpg/revision/latest/scale-to-width-down/350?cb=20150312091510\u0026path-prefix=en"
  },
  {
    "eng_name": "Y Candle",
    "jp_name": "Y(ワイ)ロウ Wai rō",
    "description": "The user can persuade people to do what the user wants by bribing them.",
    "appears_in": [
      "Operation: Y Candle"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/d/db/Y_Candle_587a.jpg/revision/latest/scale-to-width-down/350?cb=20200125175451\u0026path-prefix=en"
  }
]
