[
  {
    "eng_name": "Genius Helmet",
    "jp_name": "天才ヘルメット Tensai Herumetto",
    "description": "When the user wears this gadget, the user can see the structure of a machine well by seeing through the cover. The gadget is used for repairing things and remodeling machines. But this gadget is no use at all if it is not paired up with Technology Gloves as only the gloves can remodel the things.\nIt looks like a welding helmet with a large dark window that shows the user the machines' structure. The rest is in yellow color.",
    "appears_in": [
      "Nobita's Little Star Wars"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/c1/GH.jpg/revision/latest/scale-to-width-down/350?cb=20150331022211\u0026path-prefix=en"
  },
  {
    "eng_name": "Girlfriend Catalog (Gadget)",
    "jp_name": "ガルフレンド カタログ",
    "description": "The Girlfriend Catalog is a gadget that has appeared in the manga and 1979 anime. Doraemon gave it to Nobita after becoming curious of how many girls he would date in his later life and if he would be married to Shizuka. \nThe Girlfriend Catalog spawns out multiple images of future girlfriends one may have in the future.",
    "appears_in": [
      "Shizuka Minamoto",
      "Girlfriend Catalog",
      "Gian is Married!?"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/94/Girlfriend_Catalog_Gadget_%281979_anime%29.JPG/revision/latest/scale-to-width-down/350?cb=20170812103036\u0026path-prefix=en"
  },
  {
    "eng_name": "Go Go Dog",
    "jp_name": "ゴーゴー ドッグ Gō Gō Doggu",
    "description": "This gadget prevents the target from going to a person's house. The Go Go Dog is useful to repel intruders and catrobbers. Its function is the opposite of the Come Come Cat.",
    "appears_in": [
      "Doraemon and Dorami-chan"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/78/Go_Go_Dog.png/revision/latest/scale-to-width-down/350?cb=20151028085134\u0026path-prefix=en"
  },
  {
    "eng_name": "Go-Home Music Box",
    "jp_name": "ゴーホーム.オルゴール Gōhōmuorugōru",
    "description": "Play the music and the one who listened to the music will be forced to go home.",
    "appears_in": [
      "Nobita's Great Battle of the Mermaid King",
      "Go Home, You Unwanted Guest!"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/9f/Go-Home_Music_Box.png/revision/latest/scale-to-width-down/350?cb=20140906130556\u0026path-prefix=en"
  },
  {
    "eng_name": "Gone-With-The-Wind Electric Fan",
    "jp_name": "ふきとばし・せん風機 Fukitobashi Sen-fū-ki",
    "description": "Only push the button, you can blow anything including heavy objects and even buildings.",
    "appears_in": [
      "Chapter 17:Test Memorizing Toast",
      "Memorization Bread for Tests"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/46/Electric_Fan.PNG/revision/latest/scale-to-width-down/350?cb=20200925034313\u0026path-prefix=en"
  },
  {
    "eng_name": "Good Mood Warmth Sticker",
    "jp_name": "ごきげんポカポカシール Goki Gen Pokapokashīru",
    "description": "Just put this sticker on the body. It'll be able to convert emotional energy into heat. If we become really cheerful, it'll raise our body temperature and make us feel warm and cozy. Otherwise, if our mood took a nose dive, the temperature dropped as well.",
    "appears_in": [
      "The Good Mood Warmth Sticker"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/c7/Good_Mood_Warmth_Sticker.PNG/revision/latest/scale-to-width-down/350?cb=20150924090517\u0026path-prefix=en"
  },
  {
    "eng_name": "Good Points Choice Board",
    "jp_name": "いいとこ選択しボード Ītoko Sentakushi Bōdo",
    "description": "It is white at the bottom and light purple at the top. It has a big yellow button at the bottom and the Power bar is red in color, the Looks bar is green and the IQ or Intelligence bar is blue. They also have pictorial representations of Power, Looks and Intelligence at the top (above the bars).\nThe user can increase or decrease his/her own looks (L), power (P) and intelligence (IQ) using this gadget by raising the bar of the specific quality. However, they cannot increase all three at the same time. If one goes up, the other two partially go down.\nThe Power button is also known as the Strength button.",
    "appears_in": [
      "Looks, Strength, or IQ?"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/1b/%E3%81%84%E3%81%84%E3%81%A8%E3%81%93%E9%81%B8%E6%8A%9E%E8%82%A2%E3%83%9C%E3%83%BC%E3%83%89.jpg/revision/latest?cb=20151015124322\u0026path-prefix=en"
  },
  {
    "eng_name": "Gourmet Table Cloth",
    "jp_name": "グルメテーブルかけ Gurumetēburu Kake",
    "description": "The Gourmet Table Cloth is a very complicated gadget that is able to 'manifest' real food as if it is conjured up from thin air. The user(s) may simply use the cloth by voice command. For example, if Gian says \"Katsudon!\" towards the cloth, then a katsudon will appear in smokes on the cloth. Throughout the series, it has been very convenient for the gang especially when they are having a picnic or camping out.\nKurt Hartman made his own version of the Gourmet Table Cloth, the \"B-Class Gourmet Table Cloth\". Its function is similar to the Gourmet Table Cloth, although due to his inventions mostly hardly considered 'fully effective' or 'decent', it did manifest a pineapple hamburger for Suneo, but it manifested living chickens, a cow as well as a tomato and onion.",
    "appears_in": [
      "Chapter 1: A Partial Gourmet Table",
      "The Gourmet Table Cloth",
      "Mushroom Picking with a Mini Garden",
      "I'm Mini Doraemon",
      "Nobita and the Birth of Japan 2016",
      "Nobita's Space Heroes",
      "Nobita's Dorabian Nights"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/13/Gourmet_Table_Cloth.PNG/revision/latest/scale-to-width-down/350?cb=20150831102237\u0026path-prefix=en"
  },
  {
    "eng_name": "Gravity Paint (gadget)",
    "jp_name": "重力ペンキ Jūryoku Penki",
    "description": "When painted on a material, particularly a wall, a person who steps or walks on the material will not fall because the portion painted portion is not affected by gravity. The paint takes roughly 2 minutes to dry completely on its own.\nApparently, the paint's gravitational effects only takes place when it has already dried when painted.",
    "appears_in": [
      "Chapter 072:Gravity Paint",
      "The Gravity Paint",
      "Nobita and the Haunts of Evil",
      "The New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Doraemon: New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Doraemon: Nobita's Treasure Island",
      "Stand by Me Doraemon 2"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/f/ff/Gravity_Paint.PNG/revision/latest/scale-to-width-down/350?cb=20200629093902\u0026path-prefix=en"
  },
  {
    "eng_name": "Guard Dog Bank",
    "jp_name": "番犬貯金箱 Banken Chokin-bako",
    "description": "The gadget looks like a small brown dog having a slot at the place of it's eyes. It wears blue belt around it's neck having yellow spikes on it. Four of it's teeth are visible even when it's mouth is closed.",
    "appears_in": [
      "The Human Piggy Bank",
      "Doraemon",
      "Nobita Nobi",
      "Puzzle Bank",
      "Hypnosis Bank"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/a8/Puppybank.png/revision/latest/scale-to-width-down/350?cb=20140318004945\u0026path-prefix=en"
  },
  {
    "eng_name": "Guard Robot",
    "jp_name": "ガードロボット Gādorobotto",
    "description": "It acts as a bodyguard shooting laser beams to those who come nearby other than the person targeted to protect. However, it is unable to protect the person from aliens as the aliens were getting closer to Shizuka and when it tried to scare them away, the aliens were able to fight back.",
    "appears_in": [
      "Shizuka's Open-Air Space Bath",
      "Nobita's Ebi Fry"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/54/Guard_Robot.PNG/revision/latest/scale-to-width-down/350?cb=20160224112137\u0026path-prefix=en"
  },
  {
    "eng_name": "Guardian Paper",
    "jp_name": "まもり紙 Mamorigami",
    "description": "You must attract the paper's attention by clapping your hands (like the Shinto people praying) three times. The paper will guard you.\nThe opposite gadget is Pestilence Paper.",
    "appears_in": [
      "wikipedia:Guardian angel"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/0f/Guardian_Paper.PNG/revision/latest/scale-to-width-down/350?cb=20160626145825\u0026path-prefix=en"
  },
  {
    "eng_name": "Guidance Angel",
    "jp_name": "ミチビキエンゼル",
    "description": "In the Japanese episodes, this gadget is voiced by Keiko Yokozawa and Mayumi Tanaka in the 1979 series and Yoshiko Kamei in the 2005 series. It was voiced by Wendee Lee in the English dub of the 2005 series.\nThe Guidance Angel offers guidance to their wearer. They always tell them the best thing to do, with the doll itself have the power to predict the future. Although its guidance always saves the wearer from danger or trouble, the doll can be a 'control freak'. For example, the good guidance it can give is when how to swing or to let the ball pass when Nobita is playing baseball. The other example is the bad guidance that tells Nobita to study instead of helping Doraemon find his lost screw.\nThe Guidance Angel is a good consultant, but it is a control freak. Because it can predict the future, it is often very snobbish about its knowledge. Its opinions are very selfish, only cares about the person's well being (in terms of success in life) instead of their morality.\nThe Guidance Angel is one of the \"Aids (たすける) Gadgets\" in the game. It cost only 1 Bell Point, the cheapest to use amongst the other. It shows the proper path for the player by pointing out the way. When an item is spotted, it will fly towards it, prompting the player to pick them up. If the player is ignoring it and/or going the other way around, the Guidance Angel will start hitting either Doraemon or Nobita angrily. Note that it does not deal damage to either Nobita or Doraemon.\nUnlike in the series, the Guidance Angel in this game flies around, and only actives for a while.\nThe Guidance Angel is listed under number 55 out of 61 gadgets in the game.",
    "appears_in": [
      "The Guidance Angel"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/2/2e/Guidance_Angel.png/revision/latest/scale-to-width-down/350?cb=20140905190744\u0026path-prefix=en"
  },
  {
    "eng_name": "Guiding Machine",
    "jp_name": "みちび機",
    "description": "When the button is pressed, a fortune comes out to tell one what they should do. By following the fortune precisely, the best outcome will come forth toward the user.",
    "appears_in": [
      "Something's Gonna Occur at 7 o'clock"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/0f/Guidingki.jpg/revision/latest/scale-to-width-down/350?cb=20150807090736\u0026path-prefix=en"
  },
  {
    "eng_name": "Gulliver Beam Light",
    "jp_name": "ガリバー光線電灯",
    "description": "The Gulliver Beam Light has the same functions as both the Big Light and Small Light. It has two buttons: one is red and the other is blue. By pressing the red button it can enlarge humans and/or objects and the blue does the opposite, it shrinks things.",
    "appears_in": [
      "Rats Are As Weak As Cats",
      "Rats Are As Weak As Cats"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/41/015_8.jpg/revision/latest?cb=20170130141004\u0026path-prefix=en"
  },
  {
    "eng_name": "Gulliver Tunnel",
    "jp_name": "ガリバートンネル",
    "description": "To become small, the user must go through the tunnel, they will remain small until they go through the tunnel again to become big. However, if the user is going through the big entrance of the tunnel, they will become smaller and possibly be blown by the wind, as Doraemon stated.",
    "appears_in": [
      "Dream Town, Nobita Land",
      "Stand by Me Doraemon",
      "Doraemon: Nobita's Secret Gadget Museum",
      "Nobita's Big Summer Festival Plan",
      "The Nobi Family's Giant Tunafish",
      "Fallen Leaves and Jaiko",
      "Small Light",
      "Kaitou DX"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/98/Gulliver_Tunnel.jpg/revision/latest/scale-to-width-down/350?cb=20190701014318\u0026path-prefix=en"
  }
]
