[
  {
    "eng_name": "Handmade Cloud Set",
    "jp_name": "手作り雲セット Tedzukuri kumo setto",
    "description": "Handmade Cloud Set is one of gadget owned by Doraemon. This gadget package contain cloud seed, cloud maker machine, and cloud frame wire.\nFirst, you have to make any shape you want with a cloud frame wire. Then, fill the cloud machine with cloud seed. The clouds will come out from the machine. After that, stick to the cloud frames you have been made until the entire surface is covered by the clouds. Your handmade cloud is ready. have fun!",
    "appears_in": [
      "Handmade Clouds Have Fun"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/1a/Cloud_maker_set.png/revision/latest/scale-to-width-down/350?cb=20240903134310\u0026path-prefix=en"
  },
  {
    "eng_name": "Happiness Cards",
    "jp_name": "しあわせトランプ",
    "description": "It has 53 cards. Any wish of the user will come true while holding it. However, after using 52 cards leaving the joker everything will go wrong with the holder. In brief, the user will get several bad things instead. Giving it to someone can get rid of them, but if the user throws away it will come flying back to him/her.",
    "appears_in": [
      "The Happiness Cards",
      "The Fearsome Happiness Cards"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/a8/Happy_Cards.jpg/revision/latest?cb=20150823085205\u0026path-prefix=en"
  },
  {
    "eng_name": "Happy Promenade",
    "jp_name": "ハッピープロムナード Happī Puromunādo",
    "description": "Happy Promenade (ハッピープロムナード Happī Puromunādo) is a gadget owned by Doraemon.\nIt resembles a mat, and it has two pathes on it with some tree's decoration. If you walking from blue to yellow path, your feelings will be more happy and cheerful. But if you walking from opposite path (yellow to blue path), your feeling will more sad, despair and horrible.",
    "appears_in": [
      "Let's Walk Our Way to Happiness!"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/bb/Happy_Promenade.png/revision/latest/scale-to-width-down/350?cb=20240810033136\u0026path-prefix=en"
  },
  {
    "eng_name": "Head of the Gorgon (gadget)",
    "jp_name": "ゴルゴンの首 Gorugon no Kubi",
    "description": "When the box is opened, the user will slowly turn into stone. But if the user pulls the snake on top of the box, the user will turn back to normal. In truth, it is actually a stone-made head with a terrifying design that can emit a type of light from its eyes to turn their target to stone. Pulling the snake which is its hair returns the petrified to normal.\nIn the 2013 movie, it introduces the DX version of it which is very large in size and can levitate above the ground. Unlike the one introduced in the manga and anime, that version's resetting effect only seems to work if the user yanks one of the snakes while it is facing the petrified subject. The gang defeated it with Shizuka taking over and using a mirror to reflect its petrifying rays back to it. Apparently, the snakes are invulnerable from turning to stone by the rays.",
    "appears_in": [
      "Sensei",
      "Doraemon",
      "Suneo Honekawa",
      "Takeshi Gouda",
      "Shizuka Minamoto",
      "Nobita Nobi",
      "The Head of the Gorgon",
      "Doraemon (2005 anime)",
      "wikipedia:Yasuhiro Takato",
      "Doraemon in the United Kingdom"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/b/bf/Headofgogrono.png/revision/latest/scale-to-width-down/350?cb=20140316212613\u0026path-prefix=en"
  },
  {
    "eng_name": "Helping Hat",
    "jp_name": "タスケテ帽 Tasukete Bō",
    "description": "The Helping Hat has an antennae that detects the nearest person in trouble and guides its user to them. It seems to have a set range.\nThe Helping Hat is Shizuka's second gadget as an Assist Character. When used, Shizuka assumes her 'Magical Girl Shizuru' persona, flying around Doraemon and Nobita occasionally attacking enemies with her syringe that turns them instantaneously into either Hearts(for current health), or Dorayaki(extra life). If the current character(either Doraemon or Nobita) fell down into a pit, Shizuka will save them by bringing them up. The player may control Shizuka carrying the current character for a few seconds, that is, until she lets go and she returns to the Secret Base screen. When saving the current character, Nobita or Doraemon is completely invulnerable.\nWhen using this gadget, Shizuka cannot be dispatched via traps or pits because she is flying and virtually invulnerable. Practically, Shizuka used all three gadgets in the episode, the Inanimate Object Hypnotizing Megaphone, the Dress Up Camera and the Helping Hat itself.\nThe Helping Hat is listed under number 33 out of 61 gadgets in the game.",
    "appears_in": [
      "Magical Girl Shizu-chan",
      "Thank God for the Prison Break"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/44/Helping_Hat.jpg/revision/latest/scale-to-width-down/350?cb=20190630111454\u0026path-prefix=en"
  },
  {
    "eng_name": "Home-Ec Apron",
    "jp_name": "家庭科エプロソ",
    "description": "The gadget is nothing more than a normal apron in most physical properties, other than its titular enhancement - namely a significant boost to the user's household work proficiency. The item can also be disabled by mechanical faults and is prone to weathering.",
    "appears_in": [
      "Winning Back Shizuka-chan (Part 1)",
      "Winning Back Shizuka-chan (Part 2)",
      "The Fear of Jaiko's Curry"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/3b/Home-Ec_Apron.png/revision/latest/scale-to-width-down/350?cb=20140906114501\u0026path-prefix=en"
  },
  {
    "eng_name": "Horizon Tape",
    "jp_name": "地平線テープ Chiheisen Tēpu",
    "description": "It can be used to create an endless huge area that clearly shows the land meeting the sky i.e. the horizon. First, the user sticks one end of the tape to one side of the room and the other end to the other side. The stretched tape must now be facing a wall, and instead of the wall a large area of ground will appear where the horizon can be clearly seen. \nWarning. if you break this tape inside the horizon area. you will be trapped in the horizon area forever!.",
    "appears_in": [
      "The Horizon in Nobita's Room",
      "Doraemon: Nobita's Chronicle of the Moon Exploration"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/0c/Horizon_tape.jpg/revision/latest?cb=20150911095723\u0026path-prefix=en"
  },
  {
    "eng_name": "Horror Story Lamp",
    "jp_name": "怪談ランプ Kaidan Ranpu",
    "description": "Horror Story Lamp creates the surrounding scenery with various sound effects and even environmental changes like a shifting wind of sudden blow-out of the candle. For example, Nobita tells the story similar to Gian's (the Okiku's Plate,番町皿屋敷, lit. The Dish Mansion at Banchō), they heard a sound of a broken plate outside of the room. The cause of that sound was later revealed to be caused by a thief, whom was also counting the money he looted, similar to the scene when the ghost of Okiku was counting (plates).",
    "appears_in": [
      "The Ghost Story Lamp",
      "Chapter 19:Horror Story Lamp"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/a4/Horror_Story_Lamp2005.png/revision/latest/scale-to-width-down/350?cb=20140929154149\u0026path-prefix=en"
  },
  {
    "eng_name": "Human Manufacturing Machine",
    "jp_name": "人間製造機 Ningen seizō ki",
    "description": "Human Manufacturing Machine is a gadget owned by Doraemon. It is one of the banned gadgets.\nIt can create humans (manga \u0026 1979 anime) and other creatures (2005 anime). But the creatures made with it are mutants.",
    "appears_in": [
      "Chapter 131:Human Manufacturing Machine"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/48/Human_Manufacturing_Machine.PNG/revision/latest/scale-to-width-down/350?cb=20160330130553\u0026path-prefix=en"
  },
  {
    "eng_name": "Human Piggy Bank Maker",
    "jp_name": "人間貯金箱製造機 Ningen chokin-bako seizō ki",
    "description": "This gadget is used to make a piggy bank from a human. Just enter the code into the gadget and navigate it to the target.",
    "appears_in": [
      "The Human Piggy Bank",
      "Lawnmower Fish"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/8/87/Human_Piggy_Bank_Maker.PNG/revision/latest/scale-to-width-down/350?cb=20151013020423\u0026path-prefix=en"
  },
  {
    "eng_name": "Human Steam Engine Set",
    "jp_name": "人間機関草 Ningen Kikan-sō",
    "description": "The user places a smokestack on their head and uses coal-shaped candy after that drinking enough water to gain the speed and torque of a steam train.",
    "appears_in": [
      "Chapter 138:Human Engine",
      "Doraemon's 100 Year Time Capsule"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/4/49/Human_Steam_Engine_.PNG/revision/latest/scale-to-width-down/350?cb=20201024071758\u0026path-prefix=en"
  },
  {
    "eng_name": "Hypnosis Bank",
    "jp_name": "さいみん貯金箱 Saimin Chokin-bako",
    "description": "This gadget is like a piggy bank whose shape looks like a gas cylinder having a popped out flexible and stretchable hand at the top of it. The body of this gadget is metallic and is maroon in color. It consists of an eye having greenish pupil and a slot. The popped out hand has a glove on it.",
    "appears_in": [
      "The Human Piggy Bank",
      "Doraemon",
      "Nobita Nobi",
      "Puzzle Bank",
      "Guard Dog Bank"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/2/23/Hypnobank.png/revision/latest/scale-to-width-down/350?cb=20140318004916\u0026path-prefix=en"
  },
  {
    "eng_name": "Hypnosis Pendulum",
    "jp_name": "General InformationFunctionsDetails",
    "description": "With this tool, the user can put people (even robots) into hypnosis.",
    "appears_in": [
      "Doraemon's 100 Year Time Capsule",
      "Doraemon"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/90/Hypnosis_Pendulum.png/revision/latest/scale-to-width-down/350?cb=20201024055307\u0026path-prefix=en"
  }
]
