[
  {
    "eng_name": "Magic Belly",
    "jp_name": "マジックおなか",
    "description": "Magic Belly is a gadget used in the episode, Cartoonist Jaiko.\nThis gadget can be used with two users. First, one of the users places the red \"belly button\" on another user. With a simple swipe of the console, he or she can make the other laugh uncontrollably. The harder the swipe and the more the swipe, the harder the laugh and the more the laugh.\nFor the 1979 anime entitled The Magic Belly, a cat used the console and made Suneo laugh, whereas Shizuka does so in the 2005 anime entitled Cartoonist Jaiko.",
    "appears_in": [
      "The Magic Belly",
      "Cartoonist Jaiko"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/d/dc/Magic_Belly.png/revision/latest/scale-to-width-down/350?cb=20140907155409\u0026path-prefix=en"
  },
  {
    "eng_name": "Magic Butt",
    "jp_name": "マジックお尻 Majikku o shiri",
    "description": "When a parent spanks this gadget, they can administer punishment, no matter where their child is. this is similar to voodoo doll\nIt is more commonly used by Nobita's father,  as a way to punish him and also take some satisfaction.\nThe gadget also helps in stopping hiccups, as seen in Doraemon Is An Exam Student Now!?",
    "appears_in": [
      "Doing Anything I Please with the Magic Hand",
      "Doraemon Is An Exam Student Now!?",
      "Doraemon in Indonesia"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/52/Magic_Butt.PNG/revision/latest/scale-to-width-down/350?cb=20160220145340\u0026path-prefix=en"
  },
  {
    "eng_name": "Magic Eyes",
    "jp_name": "百万ボルトひとみ Hyakuman boruto hitomi",
    "description": "Hyakuman boruto hitomiTo use the gadget, the user places the eyes on a gadget and wears it. The gadget then created an attraction electric wave that causes anyone who look at the user in the eyes to become attracted to them. As such, the effect doesn't manifest if other person doesn't look in the eyes, and the attraction will subside in a few seconds after the person stops looking/is separated from the user or the user takes the glasses off.\nBeware, if the user looks at themselve in the mirror, then the user will become attracted to their own reflection.",
    "appears_in": [
      "Your Eyes Have One million Volts"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/09/MagicEyes100Volts.png/revision/latest/scale-to-width-down/350?cb=20200817044921\u0026path-prefix=en"
  },
  {
    "eng_name": "Magic Hands",
    "jp_name": "マジックハンド Majikku Hando",
    "description": "Whenever the user wears the Magic Hands, they can gain slight telekinetic or mind control powers, acting on objects and other living beings without touching them.",
    "appears_in": [
      "Doing Anything I Please with the Magic Hands"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/50/Magic_Hands.PNG/revision/latest/scale-to-width-down/350?cb=20151017075443\u0026path-prefix=en"
  },
  {
    "eng_name": "Mario's Warp Pipe",
    "jp_name": "マリオの土管 Mario no Dokan",
    "description": "Japanese Prime Minister, Shinzō Abe, is not able to make it in time to the closing ceremony of the 2016 Summer Olympics in Rio. He transforms into Mario, a character from Super Mario Bros. and is seen running across Tokyo's Shibuya Crossing a moment later. Doraemon, a blue cat-shaped robot who appears in the titular anime and manga, happens to be in the vicinity and takes out the Warp Pipe, which allows Mario to be transported to Rio, which is halfway across the world.\nThe warp pipe drills a hole into the core of the Earth from the current area the user is in to the designated area.Its' use is to transport someone to a designated place or area anywhere through the earth. The pipe drills a hole to the core and then to the designated area the user wants to go to. Just like in the Mario series, pipes take a very short time to anywhere regardless of distance.",
    "appears_in": [
      "Copy Robot"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/90/Warp_Pipe.PNG/revision/latest/scale-to-width-down/350?cb=20160827130903\u0026path-prefix=en"
  },
  {
    "eng_name": "Mecha Maker",
    "jp_name": "メカ・メーカー",
    "description": "The Mecha Maker is a gadget from the 2005 anime.\nMecha Maker allows the user to create mechanical contraptions. A blueprint and materials must be inserted for it to work.\nThis was an episode from the Doraemon English Dub that premiered on Disney XD.",
    "appears_in": [
      "Mecha Manufacturer",
      "Chapter 396:The Mecha Maker"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/7d/Mecha_Maker.jpg/revision/latest/scale-to-width-down/350?cb=20200710014648\u0026path-prefix=en"
  },
  {
    "eng_name": "Memory Bank (gadget)",
    "jp_name": "メモリーローン Memorīrōn",
    "description": "This is a gadget that allow the user to exchange their memories for money, as well as for erasing any unwanted memories by paying money in exchange. The user first places the tube section on their forehead for the gadget to scan their memory. Afterwards, the machine displays all the memories/events the user experienced along with the exchange price, with exchange rate varying from person to person depending on what they believe to be good or bad memory. The user then selects which memory to exchange for money, with good memories resulting in payout, while bad memories has the user pay money instead.\nAfter the transaction, the memory is removed from the user's brain. The removed memory can be returned by repeating the process in opposite i.e. pay money to return good memories, receive money for returning bad memories.",
    "appears_in": [
      "Memory Bank"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/9/97/MC1CZaSd99-1.jpg/revision/latest/scale-to-width-down/350?cb=20200506081024\u0026path-prefix=en"
  },
  {
    "eng_name": "Mind Reading Helmet (gadget)",
    "jp_name": "さとりヘルメット",
    "description": "Doraemon brings out this gadget to help Nobita who was tricked by Gian.",
    "appears_in": [
      "Mind Reading Helmet"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/06/Mindreadinghelmetgadget.jpg/revision/latest/scale-to-width-down/350?cb=20141024150732\u0026path-prefix=en"
  },
  {
    "eng_name": "Mini Black Hole",
    "jp_name": "ミニブラックホール Miniburakkuhōru",
    "description": "This gadget is basically the miniature version of a big bad black hole which usually stay in space. Black holes are such things that even don't let light escape from itself so this gadget has to be handled very carefully! One mistake and slowly you, your house, your city, country, continent and then the entire planet gets sucked in! This gadget is just as scary as a real black hole...\nIf you drink a medicine that breaks the effects of this gadget, the sucked objects however will reappeared in the supposed place that your...",
    "appears_in": [
      "Nobita's Black Hole",
      "The Mystery of Goodie Land"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/5/57/Mini_Black_Hole.PNG/revision/latest/scale-to-width-down/350?cb=20151003084811\u0026path-prefix=en"
  },
  {
    "eng_name": "Mini Garden Series",
    "jp_name": "箱庭シリーズ・急流山 Hakoniwa Shirīzu: Kyūryūzan箱庭シリーズ・赤松山 Hakoniwa Shirīzu: Akamatsuyama箱庭シリーズ・岩山 Hakoniwa Shirīzu: Iwayama箱庭シリーズ・ゲレンデ山 Hakoniwa Shirīzu: Gerendeyama箱庭シリーズ・ハイキング山 Hakoniwa Shirīzu: Haikinguyama箱庭シリーズ・冒険山 Hakoniwa Shirīzu: Bōkenyama",
    "description": "Mini Garden Series (箱庭シリーズ Hakoniwa Shirīzu) is the series of Doraemon's gadget. These gadgets is useless if the user hasn't Small Light.\n\nMain article: White Water Mountain\nThe White Water Mountain is the suitable mountain for fishing.\n\nThe Japanese Red Pine Mountain is the suitable mountain for mushroom picking.\n\nMain article: Rocky Mountain\nThe Rocky Mountain is the suitable mountain for practicing rock climbing.\n\nMain article: Snowy Mountain\nThe Snowy Mountain is the suitable mountain for skiing.\n\nMain article: Hiking Mountain\nThe Hiking Mountain is the  mountain for kids. This mountain can use for hiking and picnic.\n\nMain article: Adventurous Mountain\nThe Adventurous Mountain is the  mountain for adventure.",
    "appears_in": [
      "Mushroom Picking with a Mini Garden"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/7/7e/Mini_Garden_Series_White_Water_Mountain.PNG/revision/latest/scale-to-width-down/350?cb=20150830130513\u0026path-prefix=en"
  },
  {
    "eng_name": "Mini-Doras",
    "jp_name": "ミニドラ MinidoraGeneral informationCasual informationRelationshipsOther DetailsGallery",
    "description": "Mini-Doras are one of Doraemon's gadgets. \nMini-Doras were robots created by the Matsushiba Robot Factory per Time Patrol's request to celebrate Doraemon's heroism in helping them to arrest two terrorists.\n\nBeing smaller clones of Doraemon with different paint jobs, they are sentiment automatons that act as tiny helpers, capable of performing wide variety of tasks while communicating with the \"Minidora\" language. They appear to be capable of understanding other types of human languages.\nThey also have the ability to use gadgets, albeit to a lesser extent due to their size. However, they are not as effective as Doraemon himself or other similar machines such as Dorami.\nLike Doraemon himself, they are agitated if referred to with the alias \"raccoon\".",
    "appears_in": [
      "Doraemon: Nobita's Treasure Island",
      "Doraemon in India",
      "Doraemon in Indonesia",
      "Mini-Dora SOS!!",
      "Doraemon: Nobita and the Green Giant Legend DS",
      "The Doraemons",
      "Dorarinyo",
      "4D Pocket"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/06/Minidoras.jpg/revision/latest?cb=20130914122556\u0026path-prefix=en"
  },
  {
    "eng_name": "Missing Person Stick",
    "jp_name": "たずね人(びと)ステッキ Tazunebitosutekki",
    "description": "It use indicate the the direction of a person you want to find. However, if the person you want to find is from another timeline, it will cause confusion.",
    "appears_in": [
      "45 Years Later... My Future Self Came to Visit/2005 Anime",
      "Running Away to the Cretaceous Period",
      "Nobita Meets the Masked Queen",
      "Nobita and the Birth of Japan 2016",
      "Stand by Me Doraemon 2"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/2/21/Missingpersonstick.PNG/revision/latest/scale-to-width-down/350?cb=20191209031812\u0026path-prefix=en"
  },
  {
    "eng_name": "Mole Gloves",
    "jp_name": "もぐら手袋 Mogura tebukuro",
    "description": "The gloves are mostly in color with the mix of green on the sharp parts. It looks very easy to wear and is large and can fit anyone's hands easily. \nThis gadget used to make hole in the ground or create underpass. This gadget can dig the deepest holes and cut through the ground like butter.",
    "appears_in": [
      "Nobita's Space Heroes",
      "Nobita's New Great Adventure into the Underworld – The Seven Magic Users"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/07/Mole_Gloves.PNG/revision/latest/scale-to-width-down/350?cb=20151011091637\u0026path-prefix=en"
  },
  {
    "eng_name": "Momotaro Jirushi's Millet Dumplings",
    "jp_name": "桃太郎印のきびだんごMomotarō Jirushi no Kibidango",
    "description": "It was used to tame a beast. Once it got rotten, it will lose its effect.",
    "appears_in": [
      "Nobita's Dinosaur",
      "Nobita and the Haunts of Evil",
      "Nobita's Dinosaur 2006",
      "The New Nobita's Great Demon ~Peko and the Exploration Party of 5~",
      "Nobita and the Island of Miracles ~Animal Adventure~",
      "The Time Machine Disappeared!!",
      "Nobita Meets the Masked Queen",
      "I'm Mini Doraemon",
      "Doraemon: New Nobita's Great Demon ~Peko and the Exploration Party of 5~"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/d/d4/Momotaro_Training_Dango_2005_anime.PNG/revision/latest/scale-to-width-down/350?cb=20151020053737\u0026path-prefix=en"
  },
  {
    "eng_name": "Moodmaker Orchestra",
    "jp_name": "ムードもりあげ楽団",
    "description": "By playing their instrument, they can change one's mood.",
    "appears_in": [
      "The Debut of the Mood-Changing Orchestra!",
      "Doraemon: Nobita in the Robot Kingdom",
      "Doraemon: Nobita's Secret Gadget Museum",
      "Nobita's Space Heroes"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/6/63/Moodmaker_Orchestra.png/revision/latest/scale-to-width-down/350?cb=20140905101628\u0026path-prefix=en"
  },
  {
    "eng_name": "Moses Stick",
    "jp_name": "モーゼステッキ Mōzesutekki",
    "description": "It looks like a stick of an old man and is brown in color. It has some buttons on it too. It is also a very long stick. \nIt can split the water into two even seas. If the gadget turned off or out of baterry, the water returns to the original.",
    "appears_in": [
      "Nobita and the Winged Braves",
      "The Moses Stick",
      "wikipedia:Moses",
      "wikipedia:Red Sea"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/d/d1/Moses_Stick.PNG/revision/latest/scale-to-width-down/350?cb=20160406033219\u0026path-prefix=en"
  },
  {
    "eng_name": "Mother Robot: The Substitute Mother Egg",
    "jp_name": "ハハオヤロボット:  オフクローのたまごHahaoyarobotto: Ofukurō no tama go",
    "description": "Hahaoyarobotto: Ofukurō no tama goSubstitute Mother Egg (オフクローのたまご) is a Doraemon's gadget.\nUpon activation, it shatters and generates a prosthetic, anthropomorphic mechanical female owl after several seconds. Once the owl hatches, she recognizes the first living thing as her target and become a caretaker for the subject. She functions for 8 hours, after which she returns to her dormant state in the shell",
    "appears_in": [
      "But Doraemon Wants a Mom"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/a/ad/Mother_Robot_The_Substitute_Mother_Egg.png/revision/latest/scale-to-width-down/350?cb=20150926031301\u0026path-prefix=en"
  }
]
