[
  {
    "eng_name": "Obtaining Bag",
    "jp_name": "取り寄せバッグ (とりよせバッグ) Toriyose Baggu",
    "function": "Doraemon trying to get Shizuka from the bag.Think of a item and the user will be able to get it from the purse such as the Anywhere Door and food.\nThe items pulled out from it can 'distort' similar to how Doraemon pull out most large gadget from the 3D Pocket. Thus, it may be used to take a plethora of item with wide range of sizes.\nHowever, is something doesn't exist or not allowed to get, the gadget electrifies the user. In a episode, Doraemon tries to get Shizuka through the bag but fails because Shizuka is taking a bath at that time.",
    "appears_in": [
      "Doraemon: Nobita and the Castle of the Undersea Devil",
      "Nobita and the Fantastic Three Musketeers",
      "Nobita and the Wind Wizard",
      "Stand by Me Doraemon",
      "I've Got a Spare Fourth Dimensional Pocket",
      "The Suneo Kidnapping Case",
      "Nobita's Long Day",
      "Doraemon: Nobita's Great Adventure in the Antarctic Kachi Kochi",
      "Doraemon Is An Exam Student Now!?",
      "Stand by Me Doraemon",
      "Doraemon Gadget Rush",
      "Special:Categories",
      "Category:Gadgets",
      "Category:Gadgets originated from original manga"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/0/0b/Purse_Gadget.png/revision/latest/scale-to-width-down/350?cb=20150906063050\u0026path-prefix=en"
  },
  {
    "eng_name": "Odd Umbrellas",
    "jp_name": "人さがしかさ Hitosagashi Kasa祝傘 Iwai Kasa愛傘 Ai Kasaマラソン傘 Marason Kasaお化け傘 Obake Kasaコウモリ傘 Kōmori Kasa嵐傘 Arashi Kasaあいあいパラソル Aiai Parasoru",
    "function": "The Odd Umbrellas (おかしな傘 Okasina Kasa) is a set of gadget umbrellas belonging to Doraemon.\n\n\nNobisuke called to tell Tamako that Nobita is not at the train station, so she sends Doraemon to look for Nobita. He takes out the umbrella, which tells him where Nobita is by pointing to his direction. Nobita and Doraemon continue to use it during the rain.\n\n\nWhen opened, the umbrella acts as a party popper which fully covers the user in streamers.\n\n\nThe Rotation Umbrella is an umbrella used for babies.\nWhen opened, baby objects come out of the umbrella and rotates in a clockwise direction. Several commuters coming in and out of the train station can be seen to admire Nobisuke's umbrella when he uses it in the 2005 anime.\n\n\nThe Muscle Umbrella is an umbrella used to train the body to have strong muscles.\nDue to its heavy weight, Nobisuke struggles and ends up injured using it.\n\n\nThe Love Umbrella (愛傘 Ai Kasa) is an umbrella introduced in the 2005 anime used to create holograms of ideal girlfriends.\nFor a start, the umbrella creates a hologram when opened. The umbrella has a turning button that creates new holograms that surround him, so the user could have as many ideal girlfriends as he wish. Nobita creates six of them, and caused Shizuka, who is on her way to violin class, to have a mistaken impression.\n\n\nThe Marathon Umbrella (マラソン傘 Marason Kasa) is an umbrella used to run a marathon.\nIt is introduced only in the 2005 anime; when held, it sends the user running without stopping, and the user would not feel tired at all. Currently, it could only be stopped when the user lets it go.\n\n\nThe Ghost Umbrella (お化け傘 Obake Kasa) is an umbrella introduced in the 2005 anime used to summon ghost (monsters).\nGian demands Doraemon to take out a similar umbrella Nobisuke is using. He takes this out, and to Gian's horror, monsters appear when it is opened, sending him running away.\n\n\nThe Bat Umbrella (コウモリ傘 Kōmori Kasa) is an umbrella used to fly.\nThis umbrella takes the user to where he wishes to go. In the 1979 anime, Nobisuke used at the train station, whereas in the 2005 anime, he used it after he used the Marathon Umbrella. Sending him flying, he ends up on top of a tree and loses the umbrella.\n\n\nThe Parachute Umbrella is an umbrella that is similar to a parachute. It can land someone, who is trapped in the air, back to safety.\n\n\nThe Storm Umbrella (嵐傘 Arashi Kasa) is an umbrella used to create a thunderstorm. It has no protection against the rain, and leaves the user exposed to it.\nDue to its resemblance with Nobita's umbrella, Doraemon ends up lending Nobisuke the Storm Umbrella by accident. Annoyed, Nobisuke chases after Nobita and Doraemon.\n\nMain article: Emotional Umbrella\nThe Emotional Umbrella (あいあいパラソル Aiai Parasoru) is a umbrella used to make person in the right side of umbrella will fall in love on the person in the left side.",
    "appears_in": [
      "The Odd, Odd Umbrellas",
      "The Odd, Odd Umbrellas",
      "The Odd, Odd Umbrellas",
      "The Odd, Odd Umbrellas",
      "The Odd, Odd Umbrellas",
      "The Odd, Odd Umbrellas",
      "The Odd, Odd Umbrellas",
      "The Odd, Odd Umbrellas",
      "The Odd, Odd Umbrellas",
      "The Odd, Odd Umbrellas",
      "The Love-Love Parasol",
      "Doraemon (2005 anime)",
      "Special:Categories",
      "Category:Gadgets",
      "Category:Set of Gadgets"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/c/c5/Payung_1.PNG/revision/latest/scale-to-width-down/350?cb=20151009035307\u0026path-prefix=en"
  },
  {
    "eng_name": "Out With The Demons Beans",
    "jp_name": "鬼は外ビーンス",
    "function": "The beans are used to transfer things and people (usually undesired) from one place to another. For example, if someone puts a rubber into a bottle, the user can’t the rubber out. An \"Out With The Demons\" bean, however, can be used to extract the rubber from the bottle. Simply saying \"Out with the Demons!\" whilst throwing the bean at the target will have the object or person moved to another location (in this case, the rubber would end up immediately outside the bottle).",
    "appears_in": [
      "The \"Out with the Demons\" Beans",
      "Doraemon: Nobita's Secret Gadget Museum",
      "Nobita's Great Adventure into the Underworld",
      "Special:Categories",
      "Category:Gadgets"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/3/34/Demon_Out.jpg/revision/latest/scale-to-width-down/350?cb=20151012112723\u0026path-prefix=en"
  },
  {
    "eng_name": "Overseas Ryococchi",
    "jp_name": "海外リョコッキ \"Kaigai Ryokokki\"",
    "function": "With this gadget, you can feel what it's like to go to that country in your area. Equipped with a expert world tour guide, it will ready to guide you to go to a country you choose it. If you want to raise the taste, people around you will start talking language according to the country you choose, and the area around you will turn into that country place. The effect canceled if you remove this gadget.",
    "appears_in": [
      "Travelling abroad to Paris!",
      "Special:Categories",
      "Category:Gadgets"
    ],
    "image_url": "https://static.wikia.nocookie.net/doraemon/images/1/16/Overseas_ryococchi.jpeg/revision/latest/scale-to-width-down/350?cb=20240910042913\u0026path-prefix=en"
  }
]
